{
    "categoryIndex": 1,
    "sectionIndex": 1,
    "title": "Hobby - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=572",
    "lessonIndex": 132,
    "html": "<h1>Hobby - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L33/practice/L33P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L33/practice/L33P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L33/practice/L33P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Bob. Whatcha doing?&quot;<br>B: &quot;I&apos;m at home painting.&quot;<br>A: &quot;I didn&apos;t know you paint. What type of painting is it?&quot;<br>B: &quot;I enjoy oil painting. I learned it in one of my extra classes in college.&quot;<br>A: &quot;That sounds so interesting. I wish I learned a hobby.&quot;<br>B: &quot;Hobbies are never too late to learn. They offer a variety of classes at the local community college. You should look into it.&quot;<br>A: &quot;I think I will. Thanks for the info.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L33/practice/L33P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L33/practice/L33P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L33/practice/L33P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Joanne. What are you up to?&quot;<br>B: &quot;I&apos;m just watching some television.&quot;<br>A: &quot;I&apos;m so bored. I don&apos;t know what I&apos;m going to do today and it is only ten in the morning.&quot;<br>B: &quot;Me too. Do you think we are boring people?&quot;<br>A: &quot;I don&apos;t think we are boring. It&apos;s just that we don&apos;t have any hobbies.&quot;<br>B: &quot;That&apos;s right. What do you think we should do as a hobby?&quot;<br>A: &quot;That all depends on what you like to do. For example, I like to doodle on the notepad, so I&apos;m thinking about doing some real drawings.&quot;<br>B: &quot;I like to play the piano for fun.&quot;<br>A: &quot;Yeah. That can be a good hobby.&quot;<br>B: &quot;Hobbies are great. I&apos;m going to make a list of all the things I like to do.&quot;<br>A: &quot;That&apos;s a great idea. I&apos;m going to do the same.&quot;<br></td></tr></table>"
}