{
    "lessonIndex": 142,
    "categoryIndex": 1,
    "sectionIndex": 1,
    "title": "Intro and General Things Review - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=583",
    "html": "<h1>General Things Review - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L40/practice/L40P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L40/practice/L40P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L40/practice/L40P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;How are you doing?&quot;<br>B: &quot;I&apos;m doing great.&quot;<br>A: &quot;What movies have you seen lately?&quot;<br>B: &quot;I saw Forrest Gump the other day.&quot;<br>A: &quot;What type of movie is that?&quot;<br>B: &quot;The movie type is drama.&quot;<br>A: &quot;I can&apos;t believe you are watching movies. The weather is great. You should be outside.&quot;<br>B: &quot;I hate the hot weather. I&apos;d rather stay indoors with the air conditioner.&quot;<br>A: &quot;What else do you like to do besides watching movies?&quot;<br>B: &quot;I like to play computer games, read books, go shopping, and play pool.&quot;<br>A: &quot;Out of those what is your favorite?&quot;<br>B: &quot;My favorite is to play computer games.&quot;<br>A: &quot;What is your favorite computer game?&quot;<br>B: &quot;My favorite is Diablo. It used to be Star Craft, but it is getting a little old.&quot;<br>A: &quot;If you like to play so much, when do you ever exercise?&quot;<br>B: &quot;Although I hate to exercise, I go jogging at least twice a week.&quot;<br>A: &quot;That&apos;s pretty good. By the way, what are you doing next Saturday?&quot;<br>B: &quot;I am going to go to the bookstore.&quot;<br>A: &quot;I am having a party Saturday night at my house. If you have time, you should come.&quot;<br>B: &quot;That sounds like fun.&quot;<br>A: &quot;Great. I&apos;ll see you on Saturday.&quot;<br>B: &quot;Ok. See you later.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L40/practice/L40P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L40/practice/L40P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L40/practice/L40P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hello?&quot;<br>B: &quot;Hi Steve. This is Mike. What are you doing?&quot;<br>A: &quot;Oh, hi. I was just watching TV.&quot;<br>B: &quot;There&apos;s nothing to watch right now.&quot;<br>A: &quot;I know. I was watching a re-run. I have nothing to do and I was bored.&quot;<br>B: &quot;Me too. Let&apos;s get together and do something.&quot;<br>A: &quot;I&apos;d like to, but I have to meet my parents in an hour for dinner. How about tomorrow?&quot;<br>B: &quot;Yeah. Let&apos;s plan something tomorrow.&quot;<br>A: &quot;Did you hear the weather forecast for tomorrow?&quot;<br>B: &quot;I think it is going to be the same as today. Clear and sunny.&quot;<br>A: &quot;That&apos;s great. We can do something outdoors then.&quot;<br>B: &quot;Are there any special events going on tomorrow?&quot;<br>A: &quot;Yeah. I think there&apos;s a live outdoor concert by the river tomorrow.&quot;<br>B: &quot;Oh yeah. I heard about that too. Let&apos;s go check it out.&quot;<br>A: &quot;Do you know what time it starts?&quot;<br>B: &quot;It starts at one PM.&quot;<br>A: &quot;Let&apos;s meet for lunch at eleven thirty and afterwards, we can head over there.&quot;<br>B: &quot;Perfect. I&apos;ll see you in front of the apartment at eleven thirty.&quot;<br><br></td></tr><tr><td>3 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L40/practice/L40P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L40/practice/L40P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L40/practice/L40P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Steve. Is that you?&quot;<br>B: &quot;Yeah. What&apos;s going on?&quot;<br>A: &quot;Not much. What a surprise to see you here.&quot;<br>B: &quot;Yeah. It&apos;s been a couple of months since I saw you.&quot;<br>A: &quot;What have you been up to?&quot;<br>B: &quot;I just started working out.&quot;<br>A: &quot;Really? Where do you work out at?&quot;<br>B: &quot;I joined the Samsung Health Club last month.&quot;<br>A: &quot;What do you mostly do during your workout?&quot;<br>B: &quot;I concentrate mostly on my legs, chest, arms and stomach.&quot;<br>A: &quot;I should start exercising more.&quot;<br>B: &quot;It&apos;s hard work while exercising, but it is a great feeling when I get done.&quot;<br>A: &quot;I have a running machine at home. I used to use it, but I already got sick of it.&quot;<br>B: &quot;Exercising at home is hard. The environment is not suited for exercising.&quot;<br>A: &quot;If I want to exercise, I will need to join a gym.&quot;<br>B: &quot;I have a couple of guest passes. You want to check out my health club.&quot;<br>A: &quot;That&apos;s a good idea. Let&apos;s go over the weekend.&quot;<br>B: &quot;Great. I&apos;ll call you Saturday morning.&quot;<br>A: &quot;Aright. I&apos;ll talk to you later.&quot;<br>B: &quot;Ok. Bye.&quot;<br><br></td></tr><tr><td>4 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L40/practice/L40P4.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L40/practice/L40P4b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L40/practice/L40P4a.mp3\">Person B</a></td></tr><tr><td>A: &quot;The weather is terrible.&quot;<br>B: &quot;Yeah. It&apos;s been raining a lot these days.&quot;<br>A: &quot;I have been watching a lot of videos at home because of the constant rain.&quot;<br>B: &quot;Have you heard when it&apos;s supposed to get better?&quot;<br>A: &quot;I saw the weather report, and it&apos;s going to rain for the next eight days.&quot;<br>B: &quot;That sucks so much. What are we going to do?&quot;<br>A: &quot;I&apos;m getting pretty bored. We should do something despite the rain.&quot;<br>B: &quot;I&apos;m with you. What do you have in mind?&quot;<br>A: &quot;I haven&apos;t been to the Mall in a long time. Let&apos;s go.&quot;<br>B: &quot;That sounds good. They have a movie theatre there, so if we get bored, we can watch a movie.&quot;<br>A: &quot;Great. I&apos;ll stop by your place now.&quot;<br>B: &quot;Ok. Don&apos;t forget to bring your umbrella. The rain can start up again anytime.&quot;<br></td></tr></table>"
}