{
    "categoryIndex": 1,
    "sectionIndex": 2,
    "title": "University Life - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=821",
    "lessonIndex": 146,
    "html": "<h1>University Life - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L43/practice/L43P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L43/practice/L43P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L43/practice/L43P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hi. My name is Mark.&quot;<br>B: &quot;Mark? I&apos;m Bill. Glad to meet you.&quot;<br>A: &quot;Yeah. So where are you from?&quot;<br>B: &quot;I&apos;m from Houston Texas.&quot;<br>A: &quot;Oh... I&apos;m from Southern California.&quot;<br>B: &quot;So, what year are you?&quot;<br>A: &quot;I&apos;m a freshman.&quot;<br>B: &quot;This is my first year too.&quot;<br>A: &quot;So what made you decide to come to California for school? I hear Austin is a good school.&quot;<br>B: &quot;It&apos;s aright, but I think Berkeley is better.&quot;<br>A: &quot;So is this where you wanted to come?&quot;<br>B: &quot;To tell you the truth, I wanted to go to Stanford. I made it on the waiting list, but ninety nine percent of the people accepted to Stanford go there. Like, who wouldn&apos;t right?&quot;<br>A: &quot;Very true. But this is still a good school.&quot;<br>B: &quot;I&apos;m not complaining. I just know that I wanted to come to California. Texas is cool and all, but I wanted to experience different things.&quot;<br>A: &quot;That&apos;s good. Do you know what you plan on majoring in?&quot;<br>B: &quot;I was thinking about political science, but now I&apos;m leaning towards English literature. How about you?&quot;<br>A: &quot;I plan on majoring in double E.&quot;<br>B: &quot;Do you know where the Smith building is? I have to pick up the syllabus for my psychology class. I missed the first day.&quot;<br>A: &quot;That&apos;s a great start. It&apos;s over there by the library.&quot;<br>B: &quot;It was nice meeting you.&quot;<br>A: &quot;Yeah. We should hang out later.&quot;<br>B: &quot;Cool. I&apos;ll see you tomorrow in class then.&quot;<br>A: &quot;Aright. Later.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L43/practice/L43P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L43/practice/L43P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L43/practice/L43P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hi. What&apos;s your name?&quot;<br>B: &quot;My name is Jung Min. What&apos;s your name?&quot;<br>A: &quot;My name is Jessica. It&apos;s nice to meet you.&quot;<br>B: &quot;Yes. It&apos;s nice to meet you too. Are you a new student too?&quot;<br>A: &quot;No. I&apos;m a sophomore. I take it you are a new student?&quot;<br>B: &quot;Yeah. It&apos;s pretty exciting to be here.&quot;<br>A: &quot;Have fun while it lasts. The excitement wears off real quick. Especially after you see how much homework you get. Where are you from?&quot;<br>B: &quot;I&apos;m from Korea. My parents wanted me to go to an American university, so I came here.&quot;<br>A: &quot;I have never been to Korea. I&apos;ve been to Japan before, but never Korea.&quot;<br>B: &quot;Why were you in Japan?&quot;<br>A: &quot;My father thought it would be a good experience to take a vacation to a different country. He&apos;s so into learning about different cultures.&quot;<br>B: &quot;That&apos;s pretty cool.&quot;<br>A: &quot;I thought it would have been more fun if I went without my parents.&quot;<br>B: &quot;Well, if you ever want to visit Korea, I would be happy to show you around.&quot;<br>A: &quot;Thanks for the offer. I&apos;ll keep that in mind. Oh, the professor is coming. We&apos;ll talk more after class.&quot;<br>B: &quot;Ok.&quot;<br></td></tr></table>"
}