{
    "categoryIndex": 1,
    "sectionIndex": 2,
    "title": "University Classes - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=592",
    "lessonIndex": 151,
    "html": "<h1>University Classes - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L47/practice/L47P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L47/practice/L47P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L47/practice/L47P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey John, did you register for classes yet?&quot;<br>B: &quot;I register this Friday.&quot;<br>A: &quot;What classes do you plan on taking?&quot;<br>B: &quot;I really want to take the communication class, but I don&apos;t know if it will be available.&quot;<br>A: &quot;Is that class really that popular?&quot;<br>B: &quot;Yeah. I tried to get in last semester, but it was full by the time I registered.&quot;<br>A: &quot;What other classes are you going to take?&quot;<br>B: &quot;I still need to take English 201, but I really don&apos;t like writing.&quot;<br>A: &quot;I took that class already. There is a lot of writing, but it&apos;s not that bad.&quot;<br>B: &quot;Oh really? Who was the instructor? There are like 4 different instructors to choose from.&quot;<br>A: &quot;I had Professor Mahoney.&quot;<br>B: &quot;Is he an easy grader?&quot;<br>A: &quot;I&apos;m not sure if he is or not, but I thought he was definitely fair.&quot;<br>B: &quot;Do you mind if I ask you what you got?&quot;<br>A: &quot;Not at all. I got a 3.8.&quot;<br>B: &quot;Well, what did you get in English 101 last year?&quot;<br>A: &quot;I got a 4.0 in that class.&quot;<br>B: &quot;Well, I can&apos;t compare to you. I got a 3.1 in English 101. That means if you got a lower grade in English 201, it must be harder.&quot;<br>A: &quot;It&apos;s not what it appears. I actually tried harder in the 101 class. If I put as much effort into the 201 class, I would have received the same grade.&quot;<br>B: &quot;Oh. That helps. Thanks.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L47/practice/L47P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L47/practice/L47P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L47/practice/L47P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Mike. I forgot about registration. I&apos;m a day late, so all the classes are mostly full. What do you think I should do?&quot;<br>B: &quot;You&apos;re screwed. You can&apos;t do anything about that. You have to hope that you get some classes that will be useful.&quot;<br>A: &quot;Do you think going to the registration building will help at all.&quot;<br>B: &quot;No. They will tell you the same thing in a worse way.&quot;<br>A: &quot;Did you register yet?&quot;<br>B: &quot;Of course. Registering for classes is not something you want to miss.&quot;<br>A: &quot;What classes do you think are still open?&quot;<br>B: &quot;Well, I know psychology 101 is a big class, so there will always be seats in that class. You can also get into Sociology.&quot;<br>A: &quot;That&apos;s helpful. Thanks. But what do you think about philosophy. I wanted to take that class this semester.&quot;<br>B: &quot;I took that class last year. The professor is really cool, so if you go to his office, you can have him sign a card that will let you in even if the class is full.&quot;<br>A: &quot;He does that?&quot;<br>B: &quot;I guess that&apos;s because so many people drop out of that class.&quot;<br>A: &quot;That makes sense. I think I&apos;ll do that. Thanks for all the help.&quot;<br>B: &quot;No problem man.&quot;<br><br></td></tr><tr><td>3 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L47/practice/L47P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L47/practice/L47P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L47/practice/L47P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Did you get your grades yet?&quot;<br>B: &quot;Yeah. My whole GPA is screwed up now.&quot;<br>A: &quot;Why? What happened?&quot;<br>B: &quot;Well, I bombed my econ final and ended up with a 1.7.&quot;<br>A: &quot;Ouch. You must be very disappointed.&quot;<br>B: &quot;Well, it&apos;s my fault because I didn&apos;t study as much as I should have.&quot;<br>A: &quot;Why don&apos;t you re-take the class next year?&quot;<br>B: &quot;That&apos;s what I plan on doing unless I keep screwing up. How did you do this semester?&quot;<br>A: &quot;I didn&apos;t do that well either. I ended up with a 3.2 this semester. That drops my total GPA to 3.45.&quot;<br>B: &quot;My GPA is pretty similar to yours. I have a 3.1 now because of the stupid econ class.&quot;<br>A: &quot;What was your GPA before this semester?&quot;<br>B: &quot;I was sitting happy with a 3.4.&quot;<br>A: &quot;Why did it go down so much?&quot;<br>B: &quot;Let&apos;s just say I screwed up more than my econ class.&quot;<br>A: &quot;What happened to you?&quot;<br>B: &quot;I started playing StarCraft and ended up wasting a lot of time.&quot;<br>A: &quot;You better stop slacking off.&quot;<br>B: &quot;You&apos;re right. I&apos;m not going to play games during school anymore.&quot;<br><br></td></tr><tr><td>4 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L47/practice/L47P4.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L47/practice/L47P4b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L47/practice/L47P4a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Did you ever take History 231?&quot;<br>B: &quot;Yeah. Last semester.&quot;<br>A: &quot;Who was the professor?&quot;<br>B: &quot;It was Professor Johnson.&quot;<br>A: &quot;I have him this semester. What do you think about him?&quot;<br>B: &quot;He&apos;s a terrible instructor and demands a lot, but fortunately, he&apos;s an easy grader.&quot;<br>A: &quot;What did you end up getting?&quot;<br>B: &quot;I got an A-. Sounds good, but none of my test scores were that high, so I don&apos;t know how I got a decent grade.&quot;<br>A: &quot;That&apos;s probably because he grades on a curve.&quot;<br>B: &quot;Are you enjoying the class so far?&quot;<br>A: &quot;I hate it and I was about to withdrawal. But after hearing your experience, I think I will tough it out.&quot;<br>B: &quot;Yes. Definitely stay in the class. You will get a better grade than your test scores. He does that deliberately to make all the students study a lot.&quot;<br>A: &quot;Thanks for letting me know. I feel relieved now.&quot;<br><br></td></tr><tr><td>5 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L47/practice/L47P5.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L47/practice/L47P5b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L47/practice/L47P5a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hi Mark.&quot;<br>B: &quot;Oh, hi Stacy.&quot;<br>A: &quot;How was your summer vacation?&quot;<br>B: &quot;I worked over the summer at a restaurant. Have to make tuition money right? What did you do?&quot;<br>A: &quot;I took summer school. I withdrew from two of my classes last year so I wanted to make them up.&quot;<br>B: &quot;So are you officially a junior now?&quot;<br>A: &quot;Yeah. And I have 5 credits to spare. I only needed to take 10 credits over the summer, but I took 15 because the price was the same.&quot;<br>B: &quot;That makes sense. So where is Nicole?&quot;<br>A: &quot;She dropped out of school completely.&quot;<br>B: &quot;Really? Why?&quot;<br>A: &quot;She worked at a startup company as an intern and since the business did well, they asked her if she wanted to work full time.&quot;<br>B: &quot;Wow. She&apos;s so lucky. She doesn&apos;t have a degree and she already has a job.&quot;<br>A: &quot;It sounds good now, but I&apos;m traditional. I want the degree, so I wouldn&apos;t have accepted the offer.&quot;<br>B: &quot;Do you know how much they are paying her?&quot;<br>A: &quot;I don&apos;t know. But I bet it must have been a good offer, or she wouldn&apos;t have accepted it.&quot;<br></td></tr></table>"
}