{
    "lessonIndex": 157,
    "categoryIndex": 1,
    "sectionIndex": 2,
    "title": "Roommate - Dormitory",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=598",
    "html": "\r\n<h1>\r\nRoommate - Dormitory\r\n</h1>\r\nWhile in school it is common to have a roommate when you are in the dormitory. &#xA0;In the States, it&apos;s also common to share an apartment with a roommate. &#xA0;This lesson will cover the English you will need to talk to your roommate. &#xA0;Of course you can talk about many tings, but I will specifically target this lesson towards roommate stuff.<br><br><b>Dormitory Roommate</b><br><br>When you first go into a dormitory, you will either be greeted by the person already there, or you will have to greet someone that is coming later than you. &#xA0;Most dormitories have one room for two people. &#xA0;After the dormitory section, I will cover living in an apartment with a roommate.<br><br>When you arrive to the dormitory, you can usually engage in small talk first. &#xA0;Most of the time, you have to get to know one another. &#xA0;Talk is initiated by both parties simultaneously. &#xA0;You can ask questions like where they came from, what year they are in, or what they like to do. &#xA0;But besides that, you have to find out the living habits of each other. &#xA0;After you engage in small talk, you can ask these questions:<br><br>It&apos;s important to know the sleeping habits of your roommate, so ask if they are a night person or a morning person.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L52/sentence/L52S1.mp3\">So, are you a night owl or a morning bird?</a>&quot;<br><br>A night person is referred to as an owl. &#xA0;That is because owls are more active at night. &#xA0;Birds on the other hand wake up early. &#xA0;So they associate morning people to birds.<br><br>If you don&apos;t want to use this expression, you can ask,<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L52/sentence/L52S2.mp3\">Are you a night person or a morning person?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L52/sentence/L52S3.mp3\">What time do you usually go to sleep?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L52/sentence/L52S4.mp3\">What time do you usually wake up?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L52/sentence/L52S5.mp3\">If you didn&apos;t have anything to do the next day, what time would you sleep till?</a>&quot;<br><br>It&apos;s common courtesy to respect each other. &#xA0;If you are asleep, the roommate should be quiet. &#xA0;This goes for you too.<br><br>When you get sleepy, you can either go to sleep, or tell your roommate that you are going to sleep.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L52/sentence/L52S6.mp3\">I&apos;m a little tired. &#xA0;I&apos;m going to sleep now. &#xA0;Have a good night.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L52/sentence/L52S7.mp3\">I&apos;m sleepy. &#xA0;Time to go to bed. &#xA0;See you in the morning.</a>&quot;<br><br>If you like listening to music, you can ask your roommate,<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L52/sentence/L52S8.mp3\">Does the music bother you?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L52/sentence/L52S9.mp3\">Let me know if you want me to turn the music off.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L52/sentence/L52S10.mp3\">Do you mind if I turn the stereo on?</a>&quot;<br><br>But when you ask questions about music or TV, you should make sure that person is not studying. &#xA0;If they are, then it&apos;s pointless to ask because it should be quiet. &#xA0;This is only good for times when you are both doing nothing.\r\n"
}