{
    "categoryIndex": 1,
    "sectionIndex": 2,
    "title": "Roommate - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=601",
    "lessonIndex": 160,
    "html": "<h1>Roommate - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L54/practice/L54P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L54/practice/L54P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L54/practice/L54P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hi. My name is Jack.&quot;<br>B: &quot;Hey Jack. I&apos;m Seth.&quot;<br>A: &quot;It&apos;s nice to meet you.&quot;<br>B: &quot;Looks like we&apos;re going to be roommates.&quot;<br>A: &quot;Yeah.&quot;<br>B: &quot;So where are you from?&quot;<br>A: &quot;I&apos;m from Tacoma. How about you?&quot;<br>B: &quot;I&apos;m from Ontario.&quot;<br>A: &quot;In Canada?&quot;<br>B: &quot;No. It&apos;s in California. It&apos;s a smaller city in southern California.&quot;<br>A: &quot;So what made you come here?&quot;<br>B: &quot;I wanted to go to a different state.&quot;<br>A: &quot;I see. Hey, if you don&apos;t mind, I took this side of the room.&quot;<br>B: &quot;No problem. They look the same to me.&quot;<br>A: &quot;Are you a morning person or a night person.&quot;<br>B: &quot;I&apos;m a night person.&quot;<br>A: &quot;That&apos;s great. So am I. I like to sleep in the morning.&quot;<br>B: &quot;That should work out well then.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L54/practice/L54P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L54/practice/L54P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L54/practice/L54P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hi. I&apos;m Sara.&quot;<br>B: &quot;My name is Jessica. It&apos;s nice to meet you.&quot;<br>A: &quot;Yes. It&apos;s nice to meet you as well.&quot;<br>B: &quot;Have you been here long?&quot;<br>A: &quot;I got here about an hour ago. Do you want me to show you around?&quot;<br>B: &quot;Yeah. That would be great. The most important is the bathroom right?&quot;<br>A: &quot;Definitely. But we have to share the bathroom with the whole floor. The break room is over there. The bathroom is right across from the break room, and finally, the RA (resident advisor) is in room 315.&quot;<br>B: &quot;I&apos;m glad there is a TV in the break room. I like to watch TV.&quot;<br>A: &quot;Me too. So I brought one. I haven&apos;t unpacked it yet, but it&apos;s a little TV that works.&quot;<br>B: &quot;Cool. I brought a refrigerator. I like to store some snacks in there. Feel free to use it.&quot;<br>A: &quot;That would be perfect. I think we&apos;re going to have a great time.&quot;<br>B: &quot;Do you sleep pretty late, or are you a morning person.&quot;<br>A: &quot;I have never been either. I&apos;m very flexible with sleeping times. Anyways, I&apos;m a deep sleeper so a little noise never bothers me.&quot;<br>B: &quot;That&apos;s good to know. I&apos;m usually a night person, but I&apos;m very quiet if my roommate is sleeping.&quot;<br>A: &quot;As long as you don&apos;t blast the music while I&apos;m sleeping, I should be fine. Did you eat lunch yet?&quot;<br>B: &quot;No. Is there a cafeteria in the building?&quot;<br>A: &quot;Yeah. I&apos;ll show you.&quot;<br><br></td></tr><tr><td>3 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L54/practice/L54P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L54/practice/L54P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L54/practice/L54P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;I&apos;m calling about the available room. Is it still available?&quot;<br>B: &quot;Yes it is. Do you know where we&apos;re located?&quot;<br>A: &quot;Yeah. I drove by this morning and I liked the location. What&apos;s the rent?&quot;<br>B: &quot;It&apos;s $850 a month. So you would pay $425 a month plus half of the bills.&quot;<br>A: &quot;How big is the place?&quot;<br>B: &quot;It&apos;s a two bedroom, one bath and roughly about 800 square feet.&quot;<br>A: &quot;Is the complex pretty quiet? Can you hear a lot of noise or anything like that?&quot;<br>B: &quot;They have a strict policy in the apartment complex concerning noise level. So it stays very quiet after 10 PM.&quot;<br>A: &quot;Are you the only person who lives there now?&quot;<br>B: &quot;Yeah. I&apos;m only looking for one roommate.&quot;<br>A: &quot;Everything sounds good. Can we schedule a time to meet so I can look at the place?&quot;<br>B: &quot;I&apos;m available anytime today or tomorrow.&quot;<br>A: &quot;How about if I come over now?&quot;<br>B: &quot;That works with me. But what is your name?&quot;<br>A: &quot;Oh, my name is Brad.&quot;<br>B: &quot;Ok. I&apos;m Randy. So I&apos;ll see you in a bit?&quot;<br>A: &quot;Should only take about 15 minutes to get there.&quot;<br>B: &quot;Sounds good.&quot;<br></td></tr></table>"
}