{
    "lessonIndex": 161,
    "categoryIndex": 1,
    "sectionIndex": 3,
    "title": "Fraternity and Sorority - Explanation",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=602",
    "html": "\r\n<h1>\r\nFraternity and Sorority - Explanation\r\n</h1>\r\nA big part of university life in America is the fraternity and sorority. &#xA0;Since many people do not know what they are, let me explain a little so you understand what I&apos;m talking about in this session.<br><br>Fraternity and sorority is a group of people that get together and live in a big building. &#xA0;They are in a special group that is defined by their own rules. &#xA0;Most of the students live in either apartments or dormitories, but an alternative is to live in a fraternity or a sorority. &#xA0;I don&apos;t know the short name for sorority, but the short name for a fraternity is a frat. &#xA0;It all depends on the sentence whether you should call it a fraternity or a frat. &#xA0;Also, fraternity and sorority have names and they are already established. &#xA0;The names are always Greek and so they named the area where these buildings are located, Greek Row.<br><br>Fraternity is the terminology used for guys, and sorority is what they use for the ladies. &#xA0;So if you are a guy, you will be looking at fraternities, and if you are a lady, you will be joining a sorority.<br><br>The price to live in a fraternity or a sorority is similar to the price of dormitories. &#xA0;There are many sizes, but as an example, a fraternity house might have 50 rooms. &#xA0;All rooms either hold 2 or sometimes 3 people. &#xA0;There is a kitchen and food is served at specific times.<br><br>If you want to get into a fraternity or sorority, you usually have to apply and interview with existing members. &#xA0;Popular ones are very picky and will not let some types of people in. &#xA0;Others are desperate to fill their rooms so they will accept anyone.<br><br>Almost everyone who has been in a fraternity or a sorority never regrets it. &#xA0;There are more people who regret not having lived in a fraternity than having lived in one. &#xA0;So if you plan on attending a university in the states and will be there for more than 2 years, you should definitely consider the frat or sorority life.<br><br>Here are some examples of fraternity and sorority names. &#xA0;I do not know these fraternities or sororities. &#xA0;I am using this as an example so you understand the naming scheme.<br><br>Alpha Phi Alpha Fraternity<br>Kappa Sigma Fraternity<br>Delta Tau Delta Fraternity<br><br>Zeta Phi Beta Sorority<br>Delta Sigma Theta Sorority<br>Sigma Gamma Rho Sorority\r\n"
}