{
    "lessonIndex": 166,
    "categoryIndex": 1,
    "sectionIndex": 3,
    "title": "College Partying",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=607",
    "html": "\r\n<h1>\r\nCollege Partying\r\n</h1>\r\nOne of the great things about college is the parties. &#xA0;However, it could be boring and dull for others. &#xA0;I&apos;m not saying it&apos;s fun for everyone. &#xA0;But if you like to drink, have fun with a lot of different people, it might just be your thing.<br><br>First, I&apos;ll explain the various parties you can attend. &#xA0;There are fraternity and sorority parties, parties at a friend&apos;s house, parties at clubs or bars, night clubs, and so on. &#xA0;That is what we will discuss here. &#xA0;We will have other sessions on different types of parties, but since we are on the college track right now, I will dedicate this session to partying while in school.<br><br>Usually, fraternity or a sorority party has a lot of drinking, a lot of people, and a lot of music. &#xA0;At the party, you usually mingle and meet a lot of people. &#xA0;Some people go to the parties to have sex. &#xA0;These can occur at many parties because there are a lot of rooms in the fraternity and sorority houses. &#xA0;But don&apos;t think this is all fun and games. &#xA0;There are some people who thinks these types of parties are boring. &#xA0;For the people who do not like to talk to strangers, it can really be boring. &#xA0;They will end up in a corner by themselves and have a beer or two and then go home. &#xA0;It basically depends on what type of atmosphere you like.<br><br>If you like this type of partying, the first thing you need to do is find the party.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L59/sentence/L59S1.mp3\">Where is everyone hanging out this weekend?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L59/sentence/L59S2.mp3\">Are there any good fraternity parties this weekend?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L59/sentence/L59S3.mp3\">Where does everyone go to party?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L59/sentence/L59S4.mp3\">Are there any parties to crash this weekend?</a>&quot;<br><br>An easier way to find a party is to have a friend who is in the loop.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L59/sentence/L59S5.mp3\">There&apos;s a party this weekend at the Kappa Sorority house. &#xA0;I think we can sneak in. &#xA0;Wanna go?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L59/sentence/L59S6.mp3\">There&apos;s a bunch of us going to the Last Supper Club in downtown. &#xA0;If you&apos;re not doing anything, you should join us.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L59/sentence/L59S7.mp3\">A friend of mine is having a party at a huge house. &#xA0;It&apos;s going to be a blast. &#xA0;Let&apos;s go man.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L59/sentence/L59S8.mp3\">There&apos;s going to be a kegger at my fraternity. &#xA0;You&apos;re welcome to come.</a>&quot;\r\n"
}