{
    "categoryIndex": 1,
    "sectionIndex": 3,
    "title": "College Partying - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=609",
    "lessonIndex": 168,
    "html": "<h1>College Partying - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L60/practice/L60P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L60/practice/L60P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L60/practice/L60P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey man. What&apos;s going on?&quot;<br>B: &quot;Not much. Just having a good time.&quot;<br>A: &quot;That&apos;s all good. What year are you?&quot;<br>B: &quot;I&apos;m a sophomore. How about you?&quot;<br>A: &quot;This is my third year.&quot;<br>B: &quot;Are you in this fraternity?&quot;<br>A: &quot;No. I&apos;m over at Beta Psi.&quot;<br>B: &quot;I have a friend over there. Do you know Johnny Parker?&quot;<br>A: &quot;Yeah. He joined us last year. He a friend of yours?&quot;<br>B: &quot;Yeah. We went to high school together.&quot;<br>A: &quot;Right on. What&apos;s your name?&quot;<br>B: &quot;Roger Dunkin. How about you?&quot;<br>A: &quot;Steve Leary. It&apos;s nice to meet you.&quot;<br>B: &quot;Yeah.&quot;<br>A: &quot;What have you been drinking?&quot;<br>B: &quot;Just Heinekens&quot;<br>A: &quot;Oh man. You have been missing the good stuff. Are you OK with shots?&quot;<br>B: &quot;Hell yeah.&quot;<br>A: &quot;Cool. Follow me. I&apos;ll show you the good stuff.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L60/practice/L60P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L60/practice/L60P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L60/practice/L60P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;You come to a lot of these parties?&quot;<br>B: &quot;As many as I can find.&quot;<br>A: &quot;Ha ha ha.&quot;<br>B: &quot;Any fine ladies around here?&quot;<br>A: &quot;I just checked out a group of chicks heading towards the kitchen.&quot;<br>B: &quot;Were they with any guys?&quot;<br>A: &quot;No, they were alone.&quot;<br>B: &quot;What are you doing just standing here then? Let&apos;s go see if they want any company.&quot;<br>A: &quot;Sounds like a good plan. Let&apos;s go.&quot;<br><br></td></tr><tr><td>3 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L60/practice/L60P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L60/practice/L60P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L60/practice/L60P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Do you go to school here?&quot;<br>B: &quot;No. I go to a different university.&quot;<br>A: &quot;So do you know Johnny?&quot;<br>B: &quot;I came here with a friend who knows Johnny. I met him a couple of times. He&apos;s a cool guy. So you go to this school?&quot;<br>A: &quot;Yeah.&quot;<br>B: &quot;What year are you?&quot;<br>A: &quot;I&apos;m a junior? How about you?&quot;<br>B: &quot;Me too. But I bet I&apos;ll be in school for 4 more years. I still haven&apos;t decided on my major.&quot;<br>A: &quot;I&apos;m in a similar boat. I&apos;m in the English department, but I want to change majors. If I do that, then I&apos;ll have to go to school for another year.&quot;<br>B: &quot;That&apos;s life I guess.&quot;<br>A: &quot;I&apos;m going to get another drink. It was nice meeting you.&quot;<br>B: &quot;Yeah. Nice meeting you too.&quot;<br></td></tr></table>"
}