{
    "lessonIndex": 173,
    "categoryIndex": 1,
    "sectionIndex": 3,
    "title": "Smoking - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=614",
    "html": "<h1>Smoking - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L64/practice/L64P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L64/practice/L64P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L64/practice/L64P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Bobby. What&apos;s going on?&quot;<br>B: &quot;Just taking a smoke break.&quot;<br>A: &quot;I forgot my cigarette today. Do you have another one?&quot;<br>B: &quot;Sure. Here you go.&quot;<br>A: &quot;Thanks.&quot;<br>B: &quot;I didn&apos;t know you smoked.&quot;<br>A: &quot;Really? I&apos;ve been smoking for over a year now.&quot;<br>B: &quot;Oh. You&apos;re new to smoking still. I&apos;ve been smoking for 7 years.&quot;<br>A: &quot;You ever tired to quit?&quot;<br>B: &quot;Many times. I&apos;m really addicted. It&apos;s harder to stop than you think.&quot;<br>A: &quot;Yeah. I tried to quit last month, and I thought it was going to be easy, but it turns out that I&apos;m still smoking.&quot;<br>B: &quot;I highly recommend you quit soon. The longer you smoke, the harder it becomes to quit.&quot;<br>A: &quot;I think you&apos;re right. Aright. Gotta go to class. Thanks for the cigarette. I&apos;ll talk to you later.&quot;<br>B: &quot;No problem. I&apos;ll talk to you later.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L64/practice/L64P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L64/practice/L64P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L64/practice/L64P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Jane. How are you doing?&quot;<br>B: &quot;Hi Jack. I&apos;m doing great.&quot;<br>A: &quot;I hope you haven&apos;t been waiting too long.&quot;<br>B: &quot;No. I just got here a few minutes ago.&quot;<br>A: &quot;Do you know if smoking is allowed here?&quot;<br>B: &quot;I think this is a no-smoking place. Do you want to go somewhere else?&quot;<br>A: &quot;That&apos;s alright. I don&apos;t need to smoke.&quot;<br>B: &quot;Why don&apos;t you quit?&quot;<br>A: &quot;I never thought about it. All my friends smoke, and we hang out a lot.&quot;<br>B: &quot;So do you smoke by yourself?&quot;<br>A: &quot;When I started I didn&apos;t, but after a few months I started smoking at home. Usually when I&apos;m bored.&quot;<br>B: &quot;Do you smoke cause your&apos;re bored?&quot;<br>A: &quot;Yeah. It helps to kill the time. I also think it&apos;s out of habit. I&apos;m so used to having a cigarette every now and then.&quot;<br>B: &quot;How much do you smoke in a day?&quot;<br>A: &quot;I smoke about a half pack a day.&quot;<br>B: &quot;Well, I think you should quit. You know it&apos;s bad for you?&quot;<br>A: &quot;I always knew it was bad, but I never thought about it.&quot;<br>B: &quot;You better start thinking about it now. You might not feel the difference now, but after 10 years of smoking, you might feel it and then it will be too late.&quot;<br>A: &quot;That&apos;s a good point. I&apos;ll try to quit.&quot;<br>B: &quot;Good. And if you need any support, I&apos;ll always be here for you.&quot;<br>A: &quot;Thanks.&quot;<br></td></tr></table>"
}