{
    "lessonIndex": 178,
    "categoryIndex": 1,
    "sectionIndex": 3,
    "title": "Drinking - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=619",
    "html": "<h1>Drinking - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L68/practice/L68P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L68/practice/L68P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L68/practice/L68P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Do you drink much?&quot;<br>B: &quot;Depending on what you consider a lot.&quot;<br>A: &quot;How frequently do you drink?&quot;<br>B: &quot;Couple times a week. How about you?&quot;<br>A: &quot;Only when I go out. I&apos;m not a big drinker.&quot;<br>B: &quot;How much can you drink?&quot;<br>A: &quot;I usually only have 2 beers.&quot;<br>B: &quot;You&apos;re a light weight.&quot;<br>A: &quot;How much can you drink?&quot;<br>B: &quot;I&apos;m usually drinking all night long. At least 10 drinks.&quot;<br>A: &quot;Don&apos;t you spend a lot of money then?&quot;<br>B: &quot;No. We usually go to places that have specials. Dante&apos;s over on the Ave has $5.00 pitchers on Mondays. So for ten, fifteen bucks, I can get a lot of drinks.&quot;<br>A: &quot;That&apos;s true.&quot;<br>B: &quot;If you don&apos;t like beer, have you tried mixed drinks? Some of them are pretty good.&quot;<br>A: &quot;I like beer, it&apos;s just that I get a headache when I drink more than 3.&quot;<br>B: &quot;You just have to build up a tolerance. I used to be like that. But your body gets used to it.&quot;<br>A: &quot;It&apos;ll take awhile, but I&apos;m working on it.&quot;<br>B: &quot;Hey let&apos;s go out tomorrow night. The Ram Bar and Grill is having a special on pitchers.&quot;<br>A: &quot;Aright.&quot;<br></td></tr></table>"
}