{
    "lessonIndex": 183,
    "categoryIndex": 1,
    "sectionIndex": 4,
    "title": "Health - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=625",
    "html": "<h1>Health - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L71/practice/L71P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L71/practice/L71P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L71/practice/L71P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hi Mike. What have you been up to?&quot;<br>B: &quot;Not much. I started exercising.&quot;<br>A: &quot;Trying to get in shape?&quot;<br>B: &quot;Yeah, and I need to start improving my health.&quot;<br>A: &quot;Me too. What are you doing besides exercising?&quot;<br>B: &quot;That&apos;s about all.&quot;<br>A: &quot;I think if you eat better, it will help tremendously.&quot;<br>B: &quot;Sleep is good too. I heard people who sleep an average of eight hours a day have less health problems.&quot;<br>A: &quot;Looks like there are a lot of things to do to stay healthy.&quot;<br>B: &quot;True. But I think it is worth it. When you get old, you want to be healthy and active.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L71/practice/L71P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L71/practice/L71P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L71/practice/L71P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Did your wife give birth yet?&quot;<br>B: &quot;Yeah. She&apos;s a healthy beautiful girl.&quot;<br>A: &quot;Congratulations. How is your wife doing?&quot;<br>B: &quot;She is tired, but getting a lot of rest now.&quot;<br>A: &quot;That&apos;s good to hear.&quot;<br>B: &quot;I&apos;m just glad there were no complications.&quot;<br>A: &quot;If your wife and baby are both happy, what more can you ask for?&quot;<br>B: &quot;It&apos;s been a week, and I haven&apos;t slept that well.&quot;<br>A: &quot;That&apos;s normal for anyone with a newborn.&quot;<br>B: &quot;Yeah, but it&apos;s so hard. I have to work, and then go home and take care of my wife and the baby. I&apos;m going to get sick at this rate.&quot;<br>A: &quot;You&apos;ll get used to it. After everything stabilizes, you can regain your health.&quot;<br>B: &quot;That&apos;s true. I should make sure my wife and baby stay healthy during this time.&quot;<br><br></td></tr><tr><td>3 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L71/practice/L71P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L71/practice/L71P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L71/practice/L71P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;I haven&apos;t seen your father in like 5 years. How is he doing?&quot;<br>B: &quot;He&apos;s not doing too well.&quot;<br>A: &quot;Why? What&apos;s wrong?&quot;<br>B: &quot;About a year ago, he started feeling weak all the time.&quot;<br>A: &quot;Is it due to old age or is he sick.&quot;<br>B: &quot;Maybe a little of both. The doctor&apos;s can&apos;t point out anything specifically. I think it is because he didn&apos;t take care of himself during his youth.&quot;<br>A: &quot;That makes sense. It&apos;s important to take care of your health early in life.&quot;<br>B: &quot;That&apos;s what my father tells me almost everyday.&quot;<br>A: &quot;Well, I hope he starts feeling better. Say hi to him for me.&quot;<br>B: &quot;Thanks. I&apos;ll let him know.&quot;<br></td></tr></table>"
}