{
    "lessonIndex": 191,
    "categoryIndex": 1,
    "sectionIndex": 4,
    "title": "Dieting - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=634",
    "html": "<h1>Dieting - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L77/practice/L77P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L77/practice/L77P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L77/practice/L77P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hi Barbara. Have you lost weight?&quot;<br>B: &quot;Hi Julie. Yeah. I&apos;ve been on a diet for a couple of months now.&quot;<br>A: &quot;Wow. You look great.&quot;<br>B: &quot;Thanks for noticing.&quot;<br>A: &quot;What type of diet were you on?&quot;<br>B: &quot;I joined a health club and my trainer gave me tips on eating. With a combination of eating better and exercising, I managed to lose 15 pounds in 2 months.&quot;<br>A: &quot;That&apos;s amazing. What tips did your trainer give you?&quot;<br>B: &quot;Mostly on how to exercise, but the best advice I got was changing my eating habits. Instead of eating 3 times a day, she told me to eat 5 times a day.&quot;<br>A: &quot;That doesn&apos;t make sense. If you eat more, than how do you lose weight?&quot;<br>B: &quot;Actually, I&apos;m eating the same amount. I eat 5 smaller meals a day. Basically, it naturally speeds up the metabolism and helps to burn fat at a faster rate.&quot;<br>A: &quot;That makes sense. I&apos;m going to try that.&quot;<br>B: &quot;You don&apos;t need to lose weight.&quot;<br>A: &quot;I have a little gut I have been trying to get rid of.&quot;<br>B: &quot;Ah... but remember to incorporate a little exercise into your diet.&quot;<br>A: &quot;Thanks for the advice.&quot;<br>B: &quot;No problem.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L77/practice/L77P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L77/practice/L77P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L77/practice/L77P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Can you believe her? She is not even a hundred pounds and she is going off on how she wants to go on a diet.&quot;<br>B: &quot;Tell me about it. If I was as small as her, I wouldn&apos;t think about going on a diet.&quot;<br>A: &quot;Me too. But what are we going to do? I have been on 4 different diets and I can&apos;t seem to lose weight.&quot;<br>B: &quot;That&apos;s because you don&apos;t exercise. If you were more active, you wouldn&apos;t have a dieting problem.&quot;<br>A: &quot;What do you know? You are over weight too.&quot;<br>B: &quot;I&apos;m not on a diet though.&quot;<br>A: &quot;I know. But I don&apos;t have someone to diet with. If we help each other and motivate each other, then I think we can lose some weight.&quot;<br>B: &quot;I like ice cream too much though.&quot;<br>A: &quot;C&apos;mon. You&apos;ll feel better and look better and as a reward you can eat a little bit of ice cream here and there.&quot;<br>B: &quot;It does sound appealing.&quot;<br>A: &quot;It&apos;s a great idea. I can&apos;t believe I didn&apos;t think of this earlier. Going on a diet with a friend to back you up is a great way to succeed.&quot;<br>B: &quot;Okay. I&apos;m in. Let&apos;s do it.&quot;<br>A: &quot;Great. I&apos;ll get our plan started right away.&quot;<br>B: &quot;Can we start tomorrow though?&quot;<br></td></tr></table>"
}