{
    "categoryIndex": 1,
    "sectionIndex": 4,
    "title": "Dating",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=635",
    "lessonIndex": 192,
    "html": "\r\n<h1>\r\nDating\r\n</h1>\r\nThere are several aspects of dating that are important so we will dedicate a couple of lessons on dating. &#xA0;There are two sections of dating. &#xA0;It comprises of the time period of trying to get a date, and then the time during the date. &#xA0;It is also important to point out the differences from the male and female perspectives. &#xA0;In this first lesson on dating, we will cover getting a date from both gender perspectives.<br><br>In the United States, both genders can ask each other for a date. &#xA0;Just like in any culture, it isn&apos;t normal to ask a complete stranger for a date. &#xA0;Usually, you have to start a conversation and get to know each other a little bit before asking for a date. &#xA0;In the beginning, it&apos;s normal to engage in small talk. &#xA0;During small talk, you should then find something that you have in common. &#xA0;The longer you talk, the greater the chance that you will get a date. &#xA0;It is all up to how you feel if you want to ask or not. &#xA0;In this lesson, I will cover some sentences you should know so you can succeed in getting a date.<br><br>Before we continue though, I would like to mention that blind dates are not common. &#xA0;For example, in Korea, So-geh-ting is a very popular way to get dates. &#xA0;This is in essence a blind date. &#xA0;It is not so common in the United States, so no need to cover it here.<br><br>During the conversation, throwing out compliments is a good thing to do. &#xA0;Most people will be flattered by them. &#xA0;But remember not to make them too cheesy.<br><br><b>Compliments to a guy</b><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L78/sentence/L78S1.mp3\">Do you work out at all? &#xA0;You have a nice build.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L78/sentence/L78S2.mp3\">What kind of cologne is that? &#xA0;I like the smell of it.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L78/sentence/L78S3.mp3\">I like the sound of your voice. &#xA0;It&apos;s soothing listening to it.</a>&quot;<br><br><b>Compliments to a girl</b><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L78/sentence/L78S4.mp3\">Your eyes stand out a lot. &#xA0;Do you get many compliments on them?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L78/sentence/L78S5.mp3\">Does it take you long to style your hair? &#xA0;It looks very good.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L78/sentence/L78S6.mp3\">I bet you get hit on a lot.</a>&quot;<br><br>The term &apos;hit on&apos; means to be approached by the opposite sex. &#xA0;So somebody who gets hit on a lot means to have many people approaching them.<br><br><b>Compliments to either gender</b><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L78/sentence/L78S7.mp3\">It&apos;s very comfortable talking to you.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L78/sentence/L78S8.mp3\">I feel like I can be myself when I&apos;m talking to you.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L78/sentence/L78S9.mp3\">You seem so intelligent. &#xA0;I like that.</a>&quot;<br><br>As you can see, these types of compliments are not too aggressive. &#xA0;They are implying good things, but are not a burden to hear. &#xA0;For example, imagine you are talking to a stranger. &#xA0;If they say, &quot;<a href=\"http://www.talkenglish.com/AudioTE1/L78/sentence/L78S10.mp3\">You&apos;re so beautiful.</a>&quot; &#xA0;It will more likely scare you away. &#xA0;You will probably think that person is a little crazy. &#xA0;But if someone is talking to you and says a small compliment, then it is very welcomed. &#xA0;So keep that in mind when throwing out compliments.\r\n"
}