{
    "categoryIndex": 1,
    "sectionIndex": 5,
    "title": "Engagement - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=651",
    "lessonIndex": 203,
    "html": "<h1>Engagement - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L91/practice/L91P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L91/practice/L91P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L91/practice/L91P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Jack. What&apos;s going on?&quot;<br>B: &quot;Hey Matt. I&apos;m going to ask Martha to marry me?&quot;<br>A: &quot;Really? When did you decide this?&quot;<br>B: &quot;I always knew she was the one, but I decided to pop the big question about 2 weeks ago. I&apos;m just debating on how to do it.&quot;<br>A: &quot;That&apos;s exciting man.&quot;<br>B: &quot;So how did you propose?&quot;<br>A: &quot;You shouldn&apos;t use my example. It wasn&apos;t special. I kind of wish I made it more special but it&apos;s too late now.&quot;<br>B: &quot;What do you think I should do?&quot;<br>A: &quot;There are a lot of options. You can surprise her over dinner, or ask her in a public area, or if you have the balls, ask her father in front of her.&quot;<br>B: &quot;I never thought about that.&quot;<br>A: &quot;Thought about what?&quot;<br>B: &quot;Asking her father in front of her. How do you think she will react?&quot;<br>A: &quot;I don&apos;t know. You should know how she&apos;s going to react. She is your girlfriend.&quot;<br>B: &quot;I think that&apos;s the idea I was looking for. Thanks man.&quot;<br>A: &quot;Don&apos;t mention it. Good luck. You&apos;re going to need it.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L91/practice/L91P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L91/practice/L91P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L91/practice/L91P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Sarah. How are you doing?&quot;<br>B: &quot;I&apos;m doing great. How about you Jessica?&quot;<br>A: &quot;Nothing new. You look happy though. Something special happen recently?&quot;<br>B: &quot;Yeah. I got engaged last week.&quot;<br>A: &quot;Really? No way. I&apos;m so happy for you. Congratulations.&quot;<br>B: &quot;Thanks.&quot;<br>A: &quot;So tell me all about it? How did he propose to you?&quot;<br>B: &quot;He took me to a very nice restaurant and when I opened the menu, there was a big message in the menu saying will you marry me. And then, he got on his knees and showed me a beautiful ring.&quot;<br>A: &quot;That&apos;s so nice. Were there a lot of people watching?&quot;<br>B: &quot;Yeah. The whole restaurant was full. But I didn&apos;t care. Everyone applauded when we were hugging after I said yes.&quot;<br>A: &quot;When is the big date?&quot;<br>B: &quot;We set the date for June 15th.&quot;<br>A: &quot;That&apos;s in eight months. You are going to be so busy preparing for the wedding.&quot;<br>B: &quot;I know. But I wanted to ask you if you would be one of my bride&apos;s maid.&quot;<br>A: &quot;Really? I&apos;d love to.&quot;<br></td></tr></table>"
}