{
    "lessonIndex": 212,
    "categoryIndex": 1,
    "sectionIndex": 5,
    "title": "Honeymoon - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=660",
    "html": "<h1>Honeymoon - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L99/practice/L99P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L99/practice/L99P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L99/practice/L99P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey honey, where do you think we should go for our honeymoon?&quot;<br>B: &quot;I always wanted to go to Mexico. Cancun is supposed to be a great place.&quot;<br>A: &quot;That sounds pretty good. But how about the Caribbean?&quot;<br>B: &quot;That doesn&apos;t sound too bad either. Do you know how much it would cost for airfare and hotel?&quot;<br>A: &quot;If we go for 5 nights, then the total for airfare and hotel would be about one thousand seven hundred dollars. How much would it be to go to Cancun?&quot;<br>B: &quot;I found a deal for only twelve hundred dollars.&quot;<br>A: &quot;That&apos;s a lot cheaper. Let&apos;s go to Cancun then.&quot;<br>B: &quot;Really? That sounds great. I picked up a lot of brochures. Let&apos;s take a look at all the things we can do.&quot;<br>A: &quot;That reminds me. I better make sure my passport is not expired.&quot;<br>B: &quot;You better make sure. If it&apos;s expired, you have to hurry and renew it.&quot;<br>A: &quot;We still have a couple of months. No rush.&quot;<br>B: &quot;What do you want to do in Cancun?&quot;<br>A: &quot;I want to golf at least one day. And I also want to try surfing. Do they have instructors on the beach?&quot;<br>B: &quot;Yeah. This brochure shows lesson and equipment rentals and everything. That shouldn&apos;t be a problem. I want to try snorkeling.&quot;<br>A: &quot;Do we need to buy snorkeling gear?&quot;<br>B: &quot;No. We can just rent it there.&quot;<br>A: &quot;Sounds like we&apos;re going to have fun.&quot;<br>B: &quot;I know. I can&apos;t wait. It&apos;s going to be so fun.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L99/practice/L99P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L99/practice/L99P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L99/practice/L99P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Where are you guys going for your honeymoon?&quot;<br>B: &quot;We decided on Cancun, Mexico.&quot;<br>A: &quot;I&apos;ve been there before. It&apos;s a great place.&quot;<br>B: &quot;What did you do there?&quot;<br>A: &quot;There is so much to do. It&apos;s a big tourist place so there is access to everything.&quot;<br>B: &quot;That&apos;s good. I&apos;m looking forward to our honeymoon. Especially after all the wedding plans I had to do.&quot;<br>A: &quot;How long are you going for?&quot;<br>B: &quot;We decided on 6 days. We are leaving on Sunday and returning on Saturday.&quot;<br>A: &quot;That should give you plenty of time. Do you have all your travel plans in order?&quot;<br>B: &quot;We just booked our flight and got our room. Everything is set.&quot;<br>A: &quot;You&apos;re going to have so much fun. I&apos;m so jealous.&quot;<br>B: &quot;When you get married, you&apos;ll have your chance.&quot;<br>A: &quot;I need to find a guy first.&quot;<br>B: &quot;Where do you want to go for your honeymoon?&quot;<br>A: &quot;Since I&apos;ve been to Mexico and Hawaii before, I want to go to Australia.&quot;<br>B: &quot;That sounds great. It&apos;s a little out of our budget so we didn&apos;t even consider Australia.&quot;<br>A: &quot;For the price, Cancun is one of the best so don&apos;t have any regrets. It is a great place. So do you have a ride to the airport?&quot;<br>B: &quot;My brother is going to drop us off.&quot;<br>A: &quot;Looks like everything is set. Just make sure to take a camera. I know many people who forgot to take a camera on their honeymoon.&quot;<br>B: &quot;Will do. Thanks.&quot;<br></td></tr></table>"
}