{
    "categoryIndex": 1,
    "sectionIndex": 5,
    "title": "Married Life - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=665",
    "lessonIndex": 217,
    "html": "<h1>Married Life - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L103/practice/L103P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L103/practice/L103P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L103/practice/L103P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Jane. How are you doing these days?&quot;<br>B: &quot;Hi Martha. Everything is perfect.&quot;<br>A: &quot;Are you enjoying married life?&quot;<br>B: &quot;It couldn&apos;t be better. My husband is so supportive with my work and he helps around the house so much.&quot;<br>A: &quot;You&apos;re so lucky. I hope to get married to a guy like that.&quot;<br>B: &quot;I&apos;m so happy. Even though we are both working, we get to spend a lot of time with each other in the evening and on the weekends.&quot;<br>A: &quot;Do you guys do anything special?&quot;<br>B: &quot;In the evening, we just sit and talk over dinner. But on the weekend, we try to go out to the beach or hit a nice restaurant, or go to a nice cafe.&quot;<br>A: &quot;Sound like everything is great.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L103/practice/L103P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L103/practice/L103P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L103/practice/L103P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Stacy. What&apos;s going on?&quot;<br>B: &quot;I&apos;m pretty tired these days.&quot;<br>A: &quot;Why? You&apos;re not working so don&apos;t you have a lot of time on your hands?&quot;<br>B: &quot;I have so much house work to do. I have to take care of the kids, cook, clean, laundry, and the cycle never ends.&quot;<br>A: &quot;How about your husband. Does he help much?&quot;<br>B: &quot;Not at all. He comes home and complains about his hard day at work. He expects me to do everything. He even wants me to feed him sometimes. Can you believe that?&quot;<br>A: &quot;That sucks.&quot;<br>B: &quot;If he wasn&apos;t so lazy, I think I wouldn&apos;t have any complaints. He mows the lawn, but can you believe he tried to convince me to do it?&quot;<br>A: &quot;That&apos;s crossing the line.&quot;<br>B: &quot;Oh well. I&apos;ll have to live with it. What else can I do?&quot;<br></td></tr></table>"
}