{
    "categoryIndex": 1,
    "sectionIndex": 5,
    "title": "Health - Dating - Marriage - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=667",
    "lessonIndex": 219,
    "html": "<h1>Health Review - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L104/practice/L104P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L104/practice/L104P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L104/practice/L104P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Samantha. You&apos;ve been so busy lately. What have you been up to?&quot;<br>B: &quot;Hey Jackie. I started dating this cute guy and decided to start exercising.&quot;<br>A: &quot;You&apos;re not out of shape. You look fine.&quot;<br>B: &quot;Well, this guy I am seeing is a personal trainer and he has a perfect body. Compared to him, I need some work.&quot;<br>A: &quot;How long have you seen him?&quot;<br>B: &quot;We&apos;ve been together for about a month and a half.&quot;<br>A: &quot;Did you sleep with him yet?&quot;<br>B: &quot;Not yet. But before I get into bed with him, I want to look fit.&quot;<br>A: &quot;That&apos;s not the greatest reason to exercise, but I guess it is a valid one.&quot;<br>B: &quot;How about you? Anything new in your life?&quot;<br>A: &quot;My father is a little ill. He has been to the doctor&apos;s quite a bit lately but they don&apos;t know what is wrong with him. He complains about stomach pains a lot these days.&quot;<br>B: &quot;I&apos;m sorry to hear that. Any idea what could have caused it?&quot;<br>A: &quot;He says it is because he didn&apos;t take care of himself when he was young. That&apos;s why I want to start thinking about my health.&quot;<br>B: &quot;I think it is important to take care of yourself while you are young too. Even though my reasons are not the best, at least I am working on it.&quot;<br>A: &quot;How are your parents doing?&quot;<br>B: &quot;They&apos;re doing great. I&apos;m thankful that they are healthy.&quot;<br>A: &quot;That&apos;s good to hear. Well, I gotta get running now. I&apos;ll catch you later.&quot;<br>B: &quot;Ok. Send my regards to your father.&quot;<br>A: &quot;I will. Thanks.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L104/practice/L104P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L104/practice/L104P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L104/practice/L104P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Wow Billy. Looks like you lost a lot of weight. I could hardly recognize you.&quot;<br>B: &quot;Thanks. I&apos;ve been on a diet for about 6 months. I&apos;m going to ask Rachel to marry me soon and I want to be mentally and physically healthy.&quot;<br>A: &quot;What does being overweight have anything to do with marriage? If you love each other, that&apos;s enough right?&quot;<br>B: &quot;Yeah, but I want to show her how much she means to me, and this is one way of proving it. &#xA0;I&apos;m changing for the better.&quot;<br>A: &quot;Good for you. Hey, when do you plan on proposing to her?&quot;<br>B: &quot;I think I am going to propose to her on our 2 year anniversary.&quot;<br>A: &quot;Is she expecting it, or will it be a surprise?&quot;<br>B: &quot;I think she expects me to ask her one of these days, but not anytime soon.&quot;<br>A: &quot;You sure you want to settle down already? You&apos;re only 25 years old?&quot;<br>B: &quot;Yeah, I didn&apos;t think I would get married until I was 30, but when you know she is the one, why wait.&quot;<br>A: &quot;That&apos;s true. Hey, I hope everything works out. You&apos;re going to invite me to your wedding right?&quot;<br>B: &quot;Of course man.&quot;<br>A: &quot;Gosh, I&apos;m still shocked how much weight you lost. You&apos;re getting real skinny now.&quot;<br>B: &quot;I am working on a six pack now. I have two lines starting to show up. I&apos;ve been spending a lot of time at the gym. It is hard work, but I feel so good after working out.&quot;<br>A: &quot;Where do you work out?&quot;<br>B: &quot;I have a membership at Bally&apos;s. It&apos;s not too expensive and I like all the equipment they have.&quot;<br>A: &quot;I&apos;ve been thinking about joining a gym. Are they having any specials right now?&quot;<br>B: &quot;Yeah, they do. They have free enrollment and first month free. You should come by. I&apos;ll show you around. I can take in a guest so you can try it out before signing up.&quot;<br>A: &quot;That sounds good. Let&apos;s go this Saturday.&quot;<br>B: &quot;Cool. I&apos;ll call you in the morning.&quot;<br><br></td></tr><tr><td>3 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L104/practice/L104P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L104/practice/L104P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L104/practice/L104P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey John. Who was that girl I saw you with last Friday night?&quot;<br>B: &quot;Oh. That was Jessica. She&apos;s a girl I met the other week.&quot;<br>A: &quot;I thought you were seeing Patty?&quot;<br>B: &quot;No. We broke up a couple weeks ago.&quot;<br>A: &quot;Are you getting pretty serious with this new girl?&quot;<br>B: &quot;She&apos;s not long term. Just someone to chill with.&quot;<br>A: &quot;Ah... so you are boning her.&quot;<br>B: &quot;Damn right. But we don&apos;t have much in common. Oh well. At least we are compatible in bed.&quot;<br>A: &quot;She had a nice figure. You sure it&apos;s not going to work out?&quot;<br>B: &quot;It works out well in bed, but if you try to have a conversation with her, it just dies out fast.&quot;<br>A: &quot;At least she is good for one thing. Ha ha ha.&quot;<br>B: &quot;How about you. You&apos;ve been seeing Heidi for a long time now. When are you going to tie the knot?&quot;<br>A: &quot;I don&apos;t know. She&apos;s been bugging me about marriage, but I don&apos;t see the need to rush it.&quot;<br>B: &quot;You guys have been seeing each other for like 3 years haven&apos;t you?&quot;<br>A: &quot;Actually, it&apos;s been more than 4 years already.&quot;<br>B: &quot;Wow. That&apos;s a long time. Any problems with having a girlfriend for that long?&quot;<br>A: &quot;Not really. It gets a little boring at times, but we grew to be great friends. I can totally be myself around her.&quot;<br>B: &quot;I think that is the best type of relationships. Good for you.&quot;<br>A: &quot;But sometimes I wonder if I am missing out. You know... like banging all these chicks, like you.&quot;<br>B: &quot;Trust me. I would trade in all of it for a stable relationship. It&apos;s a lot more headaches. The breakups, the girl crying all the time, the broken promises, and on and on. I am so sick of it.&quot;<br>A: &quot;Well, if you put it that way.&quot;<br>B: &quot;I would love to be in your situation. You have a beautiful girl that you are in love with, and you are perfect for each other. What else do you want?&quot;<br>A: &quot;Maybe a little more excitement.&quot;<br>B: &quot;So would you give up your girlfriend for what I have? A little excitement here and there? You can&apos;t have both you know. Unless you&apos;re a cheating dog.&quot;<br>A: &quot;I don&apos;t think I can go behind her back. We have a trusting relationship I don&apos;t want to risk.&quot;<br>B: &quot;Now you&apos;re making some sense.&quot;<br>A: &quot;It&apos;s always good talking to you man. You make me feel better.&quot;<br>B: &quot;Likewise. That&apos;s what friends are for right?&quot;<br>A: &quot;So you coming out to play basketball this Saturday?&quot;<br>B: &quot;Yeah. I&apos;ll be there.&quot;<br>A: &quot;Aright. I&apos;ll catch you then.&quot;<br>B: &quot;Aright man. Later.&quot;<br><br></td></tr><tr><td>4 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L104/practice/L104P4.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L104/practice/L104P4b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L104/practice/L104P4a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Stephanie. Guess what?&quot;<br>B: &quot;What?&quot;<br>A: &quot;Robert asked me to marry him. We&apos;re getting married.&quot;<br>B: &quot;Congratulations. I&apos;m so happy for you. So when is the big day?&quot;<br>A: &quot;We haven&apos;t set the date exactly, but it looks like it will be sometime in July.&quot;<br>B: &quot;How did he propose to you?&quot;<br>A: &quot;On valentines day, he got me a present. I thought it was an ordinary valentines day present, but when I opened it, it was this big diamond ring. Right then, he got on his knees and proposed.&quot;<br>B: &quot;That&apos;s so neat. So you really got surprised?&quot;<br>A: &quot;We talked about marriage a little, but I never knew he was serious.&quot;<br>B: &quot;You are going to be busy with wedding plans. But you have several months to prepare for it.&quot;<br>A: &quot;It&apos;s going to be pretty hectic for me. So I&apos;m going to need some help. First of all, I was wondering if you would like to be my Maid of Honor.&quot;<br>B: &quot;I would be honored.&quot;<br>A: &quot;So you&apos;re going to help me with the planning right?&quot;<br>B: &quot;Of course. How many brides maids are you going to have?&quot;<br>A: &quot;Three. So we will have a total of four.&quot;<br>B: &quot;Let me guess. Susan, Tina, and Cindy.&quot;<br>A: &quot;Close. I&apos;m going to have Cindy as the candle lighter. The third brides maid is going to be Lydia. She is a good friend from church.&quot;<br>B: &quot;I know her. She&apos;s sweet. I&apos;ll make sure we have the best wedding for you.&quot;<br>A: &quot;I hope so. I appreciate your help.&quot;<br></td></tr></table>"
}