{
    "lessonIndex": 222,
    "categoryIndex": 1,
    "sectionIndex": 6,
    "title": "Talking About Girls - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=671",
    "html": "<h1>Talking About Girls - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L107/practice/L107P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L107/practice/L107P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L107/practice/L107P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Yo Matt. How goes it man?&quot;<br>B: &quot;Pretty good. What have you been up to?&quot;<br>A: &quot;You know that chick in psychology class?&quot;<br>B: &quot;Yeah. You only talk about her every other day.&quot;<br>A: &quot;I can&apos;t get her out of my mind. She is damn fine.&quot;<br>B: &quot;Why don&apos;t you go talk to her then?&quot;<br>A: &quot;I think she is out of my league.&quot;<br>B: &quot;Chicken. Somebody is only out of your league if you think so. What do you see in her anyway? She is a little chubby dude.&quot;<br>A: &quot;She is not. She has a nice figure. And she has such a pretty face.&quot;<br>B: &quot;Whatever. If you think so.&quot;<br>A: &quot;You like skinny girls or something?&quot;<br>B: &quot;I like normal girls without any flab hanging out.&quot;<br>A: &quot;Now you&apos;re exaggerating you freak.&quot;<br>B: &quot;Seriously, I like a girl who is fit and likes to exercise.&quot;<br>A: &quot;How about personality?&quot;<br>B: &quot;It doesn&apos;t matter until you are thinking about marriage and I&apos;m not thinking about that yet.&quot;<br>A: &quot;Well, I&apos;m looking so I don&apos;t care that much about figure. As long as she is nice and sweet.&quot;<br><br></td></tr><tr><td>2 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L107/practice/L107P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L107/practice/L107P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L107/practice/L107P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Who do you think is hotter? Britney or Christina?&quot;<br>B: &quot;That&apos;s a no brainer. Christina is way hotter. You think Britney is hotter than Christina?&quot;<br>A: &quot;She has some serious curves that turn me on. And I like the way she moves. I think she&apos;s sexy.&quot;<br>B: &quot;Ok. How about between the three girls on Friends? Who do you think is the cutest?&quot;<br>A: &quot;I like Phoebe the most. She is so funny it cracks me up.&quot;<br>B: &quot;Ok. I agree with you there. Let&apos;s change the scenario a little. If you were stuck on an island, who would you choose to be with?&quot;<br>A: &quot;I&apos;d take Britney Spears. I have this thing about her.&quot;<br>B: &quot;No way man. How about Catherine Zeta Jones? She is absolutely beautiful.&quot;<br></td></tr></table>"
}