{
    "categoryIndex": 1,
    "sectionIndex": 6,
    "title": "Basketball - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=690",
    "lessonIndex": 240,
    "html": "<h1>Basketball - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L124/practice/L124P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L124/practice/L124P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L124/practice/L124P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Do you know when basketball season starts?&quot;<br>B: &quot;It starts in October. How come?&quot;<br>A: &quot;I like to keep up with the Lakers.&quot;<br>B: &quot;You keep up with baseball at all?&quot;<br>A: &quot;Just a little. Not as much as basketball.&quot;<br>B: &quot;Who is your favorite player?&quot;<br>A: &quot;Probably Kobe Bryant, but he has too many issues right now.&quot;<br>B: &quot;He&apos;s a great player, but his recent problem is really affecting his play.&quot;<br>A: &quot;Hope everything turns out ok. Do you play/like basketball much?&quot;<br>B: &quot;I usually get into it during the playoffs. I&apos;d rather play than watch.&quot;<br>A: &quot;I like to watch as much as I like to play. Do you play often?&quot;<br>B: &quot;Every now and then with some friends.&quot;<br>A: &quot;I usually play twice a week at the health club. It&apos;s easy to round up 10 guys during the evening time.&quot;<br>B: &quot;That sounds pretty fun. But I&apos;m too out of shape to play full court.&quot;<br>A: &quot;I get tired too, but I figure it&apos;s good for my health. And I&apos;m having fun at the same time.&quot;<br>B: &quot;So you think the Lakers will do good this year?&quot;<br>A: &quot;They better. They got a lot of good players now. If Malone can stay healthy, then I don&apos;t see how they can be beat.&quot;<br>B: &quot;I don&apos;t know... I think Sacramento has a strong team this year.&quot;<br>A: &quot;True, but I&apos;m pulling for the Lakers all the way. It&apos;s going to be a great season.&quot;<br><br></td></tr></table>"
}