{
    "categoryIndex": 1,
    "sectionIndex": 7,
    "title": "Talking About Guys - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=707",
    "lessonIndex": 257,
    "html": "<h1>Talking about Guys - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L137/practice/L137P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L137/practice/L137P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L137/practice/L137P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Cindy. I heard you are seeing someone.&quot;<br>B: &quot;Yeah. His name is John. I started dating him a week ago.&quot;<br>A: &quot;That&apos;s so exciting. Tell me all about him. Is he good looking?&quot;<br>B: &quot;I think he&apos;s cute, but not drop dead gorgeous.&quot;<br>A: &quot;How did you meet him?&quot;<br>B: &quot;I go to this coffee shop a lot and this guy is always there. We started talking a couple of times, and he finally asked me out.&quot;<br>A: &quot;That&apos;s so cool. What does he do for a living?&quot;<br>B: &quot;He works in the finance department in a manufacturing company.&quot;<br>A: &quot;Do you know if he makes a lot of money?&quot;<br>B: &quot;I don&apos;t know for sure, but he drives a nice car and I heard he has a house.&quot;<br>A: &quot;How is his personality?&quot;<br>B: &quot;He&apos;s very smart and a great person to talk to. In the beginning, we talked for about 30 minutes a day in the coffee shop before he asked me out. Besides that, he&apos;s very sweet and romantic.&quot;<br>A: &quot;How old is he?&quot;<br>B: &quot;That&apos;s the problem. He is 2 years younger than me. What do you think about that?&quot;<br>A: &quot;What&apos;s the big deal? I don&apos;t see anything wrong with that. If you were 23, then I might be worried he was immature, but you&apos;re almost 30 now. 2 years is no big deal.&quot;<br>B: &quot;Yeah. That&apos;s what I think.&quot;<br>A: &quot;When do I get to meet him?&quot;<br>B: &quot;How about a double date. The four of us can go out to dinner and a drink or something.&quot;<br>A: &quot;That sounds great. How about next Saturday?&quot;<br>B: &quot;I think Saturday will be good. Let&apos;s double check with the guys and get back to each other.&quot;<br>A: &quot;Great. I&apos;ll call you later then.&quot;<br>B: &quot;Ok. Talk to you later.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L137/practice/L137P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L137/practice/L137P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L137/practice/L137P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Jane. Did you see that guy standing by the dance floor?&quot;<br>B: &quot;Yeah. He&apos;s kinda cute.&quot;<br>A: &quot;Wait. Isn&apos;t that Beth&apos;s boyfriend?&quot;<br>B: &quot;I&apos;m not sure. I haven&apos;t met him before.&quot;<br>A: &quot;Look. He&apos;s dancing with another girl.&quot;<br>B: &quot;Are you sure that&apos;s him?&quot;<br>A: &quot;No. It just looks like him.&quot;<br>B: &quot;I heard he was a nice guy. He wouldn&apos;t be cheating on Beth.&quot;<br>A: &quot;Yeah. You&apos;re right. How do you know about him if you never met him?&quot;<br>B: &quot;I hear all this stuff from Beth. She is always going off on how nice and sweet he is.&quot;<br>A: &quot;I heard the same thing. What type of guy are you looking for?&quot;<br>B: &quot;Someone who is understanding, responsible, sensitive, smart, and with a lot of money.&quot;<br>A: &quot;Don&apos;t we all. Get real. All those guys are probably already taken.&quot;<br>B: &quot;It doesn&apos;t hurt to have expectations. What type of guy do you want to find?&quot;<br>A: &quot;All I want is someone who is going to treat me well.&quot;<br>B: &quot;You know Alex don&apos;t you? He likes you. I bet he&apos;ll take good care of you.&quot;<br>A: &quot;He&apos;s a dork. At least someone who is not an idiot ok?&quot;<br>B: &quot;Got it.&quot;<br></td></tr></table>"
}