{
    "lessonIndex": 265,
    "categoryIndex": 1,
    "sectionIndex": 7,
    "title": "Jewelry - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=715",
    "html": "<h1>Jewelry - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L143/practice/L143P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L143/practice/L143P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L143/practice/L143P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;I love your bracelet. When did you get it?&quot;<br>B: &quot;I got it awhile ago, but I haven&apos;t worn it much. You really like it?&quot;<br>A: &quot;Yeah. It&apos;s beautiful. Is it white gold or silver?&quot;<br>B: &quot;It&apos;s white gold.&quot;<br>A: &quot;Where did you buy it?&quot;<br>B: &quot;My boyfriend took me to the Shane Co. and he let me pick it out.&quot;<br>A: &quot;That&apos;s so sweet. What was the occasion?&quot;<br>B: &quot;That&apos;s the best part. It wasn&apos;t for anything special. He just wanted to buy me something.&quot;<br>A: &quot;You&apos;re so lucky. If he bought you something for no special day, I wonder what he would buy you for your birthday.&quot;<br>B: &quot;My birthday is coming up next month. We&apos;ll find out pretty soon.&quot;<br>A: &quot;What do you want?&quot;<br>B: &quot;I wouldn&apos;t mind a necklace. I was at the jewelry shop looking around, and they have a couple of beautiful necklaces I want.&quot;<br>A: &quot;Why not a ring?&quot;<br>B: &quot;I don&apos;t think I&apos;m ready for a ring from him yet.&quot;<br>A: &quot;But you&apos;re ready for everything else?&quot;<br>B: &quot;Damn right.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L143/practice/L143P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L143/practice/L143P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L143/practice/L143P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hi. Can I help you with anything?&quot;<br>B: &quot;Yeah. Can I look at this ring?&quot;<br>A: &quot;Sure. Let me get it out for you. What is your size?&quot;<br>B: &quot;I believe I am a six.&quot;<br>A: &quot;Here you go.&quot;<br>B: &quot;Would you have any necklace that would go well with this?&quot;<br>A: &quot;Actually, we have a few to choose from. They are over here.&quot;<br>B: &quot;There&apos;s no price tag on this necklace.&quot;<br>A: &quot;Oh. I&apos;m sorry. I&apos;ll check the price for you. It is $199.&quot;<br>B: &quot;This necklace is a little short. Do you have one that is longer?&quot;<br>A: &quot;Yes. Why don&apos;t you try this one on.&quot;<br>B: &quot;This one is much better. Can I try on the ring with this necklace?&quot;<br>A: &quot;Sure. Here you go.&quot;<br>B: &quot;Let me think about it.&quot;<br>A: &quot;Sure. Take your time.&quot;<br>B: &quot;Thank you for all the help.&quot;<br>A: &quot;No problem at all.&quot;<br><br></td></tr><tr><td>3 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L143/practice/L143P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L143/practice/L143P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L143/practice/L143P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;What a beautiful watch. It goes very well with your ring.&quot;<br>B: &quot;Thank you.&quot;<br>A: &quot;Is that your wedding ring?&quot;<br>B: &quot;I&apos;m not married yet. It&apos;s my engagement ring.&quot;<br>A: &quot;Well, congratulations. When is the big date?&quot;<br>B: &quot;In June.&quot;<br>A: &quot;Did you have the watch before getting the ring?&quot;<br>B: &quot;Actually, we bought the ring together after I got the watch.&quot;<br>A: &quot;You did a fabulous job with the selection. It&apos;s gorgeous.&quot;<br>B: &quot;Thank you so much.&quot;<br>A: &quot;What kind of watch is it?&quot;<br>B: &quot;It&apos;s a Tag Heuer.&quot;<br>A: &quot;If you don&apos;t mind me asking, how much do they cost?&quot;<br>B: &quot;This one is $1500. But they range from $600 to $3000.&quot;<br>A: &quot;That&apos;s why it looks so nice. I should have figured. You always get what you pay for.&quot;<br>B: &quot;Yeah. I would rather get one nice watch instead of 20 mediocre ones.&quot;<br></td></tr></table>"
}