{
    "categoryIndex": 1,
    "sectionIndex": 7,
    "title": "Guys - Girls - and Sports Review - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=717",
    "lessonIndex": 267,
    "html": "<h1>Guy, Girls, Sports - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L144/practice/L144P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L144/practice/L144P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L144/practice/L144P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Jason. What are you doing this Friday?&quot;<br>B: &quot;I&apos;m going to go to the driving range &#xB5;cause I&apos;m playing golf on Saturday.&quot;<br>A: &quot;You&apos;re golfing without me? What&apos;s up with that?&quot;<br>B: &quot;Sorry man, but we already have a foursome. I&apos;m going with a couple of guys from work.&quot;<br>A: &quot;Where are you playing?&quot;<br>B: &quot;Washington National. Have you been there yet?&quot;<br>A: &quot;I&apos;ve been there a couple of times. It&apos;s a great course. You know the Huskies play there right?&quot;<br>B: &quot;I didn&apos;t know that. Is it a hard course?&quot;<br>A: &quot;It&apos;s pretty challenging. But it all depends on which tee you play from.&quot;<br>B: &quot;What are you shooting these days?&quot;<br>A: &quot;I&apos;m still hovering around a bogey game.&quot;<br>B: &quot;Still better than me. I&apos;m still trying to hit a bogey game. Do you want to hit the driving range with me?&quot;<br>A: &quot;I can&apos;t this Friday. I&apos;m playing basketball with the guys that night.&quot;<br>B: &quot;At night?&quot;<br>A: &quot;Yeah. We&apos;re playing indoors at a school gymnasium.&quot;<br>B: &quot;What&apos;s the occasion?&quot;<br>A: &quot;Just a small league I play on. Nothing special.&quot;<br>B: &quot;I&apos;m too short to play basketball.&quot;<br>A: &quot;You&apos;re not that short. Plus, we have a couple of guys who are the same height as you. They&apos;re awesome players.&quot;<br>B: &quot;I never got into basketball. It&apos;s fun and all, but maybe I&apos;m just not good at it.&quot;<br>A: &quot;It&apos;s still great exercise. I get a better workout from basketball than I do from the treadmill.&quot;<br>B: &quot;That&apos;s true.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L144/practice/L144P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L144/practice/L144P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L144/practice/L144P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;What do you think about Matt&apos;s new girlfriend?&quot;<br>B: &quot;Samantha? She&apos;s pretty hot. I can&apos;t believe she fell for Matt.&quot;<br>A: &quot;I don&apos;t seem to have much luck with girls.&quot;<br>B: &quot;Why do you think that is?&quot;<br>A: &quot;I say the stupidest things around girls. I don&apos;t know why I do that?&quot;<br>B: &quot;It&apos;s because you&apos;re nervous. Best thing to do is not say a word until you know it&apos;s not stupid.&quot;<br>A: &quot;It doesn&apos;t work that way. I stop thinking around pretty girls.&quot;<br>B: &quot;I know. You got to date a girl who isn&apos;t that pretty then.&quot;<br>A: &quot;What&apos;s the story of your love life these days?&quot;<br>B: &quot;It&apos;s only been a couple of months that I broke up with Sarah. But I think it&apos;s about time to start hunting again.&quot;<br>A: &quot;Who&apos;s your type?&quot;<br>B: &quot;Anybody with a nice body and a pretty face.&quot;<br>A: &quot;How about their personality or their character?&quot;<br>B: &quot;I&apos;m not thinking about marriage, so those things don&apos;t matter.&quot;<br>A: &quot;You&apos;re so shallow.&quot;<br><br></td></tr><tr><td>3 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L144/practice/L144P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L144/practice/L144P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L144/practice/L144P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;So Mark. What is your favorite hobby?&quot;<br>B: &quot;Probably sports.&quot;<br>A: &quot;Anything specific? Or just sports in general.&quot;<br>B: &quot;Most sports. I like basketball, football, baseball, golf, tennis, so I guess most sports.&quot;<br>A: &quot;I like tennis. Did you play for your high school team?&quot;<br>B: &quot;Yeah. I played on the varsity team starting from my sophomore year. How about you?&quot;<br>A: &quot;I played my junior and senior year.&quot;<br>B: &quot;What other sports did you play?&quot;<br>A: &quot;I played volleyball. I would have to say volleyball is my favorite.&quot;<br>B: &quot;What position did you play?&quot;<br>A: &quot;I was the outside hitter.&quot;<br>B: &quot;That&apos;s so cool. I didn&apos;t know you were athletic.&quot;<br>A: &quot;I don&apos;t know if I would consider myself athletic, but I have fun playing.&quot;<br>B: &quot;I play on a co-ed volleyball team every Tuesdays. We&apos;re always looking for more girls to play on our team. Would you be interested?&quot;<br>A: &quot;Yeah. It sounds fun. Just call me anytime you need a player.&quot;<br>B: &quot;That&apos;s great. Since we are on the topic of sports, what sport do you like to watch on television?&quot;<br>A: &quot;I never got into watching sports on TV. So I really don&apos;t know.&quot;<br>B: &quot;Not even the Super bowl?&quot;<br>A: &quot;Only when the group of people I&apos;m with is watching it. I just never had interest in TV that much.&quot;<br>B: &quot;Well, I like following the Mariners. They&apos;re pretty good.&quot;<br>A: &quot;I like to go watch them play. It&apos;s fun when you are actually there.&quot;<br>B: &quot;A bunch of us are going to watch them play this June. Do you want to join us?&quot;<br>A: &quot;Yeah. I&apos;ll go. I like the new stadium. It&apos;s pretty cool.&quot;<br>B: &quot;Ok. I&apos;ll make sure to get you a ticket as well.&quot;<br><br></td></tr><tr><td>4 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L144/practice/L144P4.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L144/practice/L144P4b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L144/practice/L144P4a.mp3\">Person B</a></td></tr><tr><td>A: &quot;What did Mike get you for your birthday Pam?&quot;<br>B: &quot;He got me a watch. See.&quot;<br>A: &quot;That&apos;s beautiful. He must have spent a fortune on it.&quot;<br>B: &quot;He&apos;s so great. I think he might propose pretty soon.&quot;<br>A: &quot;How do you know? Did he give you any clues?&quot;<br>B: &quot;He took me to a jewelry store and asked me what type of rings I like. It was a little obvious, but at least I got to pick the one I wanted.&quot;<br>A: &quot;That&apos;s not so romantic?&quot;<br>B: &quot;He was never romantic. Silly and cute, but not romantic. I like all his quirkiness. He always makes me laugh.&quot;<br>A: &quot;I guess you can&apos;t ask for much more than that.&quot;<br>B: &quot;How is it going with you and Brad?&quot;<br>A: &quot;We broke up a week ago.&quot;<br>B: &quot;I&apos;m sorry to hear that. What happened?&quot;<br>A: &quot;I think we both just started to grow apart. I wasn&apos;t surprised.&quot;<br>B: &quot;Are you doing ok?&quot;<br>A: &quot;Actually, I&apos;m feeling great. I guess I needed some freedom.&quot;<br>B: &quot;Have you started seeing other guys yet?&quot;<br>A: &quot;Not yet, but I when I meet a decent guy, I wouldn&apos;t mind dating again.&quot;<br>B: &quot;What kind of guy are you looking for?&quot;<br>A: &quot;Although my relationship with Brad wasn&apos;t that bad, I want a guy who likes to go out more. Brad always spent all his time studying and researching for school. It was quite boring.&quot;<br>B: &quot;You definitely need a guy who likes to have fun.&quot;<br>A: &quot;I wouldn&apos;t mind dating a romantic guy. Maybe I&apos;m dreaming, but a nice walk down the beach, or dancing in the moonlight would be something I would love to do.&quot;<br>B: &quot;Hey. There are guys like that. All you have to do is find the right one.&quot;<br>A: &quot;But that&apos;s the hard part. I always fall for the guy who is smart. And then after a couple of months, I get bored.&quot;<br>B: &quot;Doesn&apos;t a tall, good looking guy turn you on?&quot;<br>A: &quot;Not really. What should I do?&quot;<br>B: &quot;We should go to a club this Saturday and find a smart romantic guy. How does that sound?&quot;<br>A: &quot;That sounds like a plan. Let&apos;s do it.&quot;<br>B: &quot;Great. I&apos;ll see you at nine then.&quot;<br>A: &quot;Ok. See you later.&quot;<br></td></tr></table>"
}