{
    "categoryIndex": 1,
    "sectionIndex": 8,
    "title": "Excited - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=729",
    "lessonIndex": 279,
    "html": "<h1>Excited - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L153/practice/L153P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L153/practice/L153P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L153/practice/L153P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;I can&apos;t wait to go skiing tomorrow.&quot;<br>B: &quot;I know. It&apos;s going to be so much fun.&quot;<br>A: &quot;I always get excited the day before.&quot;<br>B: &quot;I used to be like that. But I go skiing so often that I don&apos;t get excited anymore.&quot;<br>A: &quot;I only go skiing twice a year, so it&apos;s a real treat for me.&quot;<br>B: &quot;That makes sense.&quot;<br>A: &quot;What things make you excited?&quot;<br>B: &quot;Whenever I go to Vegas, I get really excited.&quot;<br>A: &quot;Oh... that makes me excited too!&quot;<br>B: &quot;Looks like anything fun makes you excited.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L153/practice/L153P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L153/practice/L153P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L153/practice/L153P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Jack. Are you excited about starting work?&quot;<br>B: &quot;Yeah. I&apos;m really looking forward to it.&quot;<br>A: &quot;What was more exciting, starting college or starting work?&quot;<br>B: &quot;They&apos;re pretty similar, but in different ways. I really can&apos;t decide. How about you?&quot;<br>A: &quot;For me, I think starting school was more exciting.&quot;<br>B: &quot;Does that mean work isn&apos;t that great?&quot;<br>A: &quot;It&apos;s different for everyone, but because I knew school was going to be so much fun, I really got excited about it.&quot;<br>B: &quot;But work is a huge portion of our lives. I&apos;m looking forward to making it fun.&quot;<br>A: &quot;That&apos;s a great attitude to have. I don&apos;t think you&apos;ll have any problems in the workforce.&quot;<br>B: &quot;I hope you&apos;re right.&quot;<br><br></td></tr><tr><td>3 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L153/practice/L153P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L153/practice/L153P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L153/practice/L153P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Suzie. Guess what? I&apos;m having a baby!&quot;<br>B: &quot;Really? That&apos;s so great. Congratulations.&quot;<br>A: &quot;Thanks. I&apos;m so excited. We&apos;ve been trying for 8 months now.&quot;<br>B: &quot;That&apos;s really exciting. How many months are you pregnant?&quot;<br>A: &quot;Three months.&quot;<br>B: &quot;Are you going to find out if it is a boy or a girl?&quot;<br>A: &quot;I want to, but Bob doesn&apos;t. He wants to be surprised like the old fashioned way.&quot;<br>B: &quot;Maybe it&apos;s more exciting not knowing.&quot;<br>A: &quot;I&apos;d rather know and buy all the baby things ahead of time.&quot;<br>B: &quot;There are so many things you have to prepare for.&quot;<br>A: &quot;I know I am going to be busy, but I know I can handle it. I have been looking forward to this day for a long long time.&quot;<br>B: &quot;It really must be an exciting time for you guys.&quot;<br>A: &quot;Thank you so much.&quot;<br></td></tr></table>"
}