{
    "lessonIndex": 284,
    "categoryIndex": 1,
    "sectionIndex": 8,
    "title": "Worry - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=734",
    "html": "<h1>Worry - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L157/practice/L157P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L157/practice/L157P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L157/practice/L157P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;You don&apos;t look too well. What&apos;s going on?&quot;<br>B: &quot;I just lost my job. I&apos;m just worried about how I&apos;m going to pay the bills.&quot;<br>A: &quot;I&apos;m sorry to hear that. Have you been looking for another job?&quot;<br>B: &quot;I just started, but the job market is very bad right now. I&apos;m not optimistic about it.&quot;<br>A: &quot;That&apos;s tough. What does your wife think about this?&quot;<br>B: &quot;She&apos;s trying to be supportive, but I can tell she is very worried about our financial situation as well.&quot;<br>A: &quot;I have some friends who might be able to help you find a job. I&apos;ll see what they can do.&quot;<br>B: &quot;I really appreciate your help.&quot;<br>A: &quot;No problem. In the meantime, don&apos;t try to worry so much. You&apos;ll get through this.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L157/practice/L157P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L157/practice/L157P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L157/practice/L157P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Jared, I just heard about your father. How is he doing?&quot;<br>B: &quot;He&apos;s in the hospital resting. The doctor&apos;s didn&apos;t give a clear answer yet.&quot;<br>A: &quot;I&apos;m so sorry to hear that. But this is a good hospital. I&apos;m sure they will do whatever they can.&quot;<br>B: &quot;I hope so.&quot;<br>A: &quot;You must feel really worried right now. But you know your dad is a fighter.&quot;<br>B: &quot;Yeah. I think my mom is the most worried. I&apos;m basically worried about how she is doing.&quot;<br>A: &quot;Where is she right now?&quot;<br>B: &quot;She&apos;s in the hospital with my dad. I have to go back tonight.&quot;<br>A: &quot;Hey, I&apos;ll go with you.&quot;<br>B: &quot;You don&apos;t have to.&quot;<br>A: &quot;It&apos;s really no problem.&quot;<br>B: &quot;Ok. Let&apos;s go right after dinner.&quot;<br></td></tr></table>"
}