{
    "lessonIndex": 294,
    "categoryIndex": 1,
    "sectionIndex": 9,
    "title": "Sad or Depressed - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=744",
    "html": "<h1>Sad and Depressed - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L165/practice/L165P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L165/practice/L165P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L165/practice/L165P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Mike. What are you doing?&quot;<br>B: &quot;Nothing much. What are you up to?&quot;<br>A: &quot;I was just concerned about Sam. He hasn&apos;t been himself lately.&quot;<br>B: &quot;He took the civil service exam and failed.&quot;<br>A: &quot;That sucks. He must feel depressed.&quot;<br>B: &quot;Yeah. He&apos;s been sitting in his room everyday for the last 4 days.&quot;<br>A: &quot;Why don&apos;t we take him out? We can try to take his mind off of it. In the least show him that we&apos;re there for him.&quot;<br>B: &quot;That&apos;s a great idea. Why don&apos;t you call him. I already talked to him a couple of times and it might be good for him to hear from somebody else.&quot;<br>A: &quot;Ok. I&apos;ll call you back after I&apos;m done.&quot;<br>B: &quot;Sounds good.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L165/practice/L165P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L165/practice/L165P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L165/practice/L165P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Sarah. You look terrible. What&apos;s wrong?&quot;<br>B: &quot;My grandmother just passed away.&quot;<br>A: &quot;I&apos;m so sorry to hear that. When did this happen?&quot;<br>B: &quot;A couple of days ago. I just got back from the funeral.&quot;<br>A: &quot;Is there anything I can do?&quot;<br>B: &quot;No... not really. The sad thing is that I wasn&apos;t there when she died. I really wanted to be there one last time.&quot;<br>A: &quot;I&apos;m sure she knew you loved her. Did she pass away in the hospital?&quot;<br>B: &quot;Yeah. She died in her sleep.&quot;<br>A: &quot;I&apos;m sorry she&apos;s gone.&quot;<br>B: &quot;At least she didn&apos;t suffer.&quot;<br>A: &quot;I think your grandmother would want you to think of all the good times you spent together.&quot;<br>B: &quot;I know. But I miss her.&quot;<br>A: &quot;When my grandmother passed away, I frequently visited her in the cemetery. I always talked to her. Even though she wasn&apos;t there, I somehow knew she heard what I said.&quot;<br>B: &quot;Yeah? That&apos;s what I was thinking too. Thanks.&quot;<br>A: &quot;It looks like you haven&apos;t eaten anything all day. We should get you something to eat.&quot;<br>B: &quot;You&apos;re right... I should eat something. Let&apos;s go.&quot;<br></td></tr></table>"
}