{
    "categoryIndex": 1,
    "sectionIndex": 9,
    "title": "Love - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=749",
    "lessonIndex": 299,
    "html": "<h1>Love - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L169/practice/L169P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L169/practice/L169P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L169/practice/L169P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Jack. How&apos;s it going?&quot;<br>B: &quot;I&apos;m falling in love.&quot;<br>A: &quot;What! With who?&quot;<br>B: &quot;That girl in my econ class. She is so hot.&quot;<br>A: &quot;Did you guys go on a date already?&quot;<br>B: &quot;No. I didn&apos;t even talk to her yet. But I think I&apos;m in love.&quot;<br>A: &quot;Does she have a boyfriend?&quot;<br>B: &quot;I don&apos;t think so. I&apos;ve been following her around campus and I haven&apos;t seen another guy.&quot;<br>A: &quot;Dude, you&apos;re a stalker man. Just ask her on a date.&quot;<br>B: &quot;I plan on running into her in the cafeteria when she&apos;s alone. I think I&apos;ll ask her then.&quot;<br>A: &quot;So why do you think you&apos;re in love?&quot;<br>B: &quot;She&apos;s the only thing I can think of all day long.&quot;<br>A: &quot;That&apos;s called blind love. Well, I gotta run. Tell me how it goes next week.&quot;<br>B: &quot;Aright. I&apos;ll talk to you later.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L169/practice/L169P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L169/practice/L169P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L169/practice/L169P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Happy anniversary honey.&quot;<br>B: &quot;Happy anniversary baby.&quot;<br>A: &quot;It&apos;s been one year since we got married. It was so fast.&quot;<br>B: &quot;Yeah. And I love you so much.&quot;<br>A: &quot;Really? What do you love about me?&quot;<br>B: &quot;Well, you&apos;re beautiful, smart, with a wonderful personality.&quot;<br>A: &quot;What else?&quot;<br>B: &quot;I also think you&apos;re sexy.&quot;<br>A: &quot;You&apos;re embarrassing me.&quot;<br>B: &quot;You asked.&quot;<br>A: &quot;I love you so much. I&apos;m so happy and I think we have a wonderful marriage.&quot;<br>B: &quot;Me too. Let&apos;s make every year better and better.&quot;<br></td></tr></table>"
}