{
    "categoryIndex": 1,
    "sectionIndex": 9,
    "title": "Broken Heart - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=753",
    "lessonIndex": 303,
    "html": "<h1>Broken Heart - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L172/practice/L172P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L172/practice/L172P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L172/practice/L172P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Mike. I heard about your break up. You must be devastated.&quot;<br>B: &quot;It&apos;s more than I can bear. I don&apos;t think I can go on.&quot;<br>A: &quot;Come on Mike. It&apos;s not the end of the world.&quot;<br>B: &quot;It&apos;s the end of my world. She was everything to me. I loved her so much.&quot;<br>A: &quot;I remember my first break up. I remember it was the hardest thing I ever went through. So I know it must be really tough right now.&quot;<br>B: &quot;Every night, I cry myself to sleep. Can you believe that I actually cry everyday?&quot;<br>A: &quot;It&apos;s normal to cry. You shouldn&apos;t feel bad about it. It&apos;s the only way to let it out.&quot;<br>B: &quot;How long will I feel like this? How long is the pain going to last?&quot;<br>A: &quot;It&apos;s different for everyone, but it took me four months to get over Jessica.&quot;<br>B: &quot;Four months... I have to live in hell for four months...&quot;<br>A: &quot;But I&apos;m ok now. I moved on and I&apos;m dating other great people. I know you will be better.&quot;<br>B: &quot;Why do you think she left me?&quot;<br>A: &quot;I really don&apos;t know. Some people change and they want to go in different directions.&quot;<br>B: &quot;But I loved her so much. I loved her more than anything in this world. She was my world.&quot;<br>A: &quot;I know you love her.&quot;<br>B: &quot;I don&apos;t think I&apos;ll be able to love anyone again.&quot;<br>A: &quot;I thought that too. I thought Jessica was the only person I would ever love. But it changes. It really does. You&apos;ll get better and become a stronger person.&quot;<br>B: &quot;I hope so.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L172/practice/L172P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L172/practice/L172P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L172/practice/L172P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Why are you so quiet?&quot;<br>B: &quot;My girlfriend just broke up with me.&quot;<br>A: &quot;You must feel terrible now.&quot;<br>B: &quot;Yeah.&quot;<br>A: &quot;I remember my first break up. It was the worst feeling in the world. I was crying everyday for three months. And slowly, it got better. I know you&apos;ll feel better too.&quot;<br>B: &quot;You&apos;ve been through this too?&quot;<br>A: &quot;Yeah. I remember it very clearly. The pain makes it easy to remember. I know you&apos;re really hurting right now, but you know many people experience break ups.&quot;<br>B: &quot;But it hurts too much.&quot;<br>A: &quot;I know it&apos;s painful, but it&apos;s only temporary. After the pain goes away, you&apos;ll find other girls.&quot;<br>B: &quot;What if I don&apos;t want to find another girl?&quot;<br>A: &quot;You&apos;ll change your mind. Look at everyone in the world. They all break up and move on. The faster you understand this, the quicker you will recover.&quot;<br>B: &quot;You&apos;re right.&quot;<br>A: &quot;I also know you must still have strong feelings for her, but try to think of all the bad things. You know she didn&apos;t treat you that well. Is that the person you want to spend the rest of your life with?&quot;<br>B: &quot;Yeah. Thanks for the talk.&quot;<br>A: &quot;I&apos;ll give you a call later. We should hang out. It&apos;s good to be around people.&quot;<br>B: &quot;Ok. I&apos;ll talk to you later.&quot;<br></td></tr></table>"
}