{
    "categoryIndex": 1,
    "sectionIndex": 9,
    "title": "Afraid or Scared - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=756",
    "lessonIndex": 306,
    "html": "<h1>Afraid and Scared - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L174/practice/L174P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L174/practice/L174P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L174/practice/L174P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hello?&quot;<br>B: &quot;Hey Tina. What are you doing?&quot;<br>A: &quot;I was just watching TV. What&apos;s going on with you?&quot;<br>B: &quot;I just watched a movie and I&apos;m scared.&quot;<br>A: &quot;What did you watch?&quot;<br>B: &quot;I saw the Sixth Sense. I didn&apos;t know it was going to be so scary.&quot;<br>A: &quot;I remember that. It was a great movie. But it was definitely scary.&quot;<br>B: &quot;If you&apos;re not busy, do you want to come over? I&apos;m afraid to be alone.&quot;<br>A: &quot;Sure. I can come over. What should we do?&quot;<br>B: &quot;How about if we watch a comedy. I need something to get my mind off the frightening images I have from the Sixth Sense.&quot;<br>A: &quot;Ok. I&apos;ll get ready and leave. I&apos;ll see you in about 20 minutes.&quot;<br>B: &quot;Hurry, ok. It&apos;s dark out.&quot;<br>A: &quot;Don&apos;t worry, nothings going to happen. I&apos;ll be there real soon.&quot;<br>B: &quot;Ok. See you soon.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L174/practice/L174P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L174/practice/L174P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L174/practice/L174P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;What are you afraid of?&quot;<br>B: &quot;I&apos;m not sure. I used to be scared of a lot of things when I was young, but not anymore.&quot;<br>A: &quot;Are you afraid of death?&quot;<br>B: &quot;Only if I think about it so much. But death is inevitable, so there is no use thinking about it.&quot;<br>A: &quot;How about horror movies?&quot;<br>B: &quot;No. I know they&apos;re all fake so there is nothing to be afraid of. How about you?&quot;<br>A: &quot;I get scared pretty easily. I&apos;m actually frightened of bee&apos;s.&quot;<br>B: &quot;Really? Why?&quot;<br>A: &quot;I don&apos;t know. I got stung when I was young and ever since, I&apos;ve always been afraid of them.&quot;<br>B: &quot;What other things are you afraid of?&quot;<br>A: &quot;Sitting by the camp fire and telling horror stories is very scary.&quot;<br>B: &quot;Wow. You&apos;re afraid of many things huh?&quot;<br>A: &quot;I guess so. Aren&apos;t you afraid of something coming out of the bushes?&quot;<br>B: &quot;It&apos;s not going to happen. We probably went camping dozens of times and nothing ever came out of the bushes. What makes you think something will?&quot;<br>A: &quot;I don&apos;t know. I guess I&apos;m terrified at the possibility.&quot;<br>B: &quot;If you were realistic, you probably wouldn&apos;t be scared of everything. Maybe you have too much imagination.&quot;<br>A: &quot;I should try to think more realistically. I&apos;ll do that.&quot;<br>B: &quot;Good. After awhile, you won&apos;t be afraid of so many things.&quot;<br></td></tr></table>"
}