{
    "lessonIndex": 314,
    "categoryIndex": 1,
    "sectionIndex": 9,
    "title": "Feelings and Emotions Review - InteractivePractice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=764",
    "html": "<h1>Feelings Review - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L180/practice/L180P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L180/practice/L180P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L180/practice/L180P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Matt. I just got a job at a consulting firm.&quot;<br>B: &quot;Congratulations. That&apos;s great!&quot;<br>A: &quot;I&apos;m so happy. I don&apos;t have to worry about finding a job and interviewing anymore.&quot;<br>B: &quot;When do you start?&quot;<br>A: &quot;I start next Monday.&quot;<br>B: &quot;You&apos;re going to have to put in a lot of hours you know.&quot;<br>A: &quot;I know. I&apos;m a little nervous, but it&apos;s pretty exciting.&quot;<br>B: &quot;I bet. You must be stoked.&quot;<br>A: &quot;Yeah. I&apos;m going to celebrate tonight. Wanna hang out?&quot;<br>B: &quot;Sure. It&apos;s on you right?&quot;<br>A: &quot;Of course. How about Toby? Should we call him?&quot;<br>B: &quot;I don&apos;t know. He&apos;s a little depressed. He&apos;s having a hard time finding a job right now.&quot;<br>A: &quot;I should still tell him. In the least, I can refer him to my company. It might help.&quot;<br>B: &quot;That sounds like a good idea.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L180/practice/L180P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L180/practice/L180P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L180/practice/L180P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Why the long face?&quot;<br>B: &quot;I&apos;m getting sick of work man. I can&apos;t take the political bull in the company any more.&quot;<br>A: &quot;Did you just get your review or something?&quot;<br>B: &quot;Yeah, but that&apos;s not why I am upset. I just found out another guy got a promotion. He doesn&apos;t know how to do anything. He sits there and kisses the managers butt all day long.&quot;<br>A: &quot;That sucks.&quot;<br>B: &quot;I&apos;m just pissed that management can&apos;t see behind his smooth talking lies.&quot;<br>A: &quot;Look on the bright side. At least you have a job.&quot;<br>B: &quot;Yeah. I shouldn&apos;t stress about this anymore. It&apos;s not like I can do anything about it.&quot;<br>A: &quot;Exactly. Instead, we should have some drinks tonight.&quot;<br>B: &quot;How about a cold bottle of beer.&quot;<br>A: &quot;Now you&apos;re talking.&quot;<br><br></td></tr><tr><td>3 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L180/practice/L180P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L180/practice/L180P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L180/practice/L180P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Martha. What&apos;s wrong? Why are you crying?&quot;<br>B: &quot;Jake just broke up with me.&quot;<br>A: &quot;I&apos;m sorry. When did this happen?&quot;<br>B: &quot;Yesterday. I didn&apos;t even know it was coming. He just told me he found someone else.&quot;<br>A: &quot;What a jerk. He doesn&apos;t deserve you.&quot;<br>B: &quot;But it still hurts. I thought I loved him.&quot;<br>A: &quot;He didn&apos;t treat you that well either. Maybe you don&apos;t want to hear this, but I think you can do better.&quot;<br>B: &quot;Better or worse, it doesn&apos;t matter. I had a lot of feelings for him. I really liked him&quot;<br>A: &quot;It must be really painful. I remember when Josh and I broke up. I was crying for a week.&quot;<br>B: &quot;I know I&apos;ll get over him. My first break up was painful because I was nanve.&quot;<br>A: &quot;Exactly. You&apos;ll find someone again. You should get your mind off of this. Let&apos;s go shopping.&quot;<br>B: &quot;Maybe tomorrow. I don&apos;t feel like it tonight.&quot;<br>A: &quot;How about coffee down the street?&quot;<br>B: &quot;Sure.&quot;<br><br></td></tr><tr><td>4 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L180/practice/L180P4.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L180/practice/L180P4b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L180/practice/L180P4a.mp3\">Person B</a></td></tr><tr><td>A: &quot;What are you doing here on the bench? You&apos;ve been here for an hour.&quot;<br>B: &quot;I&apos;m just thinking about Lucy. I can&apos;t get her out of my mind. I think I&apos;m falling in love.&quot;<br>A: &quot;Crazy boy. You barely know her.&quot;<br>B: &quot;It doesn&apos;t matter. I like everything about her. I like the way she talks, the way she walks, her hair and her lips. I would give anything to kiss her.&quot;<br>A: &quot;Did you tell her how you feel?&quot;<br>B: &quot;No way. I&apos;ll scare her away.&quot;<br>A: &quot;You won&apos;t know until you tell her.&quot;<br>B: &quot;Maybe later. But right now, all I can think about is her legs and her face. She is so beautiful.&quot;<br>A: &quot;You&apos;re wasting your time. At least talk to her. You don&apos;t have to tell her how you feel.&quot;<br>B: &quot;Yeah. I started talking to her in my Poly Sci class. I try to sit next to her as much as I can.&quot;<br>A: &quot;That&apos;s a start. After awhile, you&apos;ll find out if she is everything you make her out to be.&quot;<br>B: &quot;It won&apos;t matter because I love everything she does.&quot;<br>A: &quot;Dude, you&apos;re blind as a bat. You&apos;re just infatuated with her.&quot;<br>B: &quot;These feelings are too strong to be infatuation.&quot;<br>A: &quot;We&apos;ll see in a couple of weeks. Let&apos;s go grab something to eat. You&apos;re human aren&apos;t you?&quot;<br>B: &quot;To think of it, I am a little hungry. Ok. Let&apos;s go.&quot;<br></td></tr></table>"
}