{
    "categoryIndex": 1,
    "sectionIndex": 10,
    "title": "Mail",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=213",
    "lessonIndex": 330,
    "html": "\r\n<h1>\r\nMail\r\n</h1>\r\nMail basically is comprised of three components, the preparation, sending and receiving of mail. &#xA0;&#xA0;Sending mail can be as simple as putting addressed/stamped envelopes in your own mail box for your postman to pick up, to mailing packages or letters at the local post office or using one of the many delivery companies. &#xA0;Receiving mail/packages can also include delivery from your local postman as well as one of the many delivery companies.<br><br><b>The Preparation</b><br><br>Preparing mail/packages to be sent involves labeling with the recipient&apos;s name and address as well as the senders. &#xA0;Also making sure packages are sealed and wrapped to postal standards is a good idea. &#xA0;Make sure you are aware of postal laws regarding the types of materials that can be sent in the United States as well as other countries before mailing.<br><br>Here are some questions commonly used when discussing the preparation of letters and packages to send.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P213/sentence/P213S1.mp3\">Where do I put my name and address on the letter I am sending?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P213/sentence/P213S2.mp3\">How do I know if I need to put more than one stamp on the card I am sending?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P213/sentence/P213S3.mp3\">What should I put with the item I am shipping to make sure it does not break?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P213/sentence/P213S4.mp3\">How heavy can the objects be that I am sending?</a>&quot;<br><br>Here are some possible answers to the question above regarding the preparation of letters/packages.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P213/sentence/P213S5.mp3\">You always put your name or the senders name and address in the top left corner of the package/letter. &#xA0;This is in case it cannot be delivered and needs to be returned to you. &#xA0;It will be returned to the address you have provided.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P213/sentence/P213S6.mp3\">I would either take the letter to the post office and ask them or look on the postal website to look at weight regulations when sending out letters.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P213/sentence/P213S7.mp3\">You can use newspaper or purchase packing material from the store to place in with what you are sending. &#xA0;You may also want to write on the outside of the package that what is inside is FRAGILE. &#xA0;This will inform whoever is handling it to be careful and handle gently.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P213/sentence/P213S8.mp3\">You can send objects of various weights but you will be charged upon how much it weighs when shipping it. &#xA0;Meaning the more it weighs the more it will cost you to ship.</a>&quot;<br>\r\n"
}