{
    "lessonIndex": 350,
    "categoryIndex": 1,
    "sectionIndex": 11,
    "title": "School - Kids",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=233",
    "html": "\r\n<h1>\r\nSchool - Kids\r\n</h1>\r\n<b>Picking a school</b><br><br>Depending on where you live you will most likely have a school assigned to you. &#xA0;The schools assigned to your area are public schools which offer grades kindergarten all the way up through high school. Public schools are free and are offered to all. &#xA0;A few other options available are private schools or even home schooling. &#xA0;Private schools usually require a tuition fee and vary in price and distance from where you live. Home schooling is where the parent(s) are the teachers at home educating and teaching their children. &#xA0;Children that are home schooled and decide to change to public or private schools usually will need to test into their appropriate grade.<br><br>Here are some questions commonly used when picking a school.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P233/sentence/P233S1.mp3\">Are the public schools in this area good?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P233/sentence/P233S2.mp3\">Do the public schools in our area have full day kindergarten?</a>&quot;<br><br><b>Getting to School</b><br><br>When talking about getting to school you are simply talking about the act of &apos;how&apos; your child will get to the school they are attending.<br><br>Here are some questions commonly used when talking about ways to get to school.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P233/sentence/P233S3.mp3\">Is there a bus stop near our house?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P233/sentence/P233S4.mp3\">Can I drive my kids to school?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P233/sentence/P233S5.mp3\">Can my kids walk to school?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P233/sentence/P233S6.mp3\">What if we miss the bus in the morning?</a>&quot;<br><br>If you are asked any of these questions, here are ways that you could respond or answers you might hear.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P233/sentence/P233S7.mp3\">There is a bus stop right around the corner from our neighborhood.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P233/sentence/P233S8.mp3\">There are no bus stops close to our neighborhood. &#xA0;We need to drive to the bus stop.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P233/sentence/P233S9.mp3\">Yes, you can drive your kids to school.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P233/sentence/P233S10.mp3\">Not sure, you may want to check with the school.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P233/sentence/P233S11.mp3\">Kids can walk to school if they live within a close distance from the school.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P233/sentence/P233S12.mp3\">Children walking to school need to be accompanied by an adult.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P233/sentence/P233S13.mp3\">If you miss the bus it is your responsibility to drive your child to school.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P233/sentence/P233S14.mp3\">If you miss the bus maybe you can catch a ride from a neighbor or a friend.</a>&quot;<br>\r\n"
}