{
    "lessonIndex": 355,
    "categoryIndex": 1,
    "sectionIndex": 11,
    "title": "Vacations",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=238",
    "html": "\r\n<h1>\r\nVacations\r\n</h1>\r\nIf you have a job, vacations are a time spent away from it, or a vacation may just be time spent relaxing and taking a break from your daily responsibilities. Vacations can be as simple as staying home and relaxing with family to going on a trip somewhere to get away.<br><br><b>Planning a Vacation</b><br><br>Planning a vacation properly can make all the difference between having a fun, relaxing time to being stressed and not knowing what to do. &#xA0;If you decide to just stay home for a vacation then relaxing with family or friends might work just fine but if traveling, you may want to put in some research into what to do and when to do it. &#xA0;If visiting family or friends make sure they are able to take time away from their own jobs to spend quality time with you. &#xA0;If you are going to another state or country, checking travel requirements, weather, and accommodation will help make it a better experience. &#xA0;If you are employed it is a good idea to ask for the time off before scheduling anything. &#xA0;That way you can be sure of dates and times you will be gone.<br><br>Here are some questions commonly used when planning a vacation.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S1.mp3\">How far in advance should I ask for vacation time?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S2.mp3\">How do I find out if I need a passport?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S3.mp3\">How do I get a passport?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S4.mp3\">How do I find out about fun places to visit?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S5.mp3\">How far in advance should I book a place to stay?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S6.mp3\">Should I use a travel agency?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S7.mp3\">Should I contact family or friends to make sure we can visit?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S8.mp3\">Should we go to an all-inclusive resort?</a>&quot;<br><br>All-inclusive means you pay ahead of time for your rooms, food and beverages. &#xA0;Sometimes it helps to cut down on costs.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S9.mp3\">What if we do not speak the language of the place we are going to?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S10.mp3\">What if we need to rent a car?</a>&quot;<br><br>If you are asked any of these questions, here are ways that you could respond.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S11.mp3\">I would ask for vacation time months in advance if you can.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S12.mp3\">The earlier you ask the better chance you have of getting the time off.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S13.mp3\">Once you decide where you are going I would call the airport and ask them.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S14.mp3\">If you travel outside of the United States you will need a passport.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S15.mp3\">You can apply for a passport at a local Government Agency.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S16.mp3\">Check online for information.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S17.mp3\">You could go to the book store and look at travel books or brochures.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S18.mp3\">I would get online and do some research on places you are interested.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S19.mp3\">It depends on where you are going. &#xA0;I would call and ask them how far in advance they take reservations.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S20.mp3\">I would call them as soon as you decide on where to go.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S21.mp3\">You can sometimes get good deals and information from a travel agency.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S22.mp3\">I would just do it yourself. &#xA0;You can find out all the information online.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S23.mp3\">Yes I would contact them to make sure they are available when you visit.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S24.mp3\">If you can visit when they have time off you will be able to do more together.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S25.mp3\">An all-inclusive resort would be nice so everything is already paid for.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S26.mp3\">I would rather just stay at a hotel and pay for things as we do them.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S27.mp3\">You can buy a book to bring a along to help translate.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S28.mp3\">You could study a bit before you go to learn a few new words.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S29.mp3\">I would call ahead of time and reserve a car from a car rental agency.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P238/sentence/P238S30.mp3\">I would check with the place you are staying to see if they have car rentals.</a>&quot;<br><br><b>Getting There</b><br><br>Once you have scheduled a vacation and have decided to travel, you must now consider some sort of transportation. &#xA0;A lot depends on how far you are going, where you are going, and how fast you need to get there. &#xA0;Options might include traveling by airplane, car or even train. &#xA0;Checking prices, requirements for travel, and whether or not the mode of transportation goes to the destination are all the things to consider. &#xA0;If traveling by plane or train, make sure you book your seats months in advance if possible to assure a spot. A lot of times the price of traveling will change depending on your choice of seats and the time of year. &#xA0;So make sure you consider all when making reservations.<br>\r\n"
}