{
    "lessonIndex": 384,
    "categoryIndex": 2,
    "sectionIndex": 1,
    "title": "Late or No Show - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=454",
    "html": "<h1>Late for Work - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B12/practice/B12P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B12/practice/B12P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B12/practice/B12P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Jack. Can I see you in my office?&quot;<br>B: &quot;Sure.&quot;<br>A: &quot;You have been late 3 times in the last 2 weeks. Is this going to be a continual problem?&quot;<br>B: &quot;I&apos;m so sorry. I really got unlucky this morning.&quot;<br>A: &quot;Being late once in a while is based on luck. If you are late frequently, it shows that you are irresponsible. How are you going to fix it?&quot;<br>B: &quot;Last week, I had a lot of personal problems. I took care of all those problems and I don&apos;t have any excuse to be late anymore. I planned on coming in to the office early today, but there was an accident that held up traffic.&quot;<br>A: &quot;You better start anticipating all problems because I&apos;m not going to tolerate your tardiness any longer. Is that clear?&quot;<br>B: &quot;Perfectly clear. I will not be late again.&quot;<br>A: &quot;That&apos;s all.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B12/practice/B12P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B12/practice/B12P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B12/practice/B12P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Martha, is there anything urgent that needs to be done today?&quot;<br>B: &quot;No. I don&apos;t believe so. Why?&quot;<br>A: &quot;I have a terrible headache and I was wondering if it would be ok if I could leave a little early today.&quot;<br>B: &quot;I don&apos;t see why not. You can make up the time later in the week.&quot;<br>A: &quot;That&apos;s what I was thinking too. But as for today, I don&apos;t think I can be productive.&quot;<br>B: &quot;It&apos;s already two o&apos;clock now. What time were you going to leave?&quot;<br>A: &quot;I&apos;m just going to wrap up and leave pretty soon. Probably in about thirty minutes.&quot;<br>B: &quot;Ok. Get some rest. If you are sick tomorrow, give me a call.&quot;<br>A: &quot;Aright. Thanks. I&apos;ll see you tomorrow.&quot;<br><br></td></tr><tr><td>3 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B12/practice/B12P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B12/practice/B12P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B12/practice/B12P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hi Martha. This is Jack. I think I caught a flu or something. I feel worse than yesterday.&quot;<br>B: &quot;You better stay home today then.&quot;<br>A: &quot;I think that will be best. I&apos;ll log my sick day tomorrow when I get in.&quot;<br>B: &quot;No problem. Just get some rest. We have everything covered here so don&apos;t worry.&quot;<br>A: &quot;Ok. Just in case something happens, you can call me at home. I&apos;ll be here all day.&quot;<br>B: &quot;Ok. Thanks for calling. I&apos;ll see you when you get better.&quot;<br>A: &quot;Aright. Thanks. Bye.&quot;<br></td></tr></table>"
}