{
    "categoryIndex": 2,
    "sectionIndex": 5,
    "title": "During the Meeting",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=475",
    "lessonIndex": 406,
    "html": "\r\n<h1>\r\nDuring the Meeting\r\n</h1>\r\nIf you have to talk in a meeting, there are three general reasons. &#xA0;You might have to ask a question, state your opinion, or you will have to ask for clarity on something you didn&apos;t understand. &#xA0;Let&apos;s see some of these sentences.<br><br><b>Raising a Question</b><br><br>Depending on the type of meeting, you might have to wait for the meeting to end before asking a question, you might have to raise your hand to ask a question, or you can simply ask a question any time. &#xA0;I&apos;ll give an example on each of these.<br><br>If you are in a type of meeting where you can ask a question at any time, then you can say this.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B32/sentence/B32S1.mp3\">I have a question. &#xA0;Why is marketing not handling the portion on end user analysis? &#xA0;They usually did this work in the past.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B32/sentence/B32S2.mp3\">How will the new addition to our project affect the deadline that we have?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B32/sentence/B32S3.mp3\">Are we making sure to incorporate user feedback on the changes we are making?</a>&quot;<br><br><b>Stating your Opinion</b><br><br>Basically, you can ask any questions, there is no specific way to do it. &#xA0;This is the same when you are talking about your opinion. &#xA0;Someone might ask what you think about the idea or situation. &#xA0;You will simply speak your answer.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B32/sentence/B32S4.mp3\">I agree with Mark. &#xA0;The correct approach is to send out the tools to our partners before making it public to everyone.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B32/sentence/B32S5.mp3\">In my opinion, I think we should introduce our new line of printers in August. &#xA0;Many companies get more funding at this time, and students are school shopping. &#xA0;Our target market will be more responsive to our ads during this time period.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B32/sentence/B32S6.mp3\">I think we can go either way. &#xA0;I believe both solutions will take care of it.</a>&quot;<br><br><b>Asking for clarity</b><br><br>Asking for clarity is similar to asking a question. &#xA0;The only difference is that they already answered it and you don&apos;t understand. &#xA0;So you should state exactly what you don&apos;t know, or ask for clarity on a specific part of the question.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B32/sentence/B32S7.mp3\">I didn&apos;t understand why we are going to be late. &#xA0;I thought we had everything planned out early. &#xA0;What were the reasons again?</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B32/sentence/B32S8.mp3\">Can you elaborate on how this process can help the sales department?</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B32/sentence/B32S9.mp3\">Can you clarify the second step in your solution proposal? &#xA0;I don&apos;t understand why it is necessary.</a>&quot;\r\n"
}