{
    "categoryIndex": 2,
    "sectionIndex": 6,
    "title": "Leaving Messages",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=481",
    "lessonIndex": 412,
    "html": "\r\n<h1>\r\nLeaving Messages\r\n</h1>\r\nWhen you call someone and they are not there, you have to leave a message on their voice mail. &#xA0;Remember to state your name, your company, and what the phone call is regarding. &#xA0;Then leave your phone number even though you think they have it.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B38/sentence/B38S1.mp3\">Hi Mary, this is Josh from ABC Company. &#xA0;I have some questions regarding the financial data you sent me yesterday. &#xA0;Can you give me a call back when you have time? &#xA0;My number is 555-123-4567. &#xA0;Thank you.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B38/sentence/B38S2.mp3\">Hi Jack, this is Julie from Consult R Us. &#xA0;I am missing a couple pages on the document you sent me. &#xA0;Can you call me when you are free? &#xA0;My number again is 555-321-7654. &#xA0;Thank you.</a>&quot;<br><br>In some cases, you will receive a phone message like this. &#xA0;If you have to call them back and they are not there also, you can leave a message saying, you are returning their call. &#xA0;Here is an example.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B38/sentence/B38S3.mp3\">Hi Josh, this is Mary and I am returning your call. &#xA0;I&apos;ll be in the office for the next three hours, so feel free to call me back any time. &#xA0;Just in case, my number is 555-234-5678.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B38/sentence/B38S4.mp3\">Hi Julie, this is Jack. &#xA0;I double checked the documents I sent you and I am not sure what pages you are missing. &#xA0;I might not be at my desk, so feel free to call me on my cell phone. &#xA0;The number is 227-1000. &#xA0;Hope to hear from you soon so we can straighten this out.</a>&quot;<br><br>On another occasion, you might call someone and they might not call you back. &#xA0;In this case, it is polite to call them again. &#xA0;This is how you can leave a second message.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B38/sentence/B38S5.mp3\">Hi Mary, this is Josh again from ABC Company. &#xA0;I&apos;m not sure if you got my first message so I am leaving one more. &#xA0;I have some questions regarding the financial data you sent me several days ago. &#xA0;Can you call me at 555-123-4567 when you get a chance? &#xA0;Thank you.</a>&quot;<br><br>If the company does not have voice mail, you can leave a message with the secretary. &#xA0;After asking for the person you are looking for, if they say they are not in, then leave a message with them.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B38/sentence/B38S6.mp3\">Can you have Julie return my call? &#xA0;This is Jack, and my number is 555-123-4567.</a>&quot;\r\n"
}