{
    "categoryIndex": 2,
    "sectionIndex": 7,
    "title": "Talking to Coworkers - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=489",
    "lessonIndex": 420,
    "html": "<h1>Talking to CoWorkers - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B44/practice/B44P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B44/practice/B44P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B44/practice/B44P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Jack. How is your day going?&quot;<br>B: &quot;Just finishing the project. Other than that, not much. How about you?&quot;<br>A: &quot;I&apos;m just about finished for the day. I have one more task to do, but I wanted to take a break first.&quot;<br>B: &quot;Did you have to work with Jake on that project?&quot;<br>A: &quot;Unfortunately, yes.&quot;<br>B: &quot;Oh my gosh. I feel so sorry for you.&quot;<br>A: &quot;Don&apos;t remind me. I&apos;m just glad it&apos;s over.&quot;<br>B: &quot;Yeah. I remember when I worked on the data conversion tool with him. Everything he did, I had to re-do. It would have been faster if I did it alone.&quot;<br>A: &quot;That&apos;s exactly what happened to me. It took me longer because I had to re-do everything he did. That really pissed me off.&quot;<br>B: &quot;Next time the manager wants me to do a project with him, I&apos;m going to tell him that I will do it myself.&quot;<br>A: &quot;That&apos;s a good idea. Hopefully, the manager will realize how useless he is.&quot;<br>B: &quot;Exactly. If you&apos;re not busy, you can do my work.&quot;<br>A: &quot;Ha ha. I got enough to do.&quot;<br>B: &quot;Yeah. I&apos;m just kidding.&quot;<br>A: &quot;Aright dude. I better finish my work. I&apos;ll talk to you later.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B44/practice/B44P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B44/practice/B44P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B44/practice/B44P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Jordan, did you go to the team meeting this morning?&quot;<br>B: &quot;Yeah. The manager presented a new project to us that we&apos;ll have to do.&quot;<br>A: &quot;Damn it. I shouldn&apos;t have missed that meeting, but I was stuck in another meeting. What else did you guys talk about?&quot;<br>B: &quot;Everything else was the same. We talked about progress of current assignments, due dates, about hiring another worker, that&apos;s all.&quot;<br>A: &quot;What&apos;s the new project about?&quot;<br>B: &quot;It&apos;s hard to explain. She sent out mail to all of us. You can just review the document she sent out.&quot;<br>A: &quot;Ok. I&apos;ll do that.&quot;<br><br></td></tr><tr><td>3 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B44/practice/B44P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B44/practice/B44P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B44/practice/B44P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Bob, do you have a few minutes?&quot;<br>B: &quot;Sure. What&apos;s up?&quot;<br>A: &quot;I&apos;m having problems with my computer. I don&apos;t know what&apos;s wrong with it.&quot;<br>B: &quot;Let&apos;s go take a look at it. Oh. Here is the problem. You have a boot sector virus. Install the anti-virus software. That should take care of the problem.&quot;<br>A: &quot;Great thanks.<br><br></td></tr><tr><td>4 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B44/practice/B44P4.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B44/practice/B44P4b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B44/practice/B44P4a.mp3\">Person B</a></td></tr><tr><td>A: &quot;How is your day going?&quot;<br>B: &quot;The same as usual. How about you?&quot;<br>A: &quot;Me too. I&apos;m getting sick of work man.&quot;<br>B: &quot;I&apos;m already past that stage.&quot;<br>A: &quot;What are you still doing here then?&quot;<br>B: &quot;It pays the bills.&quot;<br>A: &quot;Why don&apos;t you find another job?&quot;<br>B: &quot;Well, I thought about it, but if I put in two more years, then I get a good pension. I can&apos;t give that up. Anyway, this job is boring, but at least it&apos;s easy.&quot;<br>A: &quot;Well, you&apos;ve been here for eight years. You have some things to stay for. I&apos;ve only been here for two years. I can&apos;t see myself doing this for another two years. I want to gain more experience in other areas.&quot;<br>B: &quot;Have you brought this up to the boss? Maybe you can go into management.&quot;<br>A: &quot;They usually want a person with an MBA degree or a person willing to put in 80 hours a week.&quot;<br>B: &quot;That&apos;s what it takes man. Either this or that.&quot;<br>A: &quot;Yeah. I better think about what I want. Why didn&apos;t you go into management?&quot;<br>B: &quot;It would have taken too much time. I have a family that I want to spend time with, so it wasn&apos;t worth it for me. But you&apos;re single. You can put in a few good years and put yourself in a good position before thinking about settling down.&quot;<br>A: &quot;You have a point. I&apos;ll see what my options are. Hopefully the manager will help me out with my career.&quot;<br>B: &quot;She&apos;s pretty cool about that. Just be honest with her and she&apos;ll show you some doors.&quot;<br>A: &quot;That sounds good. Thanks for the advice.&quot;<br>B: &quot;No problem. Good luck.&quot;<br></td></tr></table>"
}