{
    "lessonIndex": 421,
    "categoryIndex": 2,
    "sectionIndex": 8,
    "title": "Talking to the Boss",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=490",
    "html": "\r\n<h1>\r\nTalking to the Boss\r\n</h1>\r\nUnless you are the owner of the company, you will have a boss. &#xA0;This lesson will cover all English you need to know to express what you want to say to your boss. &#xA0;This will include asking for feedback, explanation, showing frustration, asking for more work, and more.<br><br>If you are doing a project and you want your manager to review it before submitting it, then you can ask the manager in several ways.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B45/sentence/B45S1.mp3\">Did you want to review my project?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B45/sentence/B45S2.mp3\">I just completed the assignment. &#xA0;Did you want to review it?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B45/sentence/B45S3.mp3\">This is my first project and I was wondering if you could review it real quick?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B45/sentence/B45S4.mp3\">I think I covered all the bases, but could you do a quick check.</a>&quot;<br><br>If you are new at your job, then it is good to ask for feedback. &#xA0;This can be done when you complete a project or after several months on the job. &#xA0;Some companies have a process in place where you have a weekly one on one meeting with your manager. &#xA0;You can use this time to talk about your work and anything else on your mind. &#xA0;If you don&apos;t have a weekly meeting, then you might have to set up a time with your manager to discuss your progress.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B45/sentence/B45S5.mp3\">Hi Roger, can we set up a time to discuss my progress so far?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B45/sentence/B45S6.mp3\">I was wondering if we can meet to discuss how I am doing.</a>&quot;<br><br>If you are doing work that doesn&apos;t include projects or assignments, then you can&apos;t ask for feedback on the work you completed. &#xA0;But you can ask how you have been doing in the last several months.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B45/sentence/B45S7.mp3\">Can I get some feedback on my performance?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B45/sentence/B45S8.mp3\">Where do you think I need to improve?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B45/sentence/B45S9.mp3\">What areas do you think I should work on?</a>&quot;<br><br>If you have a project you completed, you can ask for feedback on the project. &#xA0;But make sure you give your manager enough time to review the work before asking for feedback.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B45/sentence/B45S10.mp3\">Did you finish reviewing my project I completed?</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B45/sentence/B45S11.mp3\">Hi Mark, this was my first project, and I wanted to know how I did so I can improve.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B45/sentence/B45S12.mp3\">Where do you think I could have done better?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B45/sentence/B45S13.mp3\">Is there any areas that I could have done better?</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B45/sentence/B45S14.mp3\">What should I do better for next time?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B45/sentence/B45S15.mp3\">What areas did I do well, and what areas did I do poorly.</a>&quot;\r\n"
}