{
    "categoryIndex": 2,
    "sectionIndex": 8,
    "title": "Talking to Boss - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=494",
    "lessonIndex": 425,
    "html": "<h1>Talking to the Boss - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B48/practice/B48P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B48/practice/B48P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B48/practice/B48P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hi Matt, I finished the assignment on the documents. Did you get a chance to review them?&quot;<br>B: &quot;Yeah. I already reviewed them. It was pretty good.&quot;<br>A: &quot;Since it was my first project, I was wondering if I can get some feedback.&quot;<br>B: &quot;Well, you finished the project on time. And seeing how it was your first assignment, you did very well.&quot;<br>A: &quot;Thanks. If it wasn&apos;t my first assignment, where do you think I need to improve?&quot;<br>B: &quot;That&apos;s a fair question... I think you could have spent a little more time documenting the difference between Process A and Process B. You showed a lot of the similarities, but lacking a little on the differences.&quot;<br>A: &quot;I&apos;ll keep that in mind. How about the structure? I changed the template a little because I wanted to add a section for recommendation.&quot;<br>B: &quot;I liked the addition. Usually people just enter it into the comment section on the bottom but having a clear section makes it stand out. That was good.&quot;<br>A: &quot;Was there anything else? I like to get feedback early so I can improve.&quot;<br>B: &quot;No problem. Everything else on the assignment was great. The only other tip I can give you is sending me more updates. If I knew you were stuck on section C for a while, I could have saved you a lot of time. So keep me aware on your status.&quot;<br>A: &quot;That makes sense. I&apos;ll do that. Thanks for the feedback.&quot;<br>B: &quot;Don&apos;t mention it. And good job on the assignment.&quot;<br>A: &quot;Thanks.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B48/practice/B48P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B48/practice/B48P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B48/practice/B48P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hi Mark. I completed Project A and didn&apos;t have anything else to work on. Should I find something to do, or did you have something lined up?&quot;<br>B: &quot;I won&apos;t have another assignment for you until next Monday. What will you be doing until then?&quot;<br>A: &quot;I&apos;m not sure, I was thinking about investigating the reporting issue we are having, but that&apos;s a low priority now. But if there is nothing else to do, it might be good to finally fix that.&quot;<br>B: &quot;How about John. He told me that he needed a little help on Project C. Why don&apos;t you ask him if he still needs help. If not, then check out the reporting issue.&quot;<br>A: &quot;John? I&apos;ve been meaning to talk to you about him.&quot;<br>B: &quot;What&apos;s the problem?&quot;<br>A: &quot;I don&apos;t want to be out of line, but he&apos;s very difficult to work with. He looks over my shoulder all the time and doesn&apos;t like how I am doing things.&quot;<br>B: &quot;Yeah. He is like that. I appreciate your feedback, and you are not the first to bring this up. Although he is difficult, he does get a lot of work done around here.&quot;<br>A: &quot;I completely agree, and I will continue to work with him as well as I can. I just thought I should let you know instead of keeping it bottled up.&quot;<br>B: &quot;I appreciate your honesty. But for now, you&apos;re going to have to tolerate his methods a little longer. I&apos;ll see if the director is willing to have a talk with John about this problem.&quot;<br>A: &quot;Ok. Well, I&apos;ll go see what type of help John needs. If there is nothing, I&apos;ll work on the reporting problem. Either way, I&apos;ll send you an email letting you know what I am working on.&quot;<br>B: &quot;That would be perfect. Thanks.&quot;<br>A: &quot;Thanks. I&apos;ll talk to you later.&quot;<br>B: &quot;Ok. Bye.&quot;<br></td></tr></table>"
}