{
    "categoryIndex": 2,
    "sectionIndex": 9,
    "title": "Project Change",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=496",
    "lessonIndex": 427,
    "html": "\r\n<h1>\r\nProject Change\r\n</h1>\r\nThere are times when a project changes and you have to tell your direct to change something. &#xA0;Let&apos;s work on some sentences where you do this.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B50/sentence/B50S1.mp3\">I know you have been working on the database using excel, but we need to use SQL. &#xA0;Can you make the necessary changes?</a>&quot;<br><br>Although you don&apos;t have to be polite to your direct, it is good practice to show directs some common courtesy. &#xA0;In the sentence above, it recognizes the work that has been done so far, instructs what needs to be changed, and politely asks if they can do it. &#xA0;You should follow a similar way of asking your direct to change something.<br><br>In another scenario, your direct might give you a report to review. &#xA0;If something is incorrect, or not complete, you should tell them professionally what needs to be redone.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B50/sentence/B50S2.mp3\">Hey Jackie, I reviewed your report and there are a couple areas you have to change. &#xA0;Can you double check the figures you provided in page 7, and provide a recommendation for step 3? &#xA0;I would appreciate it.</a>&quot;<br><br>This example is a little more firm, but still polite. &#xA0;It states that changes are required, it then asks if two things can be changed, and finally, adds a good comment about appreciating the work.<br><br>Finally, your direct could be doing something on a regular basis that you don&apos;t like. &#xA0;As a manager, you should tolerate things that do not affect the work, but if there is something that is work related, it is your responsibility to tell that person. &#xA0;Let&apos;s use an example where a person has a habit of talking before someone finishes.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B50/sentence/B50S3.mp3\">John, when we are discussing something in meetings or small groups, I noticed that you don&apos;t allow the other person to complete their sentences. &#xA0;I do appreciate your contributions, but I think you should always hear the other person out. &#xA0;Can you try to do that?</a>&quot; <br><br>Adding a simple phrase like appreciating the contribution can make a huge difference when giving criticism. &#xA0;There is a great chance the direct will be offended or upset. &#xA0;But if you add a small compliment in there, the chances of the direct accepting your criticism will be that much greater.\r\n"
}