{
    "lessonIndex": 431,
    "categoryIndex": 2,
    "sectionIndex": 9,
    "title": "Reprimanding",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=500",
    "html": "\r\n<h1>\r\nReprimanding\r\n</h1>\r\nFinally, when you have an employee that is doing something wrong such as being late, turning in a project late, or not performing well, it is your responsibility to let them know.<br><br>If someone is always late, then you don&apos;t have to ask for an excuse. &#xA0;If it was one time, then it is ok, but if they are constantly late, there is no excuse for it.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B54/sentence/B54S1.mp3\">You have been late for work on a regular basis. &#xA0;You better start coming to work on time.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B54/sentence/B54S2.mp3\">This is your third warning. &#xA0;If you are late for work again, we will have to take more serious action on you. &#xA0;Is that understood?</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B54/sentence/B54S3.mp3\">Being late for work once in a while is understandable. &#xA0;But there is no excuse to be coming in to work late every day. &#xA0;You better start coming in on time.</a>&quot;<br><br>When a direct doesn&apos;t turn in a project, it&apos;s a pretty serious no-no. &#xA0;I would definitely be upset, but as a good manager, I wouldn&apos;t accuse the employee without giving them a chance to explain. &#xA0;Here is an example.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B54/sentence/B54S4.mp3\">The report was due last Friday. &#xA0;What&apos;s going on?</a>&quot;<br><br>This is more like a trap question. &#xA0;Unless it is a life or death situation, the excuse shouldn&apos;t be good enough. &#xA0;Here is a generic excuse.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B54/sentence/B54S5.mp3\">I was working on three other assignments. &#xA0;I just couldn&apos;t finish them all.</a>&quot;<br><br>This is not a good excuse, so you can start reprimanding the employee. &#xA0;You gave them a chance to explain, and since the excuse wasn&apos;t good enough, you can basically, &apos;let them have it.&apos;<br>&#xA0;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B54/sentence/B54S6.mp3\">If you were not going to finish on time, at least you could have let me know. &#xA0;Regardless, you knew how important this project was and you knew about the due date. &#xA0;What am I going to do with you?</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B54/sentence/B54S7.mp3\">You should have at least told me that you wouldn&apos;t be able to finish. &#xA0;Then I could have asked Mary to finish it. &#xA0;This is very irresponsible of you. &#xA0;Is this going to be a continual problem in future projects?</a>&quot;\r\n"
}