{
    "categoryIndex": 2,
    "sectionIndex": 9,
    "title": "Talking to Direct - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=501",
    "lessonIndex": 432,
    "html": "<h1>Talking to Directs - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B54/practice/B54P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B54/practice/B54P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B54/practice/B54P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;John, are you going to complete the report on time?&quot;<br>B: &quot;I am confident that I will have it done by this Friday.&quot;<br>A: &quot;How far along are you?&quot;<br>B: &quot;I have completed the preliminary review, analyzed the data, and I am almost done writing the analytical review.&quot;<br>A: &quot;That&apos;s great. It looks like you are ahead of schedule. When you are done, send it to me for review.&quot;<br>B: &quot;I&apos;ll send it to you Friday morning. That should give you a day to review it.&quot;<br>A: &quot;That&apos;s great. Keep up the good work.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B54/practice/B54P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B54/practice/B54P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B54/practice/B54P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Can you give me an update on your assignments?&quot;<br>B: &quot;Yeah. I&apos;m helping with the performance testing, I&apos;ve met with the partners for the integration project, and I&apos;m finishing up the documents on the internal tool.&quot;<br>A: &quot;That&apos;s good. Can you start sending me a weekly report? That will help me keep track of your progress regularly.&quot;<br>B: &quot;No problem. Do you want it by the start of Monday, or do you want it Friday evening.&quot;<br>A: &quot;I&apos;m probably not going to read it until Monday, so just send it to me by Monday morning.&quot;<br>B: &quot;What do you want me to include in the weekly report?&quot;<br>A: &quot;Include what you did for the week, what you&apos;re going to do for the next week, and include any other issues you have.&quot;<br>B: &quot;I&apos;ll start doing that this week.&quot;<br>A: &quot;Great. Thanks.&quot;<br><br></td></tr><tr><td>3 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B54/practice/B54P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B54/practice/B54P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B54/practice/B54P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;John, can I see you in my office?&quot;<br>B: &quot;I&apos;ll be right over.&quot;<br>A: &quot;Have a seat... I&apos;m concerned about your performance lately. Is there something I should know about?&quot;<br>B: &quot;I&apos;ve been pretty occupied at home. I apologize for letting it affect work. I&apos;ll definitely pay more attention.&quot;<br>A: &quot;I understand, but I&apos;m still having to take some heat on your work. You have been late numerous times, your projects are not as detailed as it used to be, and you missed a deadline last week.&quot;<br>B: &quot;I am really sorry, and I won&apos;t let it happen again. I understand that I have been underperforming, and I will step it up.&quot;<br>A: &quot;I hope so. I&apos;ll explain it to the director. But I don&apos;t know how much more he will tolerate. That&apos;s all I had so you better go back to work.&quot;<br>B: &quot;Ok. I really will change things around. Thanks for understanding.&quot;<br></td></tr></table>"
}