{
    "lessonIndex": 443,
    "categoryIndex": 2,
    "sectionIndex": 12,
    "title": "Achievements",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=512",
    "html": "\r\n<h1>\r\nAchievements\r\n</h1>\r\nEveryone has certain responsibilities. &#xA0;You should use your responsibilities as a guide when you talk to your boss. &#xA0;The best way is to go through each responsibility and state how you successfully accomplished everything you were responsible for.<br><br>If you are a sales person, then the best metric is to use your sales number.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B63/sentence/B63S1.mp3\">I have exceeded the average for all sales categories. &#xA0;I was in the top 3 for renewals, I was second in accessory sales, and the most in new services. &#xA0;Overall, I was the first in our store and third in the whole region.</a>&quot;<br><br>If you are a computer engineer, then it will be a little different.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B63/sentence/B63S2.mp3\">I finished all my assignments on time, I fixed the most amount of code errors, I did code reviews on numerous occasion, and I created a program that helped the installation process. &#xA0;This ultimately reduced the installation time by 40%.</a>&quot;<br><br><b>Some General Statements</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B63/sentence/B63S3.mp3\">I feel I did a great job. &#xA0;I exceeded all my goals, and I made the most sales throughout the year.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B63/sentence/B63S4.mp3\">I am very happy with my performance over the year. &#xA0;I completed all my projects and I even took on three additional assignments. &#xA0;I also helped the junior employees on a regular basis.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B63/sentence/B63S5.mp3\">I&apos;m happy with my results. &#xA0;The project I have been working on was a success. &#xA0;During the process, I managed to overcome all obstacles and finished on time. &#xA0;We have increased our revenue while decreasing cost.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B63/sentence/B63S6.mp3\">I believe I am on track. &#xA0;This year I have learned a great deal. &#xA0;I am very familiar with all our tools and I even completed my first project successfully.</a>&quot;<br><br>These are general sentences you can say, but if you have a list of accomplishments, you should say them one by one in a paragraph. &#xA0;But make sure you speak clearly and slow enough so the other person can keep up.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B63/sentence/B63S7.mp3\">I have accomplished a great deal this year. &#xA0;I analyzed all monthly sales data, wrote up a thorough report for each one, I also created a process of submitting the report form that saved an hour for each report, I worked on four projects that were all successful, and I created a How-To document for new employees.</a>&quot;<br><br>This is long, but it is actually very simple. &#xA0;All I am doing is stating each thing right after the other. &#xA0;You should make a list and basically say them all together. &#xA0;It&apos;s effective and short.\r\n"
}