{
    "lessonIndex": 444,
    "categoryIndex": 2,
    "sectionIndex": 12,
    "title": "Self Improvement",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=513",
    "html": "\r\n<h1>\r\nSelf Improvement\r\n</h1>\r\nIf you are going to mention where you need improvement, it is very important to include how you are going to improve. &#xA0;This is similar to asking what is your weakness. &#xA0;If you mention a weakness, show them what steps you are taking to improve in that area. &#xA0;Finally, you must be certain it is ok to expose an area for improvement. &#xA0;I don&apos;t recommend doing this on your first review. &#xA0;After the first review, you will have a better idea if it will help to critique yourself.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B64/sentence/B64S1.mp3\">I feel I need to be more technical. &#xA0;I realized how important it is to know different computer applications. &#xA0;In order to improve, I have researched some classes I can take, and I even bought a couple of books. &#xA0;In the next 3 months, I am going to concentrate on learning these new tools.</a>&quot;<br><br>This is a good answer because it shows the manager that you are capable of finding your own faults. &#xA0;It also has a step by step process with a timeline on how you are going to improve.<br><br>Timeline is important because it shows that you are not going to procrastinate. &#xA0;If someone says, I&apos;m going to read this book, you don&apos;t know when they are going to read it. &#xA0;It is much better when someone says they will read this book within 2 weeks.<br><br>Here is one more example.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B64/sentence/B64S2.mp3\">An area I would like to improve is in planning. &#xA0;I plan all my work and I complete everything on time, but I feel if I do a better job at planning, I can be more efficient with my time. &#xA0;In order to work on this, I created a checklist of everything I should think about before starting a project. &#xA0;Using this checklist will make me think of potential obstacles that I wouldn&apos;t normally think about, verify that I am not forgetting something, and keep me on track to complete ahead of time. &#xA0;I am going to do this and see how much it improves my efficiency for the next 2 projects. &#xA0;Afterwards, I&apos;ll report how much it helped or didn&apos;t help.</a>&quot;\r\n"
}