{
    "categoryIndex": 2,
    "sectionIndex": 12,
    "title": "Compensation",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=514",
    "lessonIndex": 445,
    "html": "\r\n<h1>\r\nCompensation\r\n</h1>\r\nReviews are another time period where you get a raise and a bonus. &#xA0;If you work in a large company, then it will be hard to complain and get something changed. &#xA0;But if you work in a small company, you can ask for a larger raise. &#xA0;However, you must be in a position where the company will suffer if you leave the company. &#xA0;If you are replaceable, then the company doesn&apos;t have to give you a good raise. &#xA0;Just in case you are in one of these situations, here are some example sentences.<br><br>If you know you did more than anybody else, then here is a statement you can make to your manager.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B65/sentence/B65S1.mp3\">I have done more and better work than anybody else. &#xA0;I have learned everything on my own in the first three months without any training, and I have been a great employee. &#xA0;An 8 percent raise is not what I had in mind. &#xA0;I want a minimum 20 percent raise.</a>&quot;<br><br>If they agree with you, then they might give you a larger raise, but they will question the 20 percent raise. &#xA0;You should know the average pay in your field and use that as ammunition.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B65/sentence/B65S2.mp3\">I agree that you have performed well, but 20 percent is a large raise. &#xA0;Where did you get that number from?</a>&quot;<br><br>If you researched, then you can answer calmly with facts that your manager cannot disagree with.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B65/sentence/B65S3.mp3\">I have researched the pay for 5 different companies for someone with my experience and skill set. &#xA0;On average, they are being paid 25 percent more than me. &#xA0;I don&apos;t expect to get paid more than the other people because this is a smaller company, but I should get what I deserve and that is at least 20 percent.</a>&quot;<br><br>If you have to go on frequent business trips, then you can include that as well.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B65/sentence/B65S4.mp3\">The average pay for workers who have to go on frequent business trips is significantly higher than what I am being paid. &#xA0;There is no overtime pay here and all the extra work is not compensated for. &#xA0;I feel it is fair to get a larger raise due to the amount of quality work I do and the frequent business trips required for this position.</a>&quot;<br><br>Large companies have a process in place and most people will get a similar raise. &#xA0;If you get a small raise and you know you cannot fight for a larger raise, then you can at least ask what the average raise is.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B65/sentence/B65S5.mp3\">A three percent raise barely covers inflation. &#xA0;What was the average raise throughout the company?</a>&quot;<br><br>Most of the time, the answer will be very similar to what you got.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B65/sentence/B65S6.mp3\">I did very well this year and exceeded all my goals. &#xA0;Why am I only receiving a four percent raise?</a>&quot;<br><br>Sometimes even great employees will get a small raise in a large company. &#xA0;It might seem small, but if the company is struggling financially, they might not give anybody raises. &#xA0;Here is an example of what you might hear for the question above.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B65/sentence/B65S7.mp3\">You actually got the maximum raise this year. &#xA0;Most of the people didn&apos;t get anything. &#xA0;Some people got a two percent raise. &#xA0;So you should actually be happy with your raise. &#xA0;The economy is down and the company needs to save money. &#xA0;They can&apos;t give large raises this year.</a>&quot;\r\n"
}