{
    "lessonIndex": 446,
    "categoryIndex": 2,
    "sectionIndex": 12,
    "title": "Performance Review - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=515",
    "html": "<h1>Performance Review - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B65/practice/B65P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B65/practice/B65P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B65/practice/B65P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;It&apos;s that time of year again.&quot;<br>B: &quot;Yeah. I always get nervous during this time.&quot;<br>A: &quot;It shouldn&apos;t go too bad.&quot;<br>B: &quot;So, how did I do this year?&quot;<br>A: &quot;Let me first ask you how you feel about your performance?&quot;<br>B: &quot;I think I improved a lot and made a lot of great contributions. I completed all my assignments ahead of schedule, I volunteered for two more extra projects, and mentored couple of our newer employees.&quot;<br>A: &quot;I agree. You did great this year. I got your rating back from upper management and it&apos;s not bad, but it&apos;s not the best. You received a 3.5, a 4 percent raise, and an 8 percent bonus.&quot;<br>B: &quot;I got a 3.5? Why? I was really expecting a 4 this year. I really worked hard.&quot;<br>A: &quot;Unfortunately, we can&apos;t give everyone a 4. There were a lot of people who did great this year and we only had a few 4&apos;s to give. You barely missed the cut.&quot;<br>B: &quot;What could I have done to get a 4? I thought I did everything to deserve one.&quot;<br>A: &quot;I agree. I think you should have received a four, but the only thing I can suggest is for you to be more visible. The people who beat you this year didn&apos;t necessarily do better work than you, it&apos;s just that people knew the work they were doing more than yours. You need to stand out a little better.&quot;<br>B: &quot;How do I do that? It doesn&apos;t make sense. If I work my ass off and I do great work, why does it matter if I show off or not?&quot;<br>A: &quot;If 3 people are equal in their work, the only deciding factor is how much of the work they know about. Since upper management cannot know the details of everything, they mainly see the people who are visible. You can do this by taking on projects that affect the whole team so everyone can see, or you can be pro-active in finding places for improvements and sending out a mail to management with your ideas.&quot;<br>B: &quot;If I did a great job, why did I only get a 4 percent raise?&quot;<br>A: &quot;You got a high raise comparing to other people. The average raise throughout the company was 2 percent. They cut back a lot on raises due to the slow economy.&quot;<br>B: &quot;I&apos;m a little disappointed, I&apos;ll see you tomorrow.&quot;<br>A: &quot;Ok. Think about what I said and we&apos;ll try to give you more assignments with more visibility.&quot;<br></td></tr></table>"
}