{
    "categoryIndex": 2,
    "sectionIndex": 13,
    "title": "Negotiating before Leaving",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=517",
    "lessonIndex": 448,
    "html": "\r\n<h1>\r\nNegotiating before Leaving\r\n</h1>\r\nReceiving a job offer is another way to negotiate a salary increase or a position change. &#xA0;If you are a great employee then your current employer might try to entice you to stay. &#xA0;If you are willing to stay, you can say that you received another offer and you are still thinking about it. &#xA0;If they try to make you stay, you can state what it will take for you to stay.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B67/sentence/B67S1.mp3\">Hi Mark, I am at a crossroad in my career. &#xA0;I have recently interviewed with a different company and they extended an offer to me. &#xA0;I haven&apos;t decided yet, but I wanted to tell you before coming to a decision.</a>&quot;<br><br>If at this time they ask you to stay, then you can ask for a couple of things.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B67/sentence/B67S2.mp3\">If I didn&apos;t like this company, it would be an easy decision, but I really like it here. &#xA0;However, I have been asking to take on Program Management responsibilities here. &#xA0;Also, they are offering me a 6 percent higher salary than my current pay. &#xA0;Can anything be done about these two things?</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B67/sentence/B67S3.mp3\">Hi Mark, I have been thinking about moving back to my home town. &#xA0;I have a job lined up, but I haven&apos;t decided yet. &#xA0;I wanted to let you know before I make my final decision.</a>&quot;<br><br>If they ask you to stay, you can say the following, but if they don&apos;t ask you to stay, then it is useless.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B67/sentence/B67S4.mp3\">Well, they are offering me a higher salary. &#xA0;It&apos;s 7 percent higher than my current salary. &#xA0;Would it be possible for you guys to match this?</a>&quot;\r\n"
}