{
    "lessonIndex": 452,
    "categoryIndex": 3,
    "sectionIndex": 0,
    "title": "What are your strengths?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=260",
    "html": "\r\n<h1>\r\nWhat are your strengths?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I2/sentence/I2S1.mp3\">What are your strengths?</a>&quot;</b><br><br>This is a popular interview question. &#xA0;They want to know what you think of yourself. &#xA0;Although this is a general question, there is a wrong and right answer. &#xA0;The wrong answer is a generic answer saying you are organized and friendly. &#xA0;Although it will not hurt you during the interview, it will certainly not help you either. &#xA0;Answer this question based on the type of job you are applying for.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I2/sentence/I2S2.mp3\">I believe my strongest trait is my attention to detail. &#xA0;This trait has helped me tremendously in this field of work.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I2/sentence/I2S3.mp3\">I&apos;ve always been a great team player. &#xA0;I&apos;m good at keeping a team together and producing quality work in a team environment.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I2/sentence/I2S4.mp3\">After having worked for a couple of years, I realized my strength is accomplishing a large amount of work within a short period of time. &#xA0;I get things done on time and my manager always appreciated it.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I2/sentence/I2S5.mp3\">My strongest trait is in customer service. &#xA0;I listen and pay close attention to my customer&apos;s needs and I make sure they are more than satisfied.</a>&quot;<br><br><b>Long Answers</b><br><br>Let&apos;s say I am interviewing for a management position. &#xA0;You should mention traits that are important for managers.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I2/sentence/I2S6.mp3\">A couple strengths I have are planning and execution, and working with people. &#xA0;I&apos;ve always been very good at planning and detailing all the steps. &#xA0;Even in college, I would spend time organizing my week and planning a strategy to tackle each class or assignment. &#xA0;Executing a plan has always come easy for me as well. &#xA0;I believe it&apos;s due to proper planning. &#xA0;I also work with people very well in a way where I use the strengths of each individual in a team to produce the best results. &#xA0;Because of my easy going personality, I&apos;ve been told by my directs that it&apos;s easy to approach me.</a>&quot;<br><br>If you are applying for an accounting position, you should mention strong traits an accountant should have and claim them to be yours.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I2/sentence/I2S7.mp3\">I&apos;m very detail oriented, good at managing time, and very honest. &#xA0;I always incorporate managing time and being detailed together. &#xA0;By nature I&apos;ve been detail oriented, and that resulted in taking too much time on a particular task. &#xA0;After incorporating time management into the mix, I found that my work and efficiency increased dramatically. &#xA0;I plan better and produce higher quality work in a time constraint environment. &#xA0;Finally, I&apos;m a very honest person. &#xA0;When I was working as a valet attendant during college, a lady gave me a twenty dollar bill to pay for the three dollar fee. &#xA0;She almost drove off the lot, but I stopped her and said here is your change. &#xA0;My co-workers said I should have considered the change as tip, but I know what I did was honest and right. &#xA0;You can fool other people, but you can&apos;t fool yourself. &#xA0;That&apos;s what I believe.</a>&quot; <br><br>The second example can seem a little wordy. &#xA0;But the power of an example is greater than any great words you can string together. &#xA0;Everyone can claim they are honest, but with an example, it is much more believable.\r\n"
}