{
    "lessonIndex": 454,
    "categoryIndex": 3,
    "sectionIndex": 0,
    "title": "What are your short term goals?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=264",
    "html": "\r\n<h1>\r\nWhat are your short term goals?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I4/sentence/I4S1.mp3\">What are your short term goals?</a>&quot;</b><br><br>This question primarily depends on where you are in your career. &#xA0;A person with 5 years of experience will have different short term goals than a person with no work experience. &#xA0;I&apos;ll give an example for both scenarios. &#xA0;But first, here are some short answers.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I4/sentence/I4S2.mp3\">My short term goal is to find a position where I can use the knowledge and strengths that I have. &#xA0;I want to partake in the growth and success of the company I work for.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I4/sentence/I4S3.mp3\">I&apos;ve learned the basics of marketing during my first two years. &#xA0;I want to take the next step by taking on challenging projects. &#xA0;My short term goal is to grow as a marketing analyst.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I4/sentence/I4S4.mp3\">As a program manager, it&apos;s important to understand all areas of the project. &#xA0;Although I have the technical abilities to be successful in my job, I want to learn different software applications that might help in work efficiency.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I4/sentence/I4S5.mp3\">My goal is to always perform at an exceptional level. &#xA0;But a short term goal I have set for myself is to implement a process that increases work efficiency.</a>&quot;<br><br><b>Long Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I4/sentence/I4S6.mp3\">My short term goal is to learn everything I can about marketing. &#xA0;I want to find a position where I can contribute what I&apos;ve learned through education and to gain real life experience. &#xA0;I believe the next couple of years will be very important to me and my immediate goal is to learn and become skilled in all aspects of marketing.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I4/sentence/I4S7.mp3\">My short term goal is to get into a management position. &#xA0;The last five years of my career, I&apos;ve concentrated on learning and acquiring all the skills needed to perform excellent work. &#xA0;Recently, I&apos;ve taken more responsibilities in management because I eventually want to become a sales manager. &#xA0;I&apos;m excited about the last few assignments I completed because it involved working with vendors and partners while managing a small group of workers. &#xA0;So I hope to be in a management position within a year or two and I feel I&apos;m doing a diligent job by volunteering for extra work to gain more experience.</a>&quot;<br><br>The first example is a person straight out of school. &#xA0;Learning is a good short term goal to have because it shows that you will be trying hard in your job. &#xA0;The second example is more detailed because that person has several years of experience. &#xA0;Anybody can say they want a management position, but this candidate is taking it a step further by showing the steps he is taking to achieve the short term goal. &#xA0;Thus, it becomes a stronger answer.\r\n"
}