{
    "lessonIndex": 458,
    "categoryIndex": 3,
    "sectionIndex": 0,
    "title": "What does success mean to you?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=267",
    "html": "\r\n<h1>\r\nWhat does success mean to you?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I8/sentence/I8S1.mp3\">What does success mean to you?</a>&quot;</b><br><br>There are many things you can say. &#xA0;This type of question doesn&apos;t have a wrong answer. &#xA0;All answers will be correct. &#xA0;So the best answer is how good you can make the answer. &#xA0;A mediocre answer will be something like completing a project on time. &#xA0;You can say this, but add another twist to make the answer a little better. &#xA0;Here is an example.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I8/sentence/I8S2.mp3\">To me, success means to have a goal, plan the steps to achieve the goal, implement the plan, and finally achieve the goal.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I8/sentence/I8S3.mp3\">Success means to achieve a goal I have set for myself.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I8/sentence/I8S4.mp3\">Success means to produce high quality work before the deadline.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I8/sentence/I8S5.mp3\">Success to me is knowing that my contributions positively impacted my company.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I8/sentence/I8S6.mp3\">Success to me means completing a task and when looking back, thinking I couldn&apos;t have done it better. &#xA0;To succeed is to complete a task or assignment on time in an excellent manner. &#xA0;But that&apos;s only half of it. &#xA0;The results should be good and the people involved should gain a valuable lesson or experience. &#xA0;For example, if it was a group project, and only two people out of four really did the work, I wouldn&apos;t call that success. &#xA0;If everyone participated and worked together providing a valuable deliverable then it&apos;s a success. &#xA0;So I think both the result and the process should be great to call something a success.</a>&quot;<br><br>This answer is showing that you believe in delivering great quality work. &#xA0;Moreover, it is implying how much you value team work. &#xA0;If you value teamwork highly, then it is safe to assume that you would make a great team player.\r\n"
}