{
    "categoryIndex": 3,
    "sectionIndex": 0,
    "title": "In what ways are you organized and disorganized?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=270",
    "lessonIndex": 461,
    "html": "\r\n<h1>\r\nIn what ways are you organized and disorganized?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I11/sentence/I11S1.mp3\">In what ways are you organized and disorganized?</a>&quot;</b><br><br>This is another variation to the previous question. &#xA0;This question is a little better because the question wants you to identify an area you are disorganized. &#xA0;Make sure to emphasize the organized portion of the answer. &#xA0;If you are truly an organized person, then it is really tough thinking about an area you are disorganized. &#xA0;So thinking ahead of time will allow you to make a good impression with a solid answer.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I11/sentence/I11S2.mp3\">I&apos;m very organized with my time and work, but my desk is a little disorganized.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I11/sentence/I11S3.mp3\">Since I work with many files, I like to keep my desk organized. &#xA0;I always have everything in a certain place so I can find things easier. &#xA0;The area I&apos;m disorganized is probably my computer desktop. &#xA0;I usually have so many icons everywhere. &#xA0;I should organize it a little, but I&apos;ve never needed to.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I11/sentence/I11S4.mp3\">I organize my schedule the best. &#xA0;I&apos;m used to many meetings so it&apos;s important for me to be organized with my schedule and time. &#xA0;The area I need to improve is probably my file cabinet. &#xA0;I started to sort things alphabetically, but when I&apos;m busy, I start putting things in there. &#xA0;It started getting hard to find things, but this is something I&apos;m going to fix.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I11/sentence/I11S5.mp3\">Oh... that&apos;s a good question. &#xA0;Well, I&apos;m organized in almost everything I do. &#xA0;I&apos;m very organized with my schedule and time. &#xA0;I like to work efficiently, and being organized with my time helps me. &#xA0;The area I feel I&apos;m disorganized is probably my desk. &#xA0;I like to work fast and don&apos;t keep my desk area as tidy as some people I know. &#xA0;This however doesn&apos;t prevent me from doing my job well. &#xA0;You know some people can have files and paper all over their desk but some how know exactly where everything is located. &#xA0;I think I&apos;m one of those people. &#xA0;However, if I know I&apos;m having a client or a guest, then I would definitely make things more tidy.</a>&quot;<br><br>This answer brings a little humor to the question. &#xA0;It lightens the mood and makes a person seem real instead of appearing to be perfect. &#xA0;However, if the job you are applying for requires constant customer interaction, then this answer will not be good. &#xA0;This answer would be better for an office job where not many people will see your desk.\r\n"
}