{
    "lessonIndex": 463,
    "categoryIndex": 3,
    "sectionIndex": 0,
    "title": "How do you handle change?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=272",
    "html": "\r\n<h1>\r\nHow do you handle change?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I13/sentence/I13S1.mp3\">How do you handle change?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I13/sentence/I13S2.mp3\">Are you good at dealing with change?</a>&quot;</b><br><br>Dealing with change is common in the work place. &#xA0;A simple yes will not be sufficient to impress the interviewer. &#xA0;This is another type of question where everyone will have similar answers. &#xA0;Of course everyone is going to claim being excellent dealing with change. &#xA0;You got to communicate that you are really good at dealing with change. &#xA0;Here are some examples for you.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I13/sentence/I13S3.mp3\">I&apos;m good at dealing with change because I&apos;m a quick thinker. &#xA0;If new information makes us change our marketing strategy for example, I&apos;ll be quick to analyze the information and create a plan to make the changes.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I13/sentence/I13S4.mp3\">I&apos;ve experienced many changes previously. &#xA0;I handle the situation by quickly coming up to speed on the changes and applying myself to make them a success.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I13/sentence/I13S5.mp3\">I&apos;m good at dealing with change because I&apos;m flexible with my work and abilities. &#xA0;I&apos;m not afraid of learning new and difficult things. &#xA0;Whenever I&apos;m faced with a change, I&apos;ll put in extra effort to make the change a smooth transition.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I13/sentence/I13S6.mp3\">I handle changes smoothly. &#xA0;Whenever there&apos;s a change of any sort, I analyze the situation and I always try to find ways I can contribute to the change in a positive way.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I13/sentence/I13S7.mp3\">I believe dealing with change is a requirement in the workplace. &#xA0;The mission statement can change to introduce a new market segment, or the company might need to change direction. &#xA0;Whatever it is, as a member of this team, I would be expected to do my share by absorbing the new information, analyzing it thoroughly, sharing my ideas, and really being a valued team member. &#xA0;Dealing with change is a necessary trait. &#xA0;I think I&apos;m also good at anticipating change by being attentive and observant.</a>&quot;<br><br>Overall, this is a good answer. &#xA0;The last statement is a bold statement of being able to anticipate change. &#xA0;If the interviewer is impressed, they might follow up by asking for an example of how you anticipate change. &#xA0;If you use an answer like I provided, make sure you have an example. &#xA0;If you don&apos;t have one, then the answer you gave will be seen as a lie and you probably failed.\r\n"
}