{
    "categoryIndex": 3,
    "sectionIndex": 0,
    "title": "How do you make important decisions?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=273",
    "lessonIndex": 464,
    "html": "\r\n<h1>\r\nHow do you make important decisions?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I14/sentence/I14S1.mp3\">How do you make important decisions?</a>&quot;</b><br><br>There are many ways to answer this question, and if you have a reasonable method of making decisions, it will probably be sufficient. &#xA0;One answer I thought of included not being afraid of asking your manager. &#xA0;You can follow up by saying even the best needs mentoring, and you always want to improve. &#xA0;So basically, this could work as an answer, but depending on the job, you might have a better shot with an answer like my example.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I14/sentence/I14S2.mp3\">I make important decisions by examining all the details and then weighing the pro&apos;s and con&apos;s for each decision.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I14/sentence/I14S3.mp3\">I gather all the information I can find and based on the information, I&apos;ll come to the best decision I can. &#xA0;If I know a coworker was in a similar situation, I wouldn&apos;t hesitate to find out the results to make sure my decision is the best one.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I14/sentence/I14S4.mp3\">I believe all decisions should be made by having all the information. &#xA0;If you are missing an important detail, it&apos;s easy to make a bad decision. &#xA0;So I make important decisions by having all of the information.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I14/sentence/I14S5.mp3\">Important decisions are made by knowledge through information and wisdom through experience. &#xA0;I&apos;ll gather all the information I can find and then apply my experience while analyzing the information. &#xA0;With this combination, I&apos;m confident I&apos;ll make the correct important decisions.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I14/sentence/I14S6.mp3\">I think all decisions are important, and having as much information about the decision is one of the most important aspects. &#xA0;After examining all the facts, I would think about the outcome and consequences of each action and after weighing the pro&apos;s and con&apos;s, I would come to the best decision possible. &#xA0;However, I&apos;m aware that some decisions are not as black and white. &#xA0;In this situation, I would rely on my experience, or even work with my team members to come up with the best decision.</a>&quot;<br><br>This is a decent answer, but I think you might be able to think of a better one. &#xA0;Feel free to be creative with your answers because those are the answers the interviewer will remember the most.\r\n"
}