{
    "lessonIndex": 465,
    "categoryIndex": 3,
    "sectionIndex": 0,
    "title": "Do you work well under pressure?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=274",
    "html": "\r\n<h1>\r\nDo you work well under pressure?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I15/sentence/I15S1.mp3\">Do you work well under pressure?</a>&quot;</b><br><br>In most cases, the best answer to this question is answering yes. &#xA0;Working well under pressure is a good trait to have. &#xA0;However, I think if you answer that you work the same with pressure and without pressure, the interviewer will be more impressed. &#xA0;However, you will need to explain in words why this is better. &#xA0;Here are some of my answers.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I15/sentence/I15S2.mp3\">I work well under pressure because I use the pressure to help me work more efficiently.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I15/sentence/I15S3.mp3\">I enjoy working under pressure because I believe it helps me grow. &#xA0;In my previous experience, I always worked well during deadlines, and I always learned how to work more efficiently afterwards.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I15/sentence/I15S4.mp3\">I work well under pressure because I don&apos;t panic. &#xA0;I maintain self control and work as efficiently as possible. &#xA0;In all my experiences, I did well and I always enjoyed the experience.</a>&quot;<br><br><b>Long Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I15/sentence/I15S6.mp3\">To tell you the truth, I think I work the same if there&apos;s pressure or if there&apos;s no pressure. &#xA0;I try and take out negative emotional factors and work hard regardless of down time or busy time. &#xA0;I always prioritize and organize my work, and from there, work efficiently. &#xA0;If the situation involved pressure due to a lack of time, then the only difference in my work would be the extra time I would need to put in to meet the deadline on time. &#xA0;Since I believe my normal work is great work, then I suppose I work well under pressure.</a>&quot;<br><br>I like this answer because it is different than the standard answer. &#xA0;If you are not comfortable with this answer, then you can use the next one.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I15/sentence/I15S7.mp3\">I have a couple of friends who hate working under pressure. &#xA0;I don&apos;t know if it&apos;s odd, but I really enjoy working under pressure. &#xA0;I use the feelings of pressure as a tool to motivate me to work harder and more efficiently. &#xA0;In my last job, I remember we had a project to complete in 4 days where it usually took 10 days. &#xA0;There was a lot of panic by some team members, but I ensured everyone that if we concentrate on the task and work real hard, we can complete the project. &#xA0;It took a lot of overtime, and the last day we were in the office until two AM, but we managed to finish. &#xA0;It was hard work, but I really enjoyed that experience.</a>&quot;<br><br>You might not have experienced this example before, but what is preventing you from making something up? &#xA0;To tell you the truth, I never experienced it before either. &#xA0;There are some things you shouldn&apos;t lie about because they can find out about it such as your GPA or what school you attended, but a story such as the one I included above cannot be verified by the interviewer. &#xA0;The only thing you have to be careful about is being able to answer follow up questions.\r\n"
}