{
    "categoryIndex": 3,
    "sectionIndex": 1,
    "title": "Are you better at anticipating or reacting to problems",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=275",
    "lessonIndex": 466,
    "html": "\r\n<h1>\r\nAre you better at anticipating or reacting to problems\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I16/sentence/I16S1.mp3\">Which category do you fall under? &#xA0;A person who anticipates a problem well, or a person who reacts to a problem well?</a>&quot;</b><br><br>This is a tough question because both options look pretty good. &#xA0;My recommendation would be to answer depending on the position you are applying for. &#xA0;For example, if you are applying for a type of analyst or upper management position, then anticipating a problem would be more useful. &#xA0;However, if you are applying to be a nurse for a hospital emergency room, then reacting to a problem well is stronger.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I16/sentence/I16S2.mp3\">I think it&apos;s good to be good at both. &#xA0;But in my experience, I realized I react to problems better. &#xA0;Whenever I&apos;m faced with a new problem, I know what steps to take to deal with the problem.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I16/sentence/I16S3.mp3\">I believe I&apos;m strong in both, but I try to work more on anticipating problems. &#xA0;In this profession, it&apos;s very important to anticipate a problem and fix it before it becomes a real problem.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I16/sentence/I16S4.mp3\">I&apos;m very observant and aware of what&apos;s going on, so I&apos;m stronger at anticipating problems.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I16/sentence/I16S5.mp3\">I&apos;m good at dealing with problems, so I&apos;m a person who reacts to a problem well.</a>&quot;<br><br><b>Long Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I16/sentence/I16S6.mp3\">I feel I react to problems well, but I&apos;m much stronger at anticipating them. &#xA0;I&apos;m a type of person that pays attention to detail, inconsistencies, and subtle signs. &#xA0;Basically, I want to find a potential problem and put measures in place to correct it before it happens. &#xA0;It&apos;s interesting to see how the people who deal with problems get rewarded for resolving the issue. &#xA0;What about the people who put the fire out before it even started? &#xA0;So anticipating problems before it happens is what I&apos;ve always done and I believe it&apos;s important in any work environment.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I16/sentence/I16S7.mp3\">Being a nurse requires many skills. &#xA0;One of the important traits is to be able to react to problems well. &#xA0;Reacting to a problem well requires the ability for quick thinking, ability to think of all the options available, and maintaining self control in hectic times. &#xA0;In my spare time, I even think about creative problems that might come up. &#xA0;Since a problem can arise at any time and in any form, I try to be as creative as I can and I walk through the situation as if I&apos;m dealing with the problem. &#xA0;So this has helped me to become very good at reacting to problems.</a>&quot;<br><br>The answer gets stronger with examples, so if you have experienced something that you can explain, feel free to use include it in the answer. &#xA0;Also, if you are unsure about how to say it, remember that you can ask us.\r\n"
}