{
    "categoryIndex": 3,
    "sectionIndex": 1,
    "title": "Why should I hire you?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=277",
    "lessonIndex": 468,
    "html": "\r\n<h1>\r\nWhy should I hire you?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I18/sentence/I18S1.mp3\">Why should I hire you?</a>&quot;</b><br><br>I don&apos;t know if this is a common question, but I heard many people use this question. &#xA0;In all the interviews I&apos;ve been through, I never received this question, nor did I ask this question in any interviews I gave. &#xA0;But, there are a lot of people asking this question, so preparing for it is a must. &#xA0;To answer this question, you need to know exactly what they are looking for. &#xA0;With this information, tie it in with your strong traits. &#xA0;This will verify that you are completely qualified for the job. &#xA0;Second and more importantly, you need to stand out more than the other people interviewing for this position. &#xA0;I will give two examples for the long answers, one for a person with a lot of experience, and the other for a recent college graduate.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I18/sentence/I18S2.mp3\">I&apos;m a perfect fit for this position. &#xA0;I have the experience and the traits you are looking for. &#xA0;On top of that, I&apos;m a great team player that gets a long with everyone.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I18/sentence/I18S3.mp3\">I should be hired because I&apos;m efficient, smart, and friendly. &#xA0;I&apos;m great at solving problems and love challenges. &#xA0;Most importantly, I&apos;m dependable and reliable.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I18/sentence/I18S4.mp3\">There are two reasons I should be hired. &#xA0;First, my qualifications match your needs perfectly. &#xA0;Second, I&apos;m excited and passionate about this industry and will always give 100%.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I18/sentence/I18S5.mp3\">You should hire me because I&apos;m confident and I&apos;ll do the best job. &#xA0;I have a proven track record of success starting from high school until now. &#xA0;I&apos;m responsible and smart. &#xA0;<br>This position requires someone that will work well without supervision. &#xA0;I know how to manage my time and organize my work well. &#xA0;So, I&apos;m confident I&apos;ll be the best candidate for this position.</a>&quot;<br><br><b>Long Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I18/sentence/I18S6.mp3\">This position is for a quality assurance manager, I&apos;m confident I&apos;m the best person for this job because of my past experience. &#xA0;At ABC Software Company, I was in charge of a team that was responsible for the quality of three different applications. &#xA0;I have intimate knowledge of quality assurance, product support, and even some creative processes that will benefit a quality assurance team. &#xA0;I&apos;ve built a team from scratch and fully understand the product development cycle. &#xA0;Finally, one of my traits is in developing and mentoring junior employees. &#xA0;I believe in transferring knowledge to everyone in the company and investing a little more effort into the people who work for me. &#xA0;So I strongly believe that I&apos;ll be the best candidate due to the combination of my experience, my managerial skills, and my desire to provide growth in employees.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I18/sentence/I18S7.mp3\">The reason I applied for this position is because the qualifications matched my strengths perfectly. &#xA0;I&apos;m good at juggling multiple tasks, I&apos;m very detail oriented, and I organize my time very efficiently. &#xA0;But the truth is that many people have these traits. &#xA0;But if I were in your position, I would hire myself because of the passion I have for this industry, and my optimistic personality. &#xA0;My education background and my strengths show that I can do this job. &#xA0;But I want to make more of an impact than just doing my job. &#xA0;I don&apos;t want to blend in with the company, I would rather want my addition to improve it.</a>&quot;<br><br>The first answer is using experience and skills to convince the interviewer to hire him or her. &#xA0;In addition to talking about past experiences, this example also emphasizes the strong ability to mentor people. &#xA0;The second example is more on the personal level and definitely more creative. &#xA0;Everyone one will claim to have all the good traits. &#xA0;So this candidate says it by saying, &quot;... the truth is that many people have these traits.&quot; &#xA0;On top of these traits, this candidate is including passion and excitement. &#xA0;This is very important during interviews. &#xA0;Finally, the last sentence is a good line that the interviewer will remember. &#xA0;It is creative and bold.\r\n"
}