{
    "categoryIndex": 3,
    "sectionIndex": 1,
    "title": "Tell me about a time you made a good decision.",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=279",
    "lessonIndex": 470,
    "html": "\r\n<h1>\r\nTell me about a time you made a good decision.\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I20/sentence/I20S1.mp3\">Tell me about a time you made a good decision.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I20/sentence/I20S2.mp3\">Tell me about a time you found a solution to a problem.</a>&quot;</b><br><br>This is a little easier than thinking about a mistake. &#xA0;You should make sure to include why it was a good decision and the result should be obviously meaningful. &#xA0;I also want to use this as an example of answering multiple questions. &#xA0;I would use this same answer for either of the two questions above. &#xA0;It was a good decision, and I fond a solution to a problem. &#xA0;Preparing for every interview question in the world will be too much work. &#xA0;Think of key experiences and apply them to multiple answers. &#xA0;In the case where it is the same interviewer, then you might be forced to think of a new answer. &#xA0;So it might be good to think of couple of answers.<br><br><b>Short Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I20/sentence/I20S3.mp3\">During my last project, we ran into a difficult problem. &#xA0;This was high priority so everyone was instructed to find a solution. &#xA0;I started looking for more information on the Internet, I even talked to a different manager on a different team. &#xA0;This helped tremendously and our problem was solved. &#xA0;I made a decision to use every resource I could find, and in the end, it solved the problem.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I20/sentence/I20S4.mp3\">In my last position at Microsoft, there was a time period where our group was going to slip reaching our milestone by one day. &#xA0;This was because the day before exiting the third milestone, we found a problem in the program. &#xA0;Since we created a new build with all bug fixes each morning, we had two choices. &#xA0;We could either fix the problem and verify the program the next day after we build again, or we could postpone the problem and fix it in the next milestone. &#xA0;Both options didn&apos;t sound very appealing. &#xA0;I suggested fixing the program now, and perform another build to verify the fix instead of waiting for tomorrow. &#xA0;Many times people are used to following a process, but in this case, I challenged the process of building in the morning and requested another build to verify the last bug fix. &#xA0;In the end, we were able to complete milestone 3 on time and fixed the important problem. &#xA0;This was significant because if we didn&apos;t exit milestone 3, then everyone waiting to start work on the next milestone would have to wait another day. &#xA0;In essence, this saved a days work for more than 30 people.</a>&quot;<br><br>For this example, I was careful not to use too many technical jargons that might not be understood. &#xA0;I also explained the situation carefully and explained why the decision was a good one. &#xA0;Remember that some of these answers will not work for you. &#xA0;In this case, if you never worked at Microsoft and never experienced this, just follow the steps of stating the problem, explaining the choices, why you made the decision, and finally why it was a good decision.\r\n"
}