{
    "lessonIndex": 471,
    "categoryIndex": 3,
    "sectionIndex": 1,
    "title": "Tell me about a time you made a poor decision.",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=280",
    "html": "\r\n<h1>\r\nTell me about a time you made a poor decision.\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I21/sentence/I21S1.mp3\">Tell me about a time you made a poor decision.</a>&quot;</b><br><br>This question is similar to the mistake question. &#xA0;So first, let&apos;s think about what lesson we want to learn. &#xA0;A common mistake is when people make assumptions. &#xA0;I&apos;ll give an example where a poor decision was made due to making a bad assumption. &#xA0;The answer will also include what was learned and how the poor decision was used as a tool to become a better worker.<br><br><b>Short Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I21/sentence/I21S2.mp3\">When I was doing an audit for a small company, there was a problem with one of the accounts. &#xA0;I tried to contact the company to ask questions, but they were not there. &#xA0;I made the decision to keep looking for the answer. &#xA0;Four hours later, they returned my call and I realized it was a simple typo. &#xA0;I wasted 4 hours of my day. &#xA0;In this case, I was too sensitive about detail. &#xA0;So I learned how not to be so detailed and picky.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I21/sentence/I21S3.mp3\">In my first month working at Tiffany&apos;s selling jewelry, I made a poor decision by making an assumption. &#xA0;A person buying an engagement diamond wanted to see some rings. &#xA0;It&apos;s not polite to immediately ask for a price range, so I showed the person a variety of rings. &#xA0;He pointed to a ring that was about twelve thousand dollars. &#xA0;The diamond ring he pointed to was one of the more expensive ones I showed him. &#xA0;Eager to sell him the ring, I explained the quality of the ring, explained our satisfaction guarantee policy to him, and made sure he was comfortable with making a purchase at Tiffany&apos;s. &#xA0;He bought the ring, and I thought I made a great sell. &#xA0;However, it turns out that on my day off, he came in and exchanged the ring for one that was twenty five thousand dollars. &#xA0;It was one of the rings that I didn&apos;t show him. &#xA0;So basically, I made a bad decision on selling him what he first pointed out instead of showing him more options. &#xA0;I assumed that the initial ring he selected was the price range he was looking for. &#xA0;I never made that mistake again and I learned that I shouldn&apos;t assume so much.</a>&quot;<br><br>This example is geared towards sales, but like I said earlier, make sure to clearly explain the situation, identify the decisions, explain why it was a bad decision, and most importantly what you learned by making a poor decision.\r\n"
}