{
    "categoryIndex": 3,
    "sectionIndex": 1,
    "title": "Tell me about a time you failed to complete an assignment on time.",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=283",
    "lessonIndex": 474,
    "html": "\r\n<h1>\r\nTell me about a time you failed to complete an assignment on time.\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I24/sentence/I24S1.mp3\">Tell me about a time you failed to complete an assignment on time.</a>&quot;</b><br><br>If you are a good worker, then you probably haven&apos;t failed to complete an assignment on time. &#xA0;But if you have a lot of experience, you might have some situations where external factors caused you to miss a deadline. &#xA0;This is what my example will be about. &#xA0;But if you have an example where you failed to complete an assignment, make sure you give clear reasons why you failed and what you learned from it. &#xA0;Also, if you can&apos;t think of any, then use an example from your university days stating. &#xA0;But if you do, make sure you tell them that so far in your job experience, you completed all assignments on time or ahead of schedule.<br><br><b>Short Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I24/sentence/I24S2.mp3\">One time, I had a project that was due on Tuesday. &#xA0;On Friday I analyzed our progress and I was ahead of schedule. &#xA0;I didn&apos;t have to work over the weekend to complete the assignment. &#xA0;On Monday, my manager was sick so I had to attend several meetings that took all day. &#xA0;Because of that, I didn&apos;t complete my assignment until Wednesday. &#xA0;Now, I try to finish my assignments a day or half a day early because something unexpected could come up.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I24/sentence/I24S3.mp3\">With proper planning and good execution, I think it&apos;s hard to fail at meeting a deadline. &#xA0;But I remember one time in the middle of the project, our clients wanted to change one aspect of the assignment that we already completed. &#xA0;I analyzed the change request and told them that we wouldn&apos;t be able to make the date. &#xA0;I estimated that it will take three additional days. &#xA0;They insisted that we finish on the agreed upon time schedule. &#xA0;I told them we&apos;d try but could not promise anything. &#xA0;Even with hard work and overtime, we missed the due date. &#xA0;We did however, finish one day late. &#xA0;In this situation where I didn&apos;t feel we could reach the deadline, I specifically told them that we couldn&apos;t, I continually sent updates on the progress to keep the clients informed. &#xA0;Since we missed the deadline, they were not too happy, but overall they were satisfied because I effectively communicated the progress regularly.</a>&quot;<br><br>I like this answer because they want a situation that should make you look bad. &#xA0;Instead, you gave them a scenario where you failed to complete an assignment, but really it wasn&apos;t your fault. &#xA0;In the end, this answer makes you look good because you did everything right from communicating properly, giving them a new time frame, and reaching the goal two days ahead of schedule despite missing the original date by one. &#xA0;But just in case they ask what you could have done better, you can say something like, &quot;<a href=\"http://www.talkenglish.com/AudioTE1/I24/sentence/I24S4.mp3\">I feel I should have been more firm with the three additional days I requested. &#xA0;I like to meet difficult deadlines, but I knew the additional work was too large to finish on time.</a>&quot;\r\n"
}