{
    "lessonIndex": 476,
    "categoryIndex": 3,
    "sectionIndex": 1,
    "title": "Tell me about a time you aimed too high.",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=285",
    "html": "\r\n<h1>\r\nTell me about a time you aimed too high.\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I26/sentence/I26S1.mp3\">Tell me about a time you aimed too high.</a>&quot;</b><br><br>This is another question where you can turn this answer into a good experience. &#xA0;I am going to be using the answer as the one where you failed to complete an assignment on time. &#xA0;This is good practice to use a similar answer by changing only a few sentences to answer another tough interview question. &#xA0;But first, I&apos;ll give an example of a different short answer.<br><br><b>Short Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I26/sentence/I26S2.mp3\">We had a new project that I was interested in. &#xA0;Even though I was busy, I volunteered to take on the assignment. &#xA0;I had to work so much more. &#xA0;Although I managed to complete the assignment, it really burned me out. &#xA0;I feel I aimed too high and I would have benefited by doing a better job on my current assignments instead of wanting more challenges.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I26/sentence/I26S3.mp3\">I believe aiming high is a good practice. &#xA0;Aiming high keeps me focused and forces me to grow by trying to reach high goals I have set for myself. &#xA0;But I know there are times where aiming too high is not good. &#xA0;For example, one time in the middle of the project, our clients wanted to change one aspect of the assignment that we already completed. &#xA0;I analyzed the change request and told them that we will not be able to make the date. &#xA0;I estimated that it will take three additional days. &#xA0;They insisted that we finish on the agreed upon time schedule. &#xA0;I told them we would try but we could not promise anything. &#xA0;Even with hard work and overtime, we missed the due date. &#xA0;We did however, finish one day later. &#xA0;I challenged myself to complete on time, but with the large change request, it was too high of a goal to reach. &#xA0;In this case, I really aimed too high. I should have been more firm telling them that we will need a few more days.</a>&quot;<br><br>This is a similar experience we already used, but you changed the beginning and the end to tailor it to this question. &#xA0;Remember that you can use one answer for multiple questions. &#xA0;This answer should make you look good instead of looking like you made a terrible mistake.\r\n"
}