{
    "lessonIndex": 478,
    "categoryIndex": 3,
    "sectionIndex": 1,
    "title": "Tell me about a time you made a great sale.",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=287",
    "html": "\r\n<h1>\r\nTell me about a time you made a great sale.\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I28/sentence/I28S1.mp3\">Tell me about a time you made a great sale.</a>&quot;</b><br><br>This is similar to the question, &apos;what does it mean to make a great sale&apos; &#xA0;You can change the words a little and use the answer for both questions. &#xA0;The key to this answer is explaining what it means to make a great sale, and then giving a good example of a great sale that you made.<br><br><b>Short Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I28/sentence/I28S2.mp3\">I had a customer come in that was a little rude. &#xA0;He had many questions and cut me off very frequently. &#xA0;I stayed patient and explained everything to his satisfaction. &#xA0;He ended up representing a medium sized business that required a large order. &#xA0;I feel this was a great sale because I treated this customer with respect and patience.</a>&quot;<br>&#xA0;<br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I28/sentence/I28S3.mp3\">Making a great sale can be measured by how much the company made, but I think making a great sale is how satisfied the customer is. &#xA0;A satisfied customer will return and continue to be a valued customer, so it&apos;s important to make sure that the customer is satisfied. &#xA0;One day, a customer was debating on two different types of watches. &#xA0;One was $1200 and the other was $400. &#xA0;This was a huge difference. &#xA0;I believe I could have sold him the $1200 watch, but instead, I laid out all the pro&apos;s and con&apos;s for him, and asked him questions to find out the purpose of the watch, if it was for casual wear or formal wear, and eventually helped him realize exactly what he was looking for. &#xA0;He ended up buying the $400 watch. &#xA0;Some people might think that was not a great sale, but I felt as a salesman and a person representing the company that I did a great job in satisfying this customer. &#xA0;In the next couple of years while I was working there, he came and bought many more items and had other friends come in to buy more products. &#xA0;I can confidently say that the $800 in missed sale resulted in thousands more for the company.</a>&quot; &#xA0;<br><br>This example has several key points. &#xA0;First, this answer is telling the interviewer what you believe is a great sale. &#xA0;Second, it is giving a good example. &#xA0;Finally, it is showing a good sign of an employee by saying, &apos;a person representing the company&apos; &#xA0;All salesman or someone who works with customers is representing their company in some way. &#xA0;Saying this casually in an example is definitely powerful.\r\n"
}