{
    "categoryIndex": 3,
    "sectionIndex": 2,
    "title": "What course did you like the least?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=293",
    "lessonIndex": 484,
    "html": "\r\n<h1>\r\nWhat course did you like the least?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I34/sentence/I34S1.mp3\">What course did you like the least?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I34/sentence/I34S2.mp3\">What course did you struggle in the most?</a>&quot;</b><br><br>This is an easier answer because you don&apos;t have to show off your strength here. &#xA0;All you have to do is make sure you don&apos;t pick a subject that relates to your job. &#xA0;It is also safer to pick something that most people do not enjoy. &#xA0;Finally, picking something that you are not good at is acceptable if it is not a skill required on the job. &#xA0;My long example will be about a drama class.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I34/sentence/I34S3.mp3\">I didn&apos;t enjoy history that much. &#xA0;It wasn&apos;t that difficult, but it didn&apos;t allow me to think creatively. &#xA0;Most of the classes I took were about memorizing dates and facts. &#xA0;So history is my least favorite subject.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I34/sentence/I34S4.mp3\">I struggled in a music class the most. &#xA0;I really enjoy listening to music so I tried to learn a little about it. &#xA0;But it was a disaster. &#xA0;My tone was off and I couldn&apos;t tell if something was flat or not.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I34/sentence/I34S5.mp3\">My least favorite class was probably poetry. &#xA0;During that course I struggled writing a real poem. &#xA0;I realized I am not a poet.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I34/sentence/I34S6.mp3\">I disliked my geography class. &#xA0;It wasn&apos;t difficult, but I simply didn&apos;t find it very interesting.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I34/sentence/I34S7.mp3\">For me, I had a tough time in my drama class. &#xA0;I didn&apos;t realize that I was a terrible actor. &#xA0;I didn&apos;t think it would be that hard, but week after week, my instructor would point out problem after problem. &#xA0;He gave me a B, but I think it was because of my effort, not because of my abilities. &#xA0;I say this because when I saw myself on video, oh my gosh, it was terrible.</a>&quot;<br><br>You are putting yourself down a lot here, but in this example it is actually good. &#xA0;Interviewers are worried that a person who can act well will be able to lie about many things during the interview. &#xA0;A person without acting skills will not be able to hide automatic body gestures that the interviewer is looking at. &#xA0;Also, this answer is good because it shows that this person never gives up and puts in a lot of effort.\r\n"
}