{
    "lessonIndex": 490,
    "categoryIndex": 3,
    "sectionIndex": 2,
    "title": "During college, how did you spend your summer vacations?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=299",
    "html": "\r\n<h1>\r\nDuring college, how did you spend your summer vacations?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I40/sentence/I40S1.mp3\">During college, how did you spend your summer vacations?</a>&quot;</b><br><br>The best answer is to have spent your summer productively such as working as an intern. &#xA0;Even if you did only one intern, the interviewer will like that. &#xA0;The worst answer is to say you didn&apos;t do anything. &#xA0;Or say you worked in the supermarket to get some money so you can party at night. &#xA0;So think of something productive, and if you don&apos;t have an intern experience, you can say that you spent your summer learning something new.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I40/sentence/I40S2.mp3\">My last two summers of college, I did an intern for a consulting firm. &#xA0;I gained experience working on office solutions for large companies.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I40/sentence/I40S3.mp3\">I have a strong interest in traveling, so I used my summer to travel. &#xA0;I went to Europe, Australia, Brazil, and China.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I40/sentence/I40S4.mp3\">Every summer, I took extra English classes. &#xA0;I also took some drawing classes because it&apos;s one of my hobbies. &#xA0;So I spent my summers learning more things.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I40/sentence/I40S5.mp3\">My first two summers, I had to work to save money for tuition. &#xA0;But after saving enough money, I had a free summer. &#xA0;I actually ended up taking some computer classes to prepare myself for the business world. &#xA0;These days it&apos;s a requirement to know computers, so I prepared for that.</a>&quot;<br><br>Although I said don&apos;t mention useless work, it is ok if it is for tuition. &#xA0;It shows financial responsibility. &#xA0;Finally, taking some computer classes for the summer is a great way to prepare for work life and it was a summer well spent. &#xA0;Make sure you have an answer that shows productivity.\r\n"
}