{
    "categoryIndex": 3,
    "sectionIndex": 2,
    "title": "If you could learn something such as a new skill, what would it be?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=302",
    "lessonIndex": 493,
    "html": "\r\n<h1>\r\nIf you could learn something such as a new skill, what would it be?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I43/sentence/I43S1.mp3\">If you could learn something such as a new skill, what would it be?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I43/sentence/I43S2.mp3\">What&apos;s the next thing you want to learn?</a>&quot;</b><br><br>This is another type of question that has no wrong or right answer. &#xA0;That means you need to make your answer a little more creative so it stands out.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I43/sentence/I43S3.mp3\">I would love to learn more about auditing. &#xA0;As a tax accountant, I primarily work on tax. &#xA0;But I like all aspects of accounting and I think auditing would be very interesting.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I43/sentence/I43S4.mp3\">The next thing I want to learn is how to make web pages. &#xA0;I think this skill can be used anywhere. &#xA0;If I want a personal web site, I would make it myself. &#xA0;And if my group at work needed an internal web site to organize activities, I would be able to make one.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I43/sentence/I43S5.mp3\">I want to learn the different ways to market globally. &#xA0;In my marketing team, I learned everything about marketing on a local level, but I would really love to learn about marketing to different countries.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I43/sentence/I43S6.mp3\">I use the computer on a daily basis and know how to use everything I need to be good at my job. &#xA0;But sometimes something goes wrong with the computer for no reason at all. &#xA0;Because I&apos;m not a computer engineer, I have no idea what&apos;s going on. &#xA0;Basically, I have to wait for a technician to fix it. &#xA0;During these times, I want to kick the computer out of frustration. &#xA0;Mostly, it ends up being a problem I could have fixed if I new the details of how a computer works. &#xA0;So even though it&apos;s not in my job description, I want to know how to fix computers at a basic level.</a>&quot;<br><br>I heard from many people who don&apos;t know computers that well that they get frustrated with them. &#xA0;So wanting to kick the computer is understandable and it is a little humorous. &#xA0;Wanting to learn a little more about the computer is always good and it would definitely help out with future work by not having to wait for a technician.\r\n"
}