{
    "categoryIndex": 3,
    "sectionIndex": 3,
    "title": "If you could start your career over again, what would you do differently?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=303",
    "lessonIndex": 494,
    "html": "\r\n<h1>\r\nIf you could start your career over again, what would you do differently?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I44/sentence/I44S1.mp3\">If you could start your career over again, what would you do differently?</a>&quot;</b><br><br>This depends on several factors. &#xA0;If your university major is different than your career choice, then you could answer that you would choose a different major to prepare you for your choice in career. &#xA0;Or if you started at a small company and didn&apos;t have many opportunities, you can say that you would have started at a larger company. &#xA0;This is not a significant question so a regular answer should suffice.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I44/sentence/I44S2.mp3\">I started my career at a small company. &#xA0;I feel I would have benefited more if I started at a larger company. &#xA0;A large company usually provides training that I didn&apos;t receive, so I would like to have started my career in a larger company.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I44/sentence/I44S3.mp3\">I didn&apos;t know how much I liked working with computers until I finished college. &#xA0;If I had known earlier, I would have liked to have worked with computers earlier in my career.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I44/sentence/I44S4.mp3\">Well, I majored in chemistry and now I&apos;m working in the marketing department for a telecommunications company. &#xA0;I had a lot to learn in the beginning, but I quickly learned what I needed to know to be an effective member of the marketing team. &#xA0;However, I always felt that if I majored in business or marketing, I would have started off with a better foundation. &#xA0;I&apos;m great at what I do, but if I could start over again, I would probably choose to have majored in business administration.</a>&quot;<br><br>This is an acceptable answer because the answer doesn&apos;t display any problems in the work history. &#xA0;Many people change careers or go into a field that is unrelated to their major. &#xA0;This is common, so answering this question using this answer is common. &#xA0;If you don&apos;t want to use this common answer, then thinking about a scenario early in your work career that you would have done differently might be more effective.\r\n"
}