{
    "lessonIndex": 497,
    "categoryIndex": 3,
    "sectionIndex": 3,
    "title": "Tell me about your last position?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=306",
    "html": "\r\n<h1>\r\nTell me about your last position?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I47/sentence/I47S1.mp3\">Tell me about your last position? &#xA0;What did you do and how did you do it? &#xA0;Include the people you worked for and the people you worked with.</a>&quot;</b><br><br>This question is a little better than asking about the last three positions. &#xA0;It is more direct and focuses on getting more information about the last position. &#xA0;You might not get this question with so much detail. &#xA0;It might just be, &quot;<a href=\"http://www.talkenglish.com/AudioTE1/I47/sentence/I47S2.mp3\">Tell me about your last position.</a>&quot; &#xA0;But you can use the other questions as a guide when answering this question. &#xA0;You should mention what you did, how you did it, how you work in a team, what you learned, how well you did your job, etc.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I47/sentence/I47S3.mp3\">I was a staff auditor for a small accounting firm. &#xA0;I performed audits for small to medium size businesses. &#xA0;This involved meeting the clients and retrieving data required to complete the audit. &#xA0;I worked closely with my supervisor that presented my findings of the audit to the clients.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I47/sentence/I47S4.mp3\">I worked for a large insurance company as an agent. &#xA0;I made sales to new customers and provided customer service to existing customers. &#xA0;I worked with three other people in my group and we helped each other by sharing ideas and experiences.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I47/sentence/I47S5.mp3\">I was a program manager for a manufacturing company. &#xA0;I was in charge of cost analysis concerning different quantities of manufacturing. &#xA0;I also worked on planning the procedure for the next deliverables.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I47/sentence/I47S6.mp3\">In my last position, I was a senior auditor. &#xA0;My duties included auditing governmental businesses and Native American tribes. &#xA0;For all the audits I was conducting, I was the in charge auditor overseeing the audits of other team members and doing a portion of the audit myself. &#xA0;I have experience in conducting an audit from beginning to end without supervision and I worked with controllers and senior accountants on a regular basis. &#xA0;Along with working with experienced and knowledgeable client&apos;s, I also had to work with junior level accountants that didn&apos;t know all the details of auditing. &#xA0;I was clear and concise in asking for what I needed. &#xA0;In the last year I was working as the senior auditor, I planned and organized each visit to our client&apos;s site. &#xA0;I regularly trained and managed new members of our team and I was the go to person for technical auditing questions.</a>&quot;<br><br>The question wanted detail so the answer has to be a little long detailing some of the highlights of the last job. &#xA0;I included the type of people I worked for, the people I work with, the job description, and included that I was a great team member and a leader at the last position. &#xA0;Most of you will not be in the accounting field, so you can&apos;t use this example. &#xA0;But you should follow the steps of being detailed and showing off your strengths.\r\n"
}