{
    "categoryIndex": 3,
    "sectionIndex": 3,
    "title": "Tell me about the worst manager you ever had.",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=310",
    "lessonIndex": 501,
    "html": "\r\n<h1>\r\nTell me about the worst manager you ever had.\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I51/sentence/I51S1.mp3\">Tell me about the worst manager you ever had.</a>&quot;</b><br><br>Just like learning from a good manager, you should learn from bad managers as well. &#xA0;When you tell the reason why your manager was bad, make sure to include that you learned not to be like that.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I51/sentence/I51S2.mp3\">In my last position, I had a manager who didn&apos;t like to give instructions. &#xA0;I managed to figure a lot of it out, but I would have saved a lot of time if my manager gave a simple 5 minute overview on the project.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I51/sentence/I51S3.mp3\">I had one manager that was very disorganized. &#xA0;Whenever I ask a question, he would look around his desk for a couple minutes looking for information to give to me. &#xA0;I like to be organized so this trait really bothered me.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I51/sentence/I51S4.mp3\">One manager didn&apos;t like talking to people. &#xA0;He always had his office door closed and whenever anyone asked a question, he seemed disturbed. &#xA0;He was very intelligent and produced a great deal of work, but as a manager, I believe you should be approachable by your directs.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I51/sentence/I51S5.mp3\">The worst manager I had was when I was working at a database company. &#xA0;I didn&apos;t like my manager because he was never available. &#xA0;When ever he was given an assignment, he always delegated the work without explaining the details. &#xA0;We were told to figure it out. &#xA0;I believe that you can learn from figuring some things out by ourselves, but it was obvious that this wasn&apos;t his intention. &#xA0;But the worst thing about it was that I didn&apos;t know that he was bad until I changed to a different manager. &#xA0;He kept feeding us false hope saying we are close to being promoted. &#xA0;Basically it was a way to keep us motivated to work extra hard. &#xA0;Sure it worked for a while, but I didn&apos;t gain anything else out of it except what not to be as a manager.</a>&quot;<br><br>This is a pretty easy answer that just explains the behavior of a bad manager. &#xA0;If you haven&apos;t had many managers, then it might be difficult to think of one. &#xA0;But you should definitely think of an answer even if you have to bend the truth a little. &#xA0;Although my example was ordinary, you can make a better answer by listing out what you learned through your bad manager.\r\n"
}