{
    "lessonIndex": 502,
    "categoryIndex": 3,
    "sectionIndex": 3,
    "title": "What could you have done to improve your relationship with a manager...",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=311",
    "html": "\r\n<h1>\r\nWhat could you have done to improve your relationship with a manager you didn&apos;t like?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I52/sentence/I52S1.mp3\">What could you have done to improve your relationship with a manager you didn&apos;t like?</a>&quot;</b><br><br>This question could be a follow up to the question about having a bad manager. &#xA0;In my case, I didn&apos;t know he was a bad manager until I switched managers. &#xA0;But here is a generic answer that shows professionalism.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I52/sentence/I52S2.mp3\">If I communicated my problems earlier, I feel we both would have benefited. &#xA0;I waited several months before approaching my manager, and after our talk, our relationship got much better. &#xA0;So I could have improved my relationship by talking about problems sooner than later.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I52/sentence/I52S3.mp3\">I feel I should be more understanding of different work styles. &#xA0;I didn&apos;t like my manager not communicating enough, but that didn&apos;t mean we couldn&apos;t approach him. &#xA0;So I&apos;m learning to work seamlessly with different types of people.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I52/sentence/I52S4.mp3\">One of my managers gave too much criticism. &#xA0;I value criticism, but hearing something negative every other day was difficult. &#xA0;I think I could have communicated how the criticism affected me in order to improve our relationship.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I52/sentence/I52S5.mp3\">I had a manager in the past I didn&apos;t like that much, but I couldn&apos;t say he was a bad manager. &#xA0;Our personalities conflicted and we had some arguments. &#xA0;This affected my performance and willingness to work in the beginning, but I asked myself this same question. &#xA0;I thought I should try to get along with my manager despite my personal feelings. &#xA0;I set them aside and maintained a professional relationship. &#xA0;Taking this approach really helped. &#xA0;Because I was willing to look past minor differences, our work relationship got stronger and I performed at a higher level.</a>&quot;<br><br>This answer shows that this person took proper actions before it was too late. &#xA0;It shows that this candidate has the ability to work with managers and team members despite personal differences or feelings of dislike. &#xA0;When you think of your own answer, make sure you answer this question showing that you dealt with this problem before and that you overcame the situation.\r\n"
}