{
    "lessonIndex": 503,
    "categoryIndex": 3,
    "sectionIndex": 3,
    "title": "What were the most memorable accomplishments in your last position?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=312",
    "html": "\r\n<h1>\r\nWhat were the most memorable accomplishments in your last position?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I53/sentence/I53S1.mp3\">What were the most memorable accomplishments in your last position?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I53/sentence/I53S2.mp3\">What were the most memorable accomplishments in your last career?</a>&quot;</b><br><br>Both of these questions can be answered with the same question. &#xA0;If you do not have much experience, it might be hard to think of a good answer. &#xA0;Also, if your previous job was very simple or followed a regular routine, then a memorable accomplishment might be hard to think about. &#xA0;So take a lot of time to think of anything. &#xA0;Because answering this question with nothing to say is basically the only wrong answer. &#xA0;Here are some ideas. &#xA0;Did you save the company money? &#xA0;Did you create a new process and put it into place? &#xA0;Did you break a sales record? &#xA0;Did you meet a difficult deadline? &#xA0;You can use all of these types of experience for this answer.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I53/sentence/I53S3.mp3\">I remember the day I completed an audit from beginning to end all by myself. &#xA0;Since I was an entry level auditor, this accomplishment really felt good because it was my first major step.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I53/sentence/I53S4.mp3\">One day our director came out of his office asking who wrote up the documentation for ABC firm. &#xA0;I didn&apos;t know if he was upset or impressed. &#xA0;I said I did it and he basically said, great job and went back to his office. &#xA0;This was memorable because the director never did this before.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I53/sentence/I53S5.mp3\">The most memorable accomplishment I had as a sales associate for a software company was closing a deal worth $17 million. &#xA0;This was the second largest order our company ever had and it felt like hitting a grand slam.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I53/sentence/I53S6.mp3\">My last position was selling copy machines. &#xA0;I had one month where I broke the sales record for a given month. &#xA0;I think that was a great accomplishment. &#xA0;However, throughout the calendar year, I exceeded the average number of sales by 20% ten out of twelve months. &#xA0;Having a great month is good, but I feel it is a greater accomplishment maintaining solid numbers throughout the whole year.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I53/sentence/I53S7.mp3\">I think the greatest accomplishment in my last position was implementing a simple process that reduced the number of broken builds by 20%. &#xA0;Whenever we have a broken build, it slows down work for 20 different people. &#xA0;That puts risk on slipping the ship date. &#xA0;But my process involved following 25 steps prior to building to ensure a successful build. &#xA0;The 25 steps only took 15 minutes to complete and we reduced the number of build breaks significantly. &#xA0;It worked for our product and upper management instructed other groups in our organization to put this process in place. &#xA0;I really felt excited about that accomplishment.</a>&quot;<br><br>These two examples are different. &#xA0;One is for a sales position and the second is for a technical engineer position. &#xA0;Both of them are great accomplishments. &#xA0;Sales is easy to answer because you can just throw out numbers and it sounds good. &#xA0;The second is a little more difficult because you have to explain the situation a little. &#xA0;But make sure you explain your scenario enough so the interviewer can see the significance of your contribution.\r\n"
}