{
    "lessonIndex": 504,
    "categoryIndex": 3,
    "sectionIndex": 3,
    "title": "Why do you want to leave your current job?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=313",
    "html": "\r\n<h1>\r\nWhy do you want to leave your current job?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I54/sentence/I54S1.mp3\">Why do you want to leave your current job?</a>&quot;</b><br><br>There are many wrong answers to this question. &#xA0;Some of them include saying things like, I hate my job, I hate the company, I&apos;m not appreciated there, I hate my boss, I&apos;m sick of working there, etc. &#xA0;Basically, anything negative is a bad answer. &#xA0;If you say something negative, they will think you will eventually get into that situation again while working for them. &#xA0;So I highly recommend you have a good answer that leaves a positive impression while displaying good traits.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I54/sentence/I54S2.mp3\">I want to find a company with more opportunities. &#xA0;My previous company was very small and didn&apos;t have opportunities for growth. &#xA0;After learning about the work environment here, I felt this is exactly the type of place I want to work.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I54/sentence/I54S3.mp3\">My current company is very large and it&apos;s difficult to do different tasks. &#xA0;We have routine work that never changes. &#xA0;I want to work in an environment where I can utilize more of my skills.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I54/sentence/I54S4.mp3\">Our family moved to live near a better school district for our children. &#xA0;This area is great and I want to find a job closer to my new home. &#xA0;My previous job was too far away to commute.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I54/sentence/I54S5.mp3\">I really enjoy what I&apos;m doing, but I feel I&apos;m following a routine. &#xA0;I looked around for more opportunities to grow, but because the company is small, I&apos;m very limited. &#xA0;I want to work in an environment that will help me realize my full potential and a place I can contribute everything I&apos;m capable of doing. &#xA0;My current job doesn&apos;t provide these things for me and that&apos;s why I want to work here. &#xA0;I know ABC Company has a lot of opportunities for growth and encourages employees to take on challenging projects to learn more. &#xA0;That is what I&apos;m looking for.</a>&quot;<br><br>This answer shows a couple of good traits. &#xA0;It also shows excitement and mentions the company name. &#xA0;It is personal and direct. &#xA0;This is a generic answer so you can use this if you want. &#xA0;If you decide to think of your own, make sure it displays good traits and the reason for wanting to leave your current job is not a negative reason.\r\n"
}