{
    "categoryIndex": 3,
    "sectionIndex": 3,
    "title": "Where did you tell your boss you were going?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=314",
    "lessonIndex": 505,
    "html": "\r\n<h1>\r\nWhere did you tell your boss you were going?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I55/sentence/I55S1.mp3\">Where did you tell your boss you were going?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I55/sentence/I55S2.mp3\">Where does your boss think you are?</a>&quot;</b><br><br>I highly doubt you will be asked this question. &#xA0;But it is true that interviews are conducted during office hours. &#xA0;That means if you are employed, then you will have to have a reason for not working. &#xA0;There are a couple of options. &#xA0;If the interview is less than two hours, you can schedule one during lunch time. &#xA0;If so, you can say you told your boss that you had to take care of some personal matters and you are taking an extended lunch. &#xA0;Another option is to tell the interviewer that your boss is aware of your interview schedule. &#xA0;But make sure it is true. &#xA0;I don&apos;t know what the best way to answer this question. &#xA0;But if I had to respond to this question, I would answer by saying I&apos;m taking a personal day, or a vacation day. &#xA0;But make sure you don&apos;t say you are using a sick day. &#xA0;That is a complete lie and the interviewer will see that you are willing to lie for your personal gain.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I55/sentence/I55S3.mp3\">I wasn&apos;t required to tell my boss because I used one of my vacation days to be here. &#xA0;I&apos;m really excited to have this interview opportunity and using a vacation day was very well worth it.</a>&quot;<br><br>This answer is turning an awkward question into an opportunity to show enthusiasm for the interview and the company. &#xA0;This is a key example where little things count. &#xA0;By adding the last sentence, the interviewer is sure to remember your answer more. &#xA0;That is because he or she will see your enthusiasm and excitement. &#xA0;If all the answers are the same, this one will be sure to stand out. &#xA0;When interviewing, everyone has similar answers. &#xA0;The key is to find opportunities to put in little extra comments to give you the advantage.\r\n"
}