{
    "categoryIndex": 3,
    "sectionIndex": 3,
    "title": "In your previous position, how much time did you spend ...",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=317",
    "lessonIndex": 508,
    "html": "\r\n<h1>\r\nIn your previous position, how much time did you spend ...\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I58/sentence/I58S1.mp3\">In your previous position, how much time did you spend on the phone?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I58/sentence/I58S2.mp3\">In your previous position, how much time did you spend in meetings?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I58/sentence/I58S3.mp3\">In your previous position, how much time did you spend working by yourself?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I58/sentence/I58S4.mp3\">In your previous position, how much time did you spend working in a team?</a>&quot;</b><br><br>These questions all depend on the type of position you are applying for. &#xA0;If the position is a product support position, then time spent on the phone is going to be large. &#xA0;Let&apos;s say your previous work involved working alone a lot, and the position you are applying for requires a lot of teamwork. &#xA0;Even though you worked by yourself a lot, you should emphasize the work you did in teams. &#xA0;If this is the situation, then I would say I did a combination of both.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I58/sentence/I58S5.mp3\">In my last position, we had large projects that involved multiple people. &#xA0;We had meetings to discuss the project and worked in teams whenever it involved overlap of feature. &#xA0;After the meetings and working with the team, I was required to finish my work by myself. &#xA0;So it was quite balanced between meetings, team work and working by myself.</a>&quot;<br><br>This is not an extravagant answer, but it definitely shows that this person is capable of working in groups and working alone. &#xA0;Most office work requires a combination of working in groups and alone, but if your situation is different, then answer according to what the interviewer wants to hear.\r\n"
}