{
    "categoryIndex": 3,
    "sectionIndex": 3,
    "title": "If you’re very happy with your current job, why do you want to leave?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=319",
    "lessonIndex": 510,
    "html": "\r\n<h1>\r\nIf you&apos;re very happy with your current job, why do you want to leave?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I60/sentence/I60S1.mp3\">If you&apos;re very happy with your current job, why do you want to leave?</a>&quot;</b><br><br>If you portray that you are very happy with your current job, then they might ask you this question. &#xA0;I was in a very similar situation and I will include my answer as the example. &#xA0;You can use other reasons, but make sure it doesn&apos;t contradict you being happy.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I60/sentence/I60S2.mp3\">I like the work I&apos;m doing and I like everyone on my team, but I have a strong desire to learn other aspects I can&apos;t learn in my current position.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I60/sentence/I60S3.mp3\">I have been in my current position for four years and I want to gain experiences in other areas. &#xA0;I love my job, but I want to grow more as a professional.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I60/sentence/I60S4.mp3\">I love to learn new things and after several years in my current position, I realized I was doing the same thing over and over again most of the time. &#xA0;So the only reason I want to leave my current job is to broaden my knowledge by gaining other experiences.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I60/sentence/I60S5.mp3\">I have been with my previous group for more than three years. &#xA0;I was doing the same thing on a regular basis. &#xA0;Although we received different projects from time to time, it was very similar to my previous work. &#xA0;So I had a desire to gain new experiences and learn from different products. &#xA0;I believe having a variety of experience is good for my career so I made the decision to leave my current job.</a>&quot;<br><br>This is simple and direct. &#xA0;It answers the question without including unnecessary excuses. &#xA0;It also shows my desire to grow, learn more, and improve myself. &#xA0;This is a good indication of a good employee so using an answer like mine is a safe answer.\r\n"
}