{
    "lessonIndex": 512,
    "categoryIndex": 3,
    "sectionIndex": 4,
    "title": "Give me a specific example at your last position where...",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=321",
    "html": "\r\n<h1>\r\nGive me a specific example at your last position where...\r\n</h1>\r\n<b> &quot;<a href=\"http://www.talkenglish.com/AudioTE1/I62/sentence/I62S2.mp3\">Give me a specific example at your last position where reduced cost.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I62/sentence/I62S3.mp3\">Give me a specific example at your last position where you made things more efficient.</a>&quot;</b><br><br>These are very similar to the &apos;Tell me about&apos; type of questions. &#xA0;They want a specific example from your work experience. &#xA0;But if the position is an engineer position, you will not get questions about revenue and cost, but you might get one about efficiency. &#xA0;In other questions, I gave an example of reducing cost, so I will use this time to give an example of increasing revenue.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I62/sentence/I62S4.mp3\">As a sales associate, I do my part in increasing revenue by making more sales. &#xA0;Even if I&apos;m having a good month, I continue to work hard to make sure our company is continually increasing its revenue.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I62/sentence/I62S5.mp3\">It&apos;s something small, but in our office, everyone left there monitors and lights on. &#xA0;I simply put up signs to turn off their monitors and to turn off office lights. &#xA0;This really helped and our VP even told me he appreciated the small effort.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I62/sentence/I62S6.mp3\">We provide many different brochures for our clients, and when we get low on a specific brochure, we have to order each one separately. &#xA0;I created a small tool that automates this process and saved about 30 minutes of work each time we ordered brochures. &#xA0;It was something small, but my manager appreciated it.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I62/sentence/I62S7.mp3\">In my last position, I was the manager for a Japanese restaurant. &#xA0;We were located in downtown and realized that not everyone had a full hour for a lunch break. &#xA0;I created a system to turn 5 of our dishes into meals that would be ready in three minutes. &#xA0;We put up a sign indicating that we would have meals in less than three minutes and revenues jumped 30%. &#xA0;I considered the location of the restaurant and saw an opportunity to provide meals to customers that would&apos;ve never considered our meal due to their lack of time. &#xA0;The store owner was really proud of this accomplishment.</a>&quot;<br><br>All examples will be different because everyone has different experiences. &#xA0;When you think of your own, you should primarily be concerned about how clear you are. &#xA0;Think of something you did and put them into words. &#xA0;Having answers ahead of time will keep you organized during the interview.\r\n"
}