{
    "categoryIndex": 3,
    "sectionIndex": 4,
    "title": "What do you expect from your manager?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=323",
    "lessonIndex": 514,
    "html": "\r\n<h1>\r\nWhat do you expect from your manager?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I64/sentence/I64S1.mp3\">What do you expect from your manager?</a>&quot;</b><br><br>This question should be answered that shows what type of worker you are. &#xA0;Mention things that will help you to become a better worker instead of mentioning that you want an understanding manager.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I64/sentence/I64S2.mp3\">The most important thing I want from my manager is constructive feedback so I know where I need to improve. &#xA0;I want to continually grow and having a good manager will help me achieve my goal.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I64/sentence/I64S3.mp3\">I expect my manager to provide work that is relevant to both the company and my growth. &#xA0;My manager should know my strengths and also help me work on my weaknesses.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I64/sentence/I64S4.mp3\">I expect my manager to be a smart person who works hard. &#xA0;If my manager is setting a positive example, I believe I&apos;ll be more encouraged to work harder. &#xA0;Having a manager that bosses people around without doing any work is very discouraging. &#xA0;So I expect my manager to lead by example.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I64/sentence/I64S5.mp3\">I expect my manager to give me relevant work, to be accessible, setting an example through action, providing both positive and negative feedback so I can improve, and finally a manager that will help me succeed. &#xA0;Ultimately, I know it&apos;s my responsibility to be a great performer, but having a manager that I can learn from can help me grow that much more. &#xA0;That&apos;s what I&apos;m looking for.</a>&quot;<br><br>This example shows the use of key words such as, succeed, great performer, improve, and grow. &#xA0;Each item listed demonstrates a desire to work hard and to improve. &#xA0;If you want to think of your own answer, keep this in mind.\r\n"
}