{
    "lessonIndex": 518,
    "categoryIndex": 3,
    "sectionIndex": 4,
    "title": "Have you managed people in any of the positions you’ve held?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=327",
    "html": "\r\n<h1>\r\nHave you managed people in any of the positions you&apos;ve held?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I68/sentence/I68S1.mp3\">Have you managed people in any of the positions you&apos;ve held?</a>&quot;</b><br><br>If your resume states that you are a manager or states that you manage people, then they won&apos;t ask you this question. &#xA0;It is for those that are not in a defined management position. &#xA0;Basically, they want to know if you have any experience managing people. &#xA0;I do not recommend lying. &#xA0;They can keep asking questions until they find you in a lie. &#xA0;I would recommend telling the truth. &#xA0;I&apos;ll give two examples. &#xA0;One is my experience of managing two temporary workers. &#xA0;And another is an example that would show some managing experience without actually saying you managed people.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I68/sentence/I68S2.mp3\">Yes. &#xA0;I have one year experience in managing three people. &#xA0;I distributed work to each member of my team, provided assistance and guidance, and mentored each employee to be a better employee.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I68/sentence/I68S3.mp3\">I have three years of experience managing people. &#xA0;I managed a team from 3 people to a group of 10. &#xA0;Most of my duties as a manger was to make sure our projects were on track and that each employee was completing their work.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I68/sentence/I68S4.mp3\">I&apos;ve never managed people yet, but I have 2 years of experience mentoring new employees. &#xA0;I took several courses on management and I feel I&apos;m ready to take the next step of managing people.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I68/sentence/I68S5.mp3\">I didn&apos;t hold a management position, but I was in charge of several projects where I had to manage a group of 4 workers to complete projects for a three month duration each. &#xA0;These projects gave me great experience in managing people.</a>&quot;<br><br><b>Long Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I68/sentence/I68S6.mp3\">I&apos;ve never been in a management position yet, but I did manage two temporary employees for a one year duration. &#xA0;During that time, I was given a large area of work to cover. &#xA0;I planned and organized the work to distribute to the two extra workers. &#xA0;I managed their work and kept track of how many hours they worked each week. &#xA0;I met with them on a regular basis and provided feedback on where they are doing well, and where they needed improvement. &#xA0;Their time in our team ended after we completed the project. &#xA0;It wasn&apos;t a management position, but I gained experience in managing people.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I68/sentence/I68S7.mp3\">I never held a position where I was managing people, but I had a lot of experience where I was in charge of large projects. &#xA0;Although it was my co-workers, I had the experience of taking the lead on projects where I had to manage people for a specific time period. &#xA0;Although I didn&apos;t experience the full aspect of managing people, I learned how to bring people together, how to use individual strengths of each worker, and how to organize and break down a large task to distribute to several people.</a>&quot;<br><br>If you have management experience, then you can tell them about your experience. &#xA0;But if you haven&apos;t, then it might be good to show them that you have some experience in managing people as I illustrate in my example.\r\n"
}