{
    "categoryIndex": 3,
    "sectionIndex": 4,
    "title": "What types of people do you have trouble getting along with?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=328",
    "lessonIndex": 519,
    "html": "\r\n<h1>\r\nWhat types of people do you have trouble getting along with?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I69/sentence/I69S1.mp3\">What types of people do you have trouble getting along with?</a>&quot;</b><br><br>Even if you believe you get along with everyone, the interviewer will not believe you so don&apos;t say that you do. &#xA0;I recommend thinking about a type of person that is a bad worker. &#xA0;Use that person as an example and then explain what you do to put effort into the troubled relationship.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I69/sentence/I69S2.mp3\">I get along with almost everybody, but I tend to get frustrated at people who always say yes and end up not delivering. &#xA0;I expect honesty and integrity, and saying yes should mean yes.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I69/sentence/I69S3.mp3\">I&apos;m very understanding of different people and different work styles, but I have a hard time with people who only do work that is seen by management. &#xA0;There&apos;s so much work that needs to be done and not everything is seen by the manager. &#xA0;So I get upset when work is neglected.</a>&quot;<br><br><b>Long Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I69/sentence/I69S4.mp3\">I get along with almost everyone, but I think I have the hardest time tolerating people who think they&apos;re always right. &#xA0;Not everything is black and white and many times there are multiple ways of doing something. &#xA0;In my last group, I had a coworker that believed his way was the correct way. &#xA0;That&apos;s fine, but when you try to explain another view point, he doesn&apos;t listen, starts to talk louder and he begins to think it&apos;s a debate. &#xA0;I avoided him for a while, but realized I should put in an effort to deal with his personality.</a>&quot;<br><br>For a follow up question, the interviewer can ask you what you did in this situation. &#xA0;Here is an example of dealing with this type of person.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I69/sentence/I69S5.mp3\">Basically, I had to change the way I talked to him. &#xA0;I was very careful with my words and always said something like, &apos;that&apos;s a great idea, but could we add this to it&apos; or &apos;I definitely agree with you, but can I get your opinion on this method.&apos; &#xA0;To tell you the truth, I would rather not deal with a person like that, but I thought the right thing to do was find a way to deal with him so that is what I did.</a>&quot;<br><br>The reason why it is acceptable to say you have a difficult time dealing with people like this is because everyone will have a hard time dealing with this type of person. &#xA0;So it doesn&apos;t make you look bad because you can&apos;t get along with this person, however, this is a good answer because it shows taking initiative to correct the relationship.\r\n"
}