{
    "categoryIndex": 3,
    "sectionIndex": 4,
    "title": "Why do you like sales?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=330",
    "lessonIndex": 521,
    "html": "\r\n<h1>\r\nWhy do you like sales?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I71/sentence/I71S1.mp3\">Why do you like sales?</a>&quot;</b><br><br>You can answer this question in numerous ways. &#xA0;But to make your answer effective, you should think of an answer that will show your strong points as a salesman. &#xA0;Make sure to cover your own traits that are important to sales. &#xA0;Here is an example.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I71/sentence/I71S2.mp3\">I like sales because I like talking with people and I&apos;m good at making people feel comfortable.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I71/sentence/I71S3.mp3\">I enjoy sales because it requires strong communication skills and that&apos;s one of my strong traits. &#xA0;I like the challenge of making a sale and I feel good whenever I make a good sale.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I71/sentence/I71S4.mp3\">I like sales because it fits my personality. &#xA0;I enjoying working with all sorts of people and I like to provide great customer service by answering questions about products professionally.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I71/sentence/I71S5.mp3\">I&apos;ve always liked sales. &#xA0;I enjoy working with and talking to people. &#xA0;I&apos;m good at making people comfortable and I also like the challenge. &#xA0;In the past with my friends, I heard comments frequently that I would make a good salesman even before I got into sales. &#xA0;So basically, I like sales because it fits my personality and I really enjoy it.</a>&quot;<br><br>This is a simple short answer. &#xA0;Not everyone can be a salesperson. &#xA0;They need to have the right personality such as good communication skills. &#xA0;You don&apos;t have to have a great answer for this question. &#xA0;But the most important aspect is showing that you enjoy sales.\r\n"
}