{
    "lessonIndex": 522,
    "categoryIndex": 3,
    "sectionIndex": 4,
    "title": "Do you see that stapler? Convince me to buy it.",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=331",
    "html": "\r\n<h1>\r\nDo you see that stapler? &#xA0;Convince me to buy it.\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I72/sentence/I72S1.mp3\">Do you see that stapler? &#xA0;Convince me to buy it.</a>&quot;</b><br><br>This is a test to see if you are an experienced salesperson. &#xA0;I do not have much sales experience but I would answer this question by thinking of salesman I encountered in the past that I felt was good. &#xA0;Think about your experience with sales people and list what they did. &#xA0;For example, they probably follow a format. &#xA0;First, they explain what the product is. &#xA0;Then they tell you the functionalities and where you can use it. &#xA0;Third, they should tell you how much easier it will make your work. &#xA0;Fourth, it should have a good warranty. &#xA0;The question didn&apos;t give you details. &#xA0;So feel free to make something up. &#xA0;It will show your creativity. &#xA0;Continuing, the product should have a good return policy. &#xA0;Finally, you can talk about the reduced price, or the price guarantee.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I72/sentence/I72S2.mp3\">This stapler is the newest model with easier to use features such as quick loading and safety protection. &#xA0;It also comes with a money back guarantee for any reason if you are not satisfied.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I72/sentence/I72S3.mp3\">This stapler is on sale for 30% off. &#xA0;The manufacturer is a new company so their prices are great right now. &#xA0;They have a great warranty program and it will save your company a lot of money with the substantial discount.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I72/sentence/I72S4.mp3\">This stapler has the best value. &#xA0;With a 15% lower sticker price, it provides identical functionality with the more expensive brands. &#xA0;It&apos;s durable and staples through more paper than the other brands.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I72/sentence/I72S5.mp3\">We are proud to carry this stapler. &#xA0;It&apos;s very durable and easy to use. &#xA0;Loading the staples is as simple as clicking this button on the bottom to open the top. &#xA0;The design is made with more curves to make it more appealing on the desk. &#xA0;It also is designed with more safety in mind. &#xA0;If you accidentally drop the staple on your foot or hit it with your hand, the curves are smooth enough where it will not break the skin. &#xA0;The warranty on the stapler is great too. &#xA0;It comes with a five year guarantee. &#xA0;We are currently offering this stapler for a low price of $19.99, and we have a low price guarantee. &#xA0;If you find a lower price in the next thirty days, we will gladly pay you the difference.</a>&quot;<br><br>If you are applying for a sales position, you have to be ready to be able to sell anything in the room. &#xA0;I would recommend thinking about an outline. &#xA0;Get that in your head. &#xA0;Then use the outline to practice selling variety of things. &#xA0;You can use my answer as an outline covering features, functionality, safety, design, warranty, and price. &#xA0;But don&apos;t limit it to just these, if you have another idea, add it to this, or make up your own.\r\n"
}