{
    "lessonIndex": 523,
    "categoryIndex": 3,
    "sectionIndex": 4,
    "title": "How long have you been looking for a job?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=332",
    "html": "\r\n<h1>\r\nHow long have you been looking for a job?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I73/sentence/I73S1.mp3\">How long have you been looking for a job?</a>&quot;</b><br><br>I don&apos;t know if this is legitimate question for an interviewer to ask, but it is definitely possible. &#xA0;I don&apos;t like the question, but at least we should think about it and prepare an answer. &#xA0;If you have been looking for a job for like eight months, it could sound like you are a bad candidate because nobody wants to hire you. &#xA0;Instead, I would take a different approach than answering honestly. &#xA0;If the resume shows you have been out of work for a year, then you have to explain the one year. &#xA0;You have two options. &#xA0;First, you can be honest and say you have been looking for one year, or you can think of a good excuse. &#xA0;It&apos;s hard to lie and sound believable so I&apos;m going to give an honest answer. &#xA0;If you have a good excuse for not working for a long duration, feel free to use that as an excuse.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I73/sentence/I73S2.mp3\">I sent out my resumes just last week. &#xA0;I&apos;m very excited to join a company where I can help out.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I73/sentence/I73S3.mp3\">I&apos;ve been looking for about a month now. &#xA0;Because of the slow economy it&apos;s taking a little longer than I expected, but I&apos;m confident that I can be a valuable asset to any company.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I73/sentence/I73S4.mp3\">It&apos;s been about 2 months now. &#xA0;I wasn&apos;t as aggressive in the beginning because I was taking some classes, but now that I&apos;m done with class, I&apos;m really trying now.</a>&quot;<br><br><b>Long Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I73/sentence/I73S5.mp3\">To be honest, I&apos;ve been looking for a job for quite a long time. &#xA0;The job market hasn&apos;t been that great and it&apos;s been a little rough. &#xA0;But I spent my year productively by reading up on new technologies, self studying, and trying to challenge myself with small projects. &#xA0;I definitely learned a lot and I&apos;m really ready to start working again.</a>&quot;<br><br>If you have a real excuse such as a sick mother you have to take care of, here is an example.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I73/sentence/I73S6.mp3\">I have been out of work for a year, but I have only been looking for a job for about 3 weeks now. &#xA0;My mother had cancer and I wanted to spend the final months with her. &#xA0;She passed away and I can starting work again.</a>&quot;<br><br>I don&apos;t recommend lying for this question. &#xA0;It could turn bad if they find out the truth later. &#xA0;Telling them the truth like my first example shows honesty and shows that you tried to stay productive.\r\n"
}