{
    "categoryIndex": 3,
    "sectionIndex": 4,
    "title": "If you don’t understand your assignment and you can’t reach your boss...",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=334",
    "lessonIndex": 525,
    "html": "\r\n<h1>\r\nIf you don&apos;t understand your assignment and you can&apos;t reach your boss, what would you do?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I75/sentence/I75S1.mp3\">If you don&apos;t understand your assignment and you can&apos;t reach your boss, what would you do?</a>&quot;</b><br><br>This question is seeing how you react to ambiguous situations. &#xA0;Also it checks to see how resourceful you are. &#xA0;The best way to answer this question is to provide step by step actions you would take in this situation.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I75/sentence/I75S2.mp3\">I would investigate the assignment deeper by searching for more information, asking coworkers or other managers and make the smartest decision on how to tackle the assignment.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I75/sentence/I75S3.mp3\">There are many places I can look for clarity. &#xA0;I would look through some books, or the Internet, or my peers, or even other managers. &#xA0;If I try to look for answers, most of the time I can find them.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I75/sentence/I75S4.mp3\">I would first see what the deadline is and if my manager will be back before the deadline. &#xA0;If not, then I would leave a message on my managers phone. &#xA0;Afterwards, I would ask my peers or other managers to see if they know the assignment. &#xA0;I believe investigating the assignment further will help me understand it.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I75/sentence/I75S5.mp3\">First, I would read the assignment again thoroughly to see if I missed a clue or anything. &#xA0;I could even turn to the Internet and look up other documentation if it was something like a difficult process I didn&apos;t know. &#xA0;After investigating this assignment, and I still don&apos;t understand it, then I could turn to my peers and see if anyone has done an assignment similar to the one I received. &#xA0;If my peers do not know either, then I could ask my boss&apos;s manager and verify with him. &#xA0;After exhausting these options, then I would have to make a decision on how to do the assignment and make the best decision I can on how to tackle the assignment. &#xA0;Before engaging in the assignment, I would leave a message on my boss&apos;s cell phone.</a>&quot;<br><br>There might be a better answer, but in my experience many interviewers are looking for a process of reaching a goal. &#xA0;In this example, it shows each step from beginning to end. &#xA0;Feel free to add or change these steps after thinking about it.\r\n"
}