{
    "categoryIndex": 3,
    "sectionIndex": 5,
    "title": "If you’re told to do something that you feel is illegal, what would you do?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=338",
    "lessonIndex": 529,
    "html": "\r\n<h1>\r\nIf you&apos;re told to do something that you feel is illegal, what would you do?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I79/sentence/I79S1.mp3\">If you&apos;re told to do something that you feel is illegal, what would you do?</a>&quot;</b><br><br>This is an easy answer. &#xA0;Unless you are interviewing to be a gangster, you should have a similar answer to mine.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I79/sentence/I79S2.mp3\">I would first verify if it&apos;s legal or not. &#xA0;If it is legal, then I would continue with the work. &#xA0;If it&apos;s illegal, I would not do the work and tell my manager that this work is illegal. &#xA0;I would also let Human Resources aware of the situation.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I79/sentence/I79S3.mp3\">I&apos;d verify if the work was legal or not. &#xA0;If it wasn&apos;t legal, then I&apos;d confront my manager and my manager&apos;s manager with this incident.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I79/sentence/I79S4.mp3\">I wouldn&apos;t jump to any conclusions. &#xA0;I would rather question my manager to verify if it is illegal or not. &#xA0;If I&apos;m not convinced through facts, then I would investigate through other means. &#xA0;If I find it is illegal, I will not continue with the work and inform Human <br>Resources of this incident.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I79/sentence/I79S5.mp3\">If I&apos;m not sure, I would verify whether it&apos;s legal or illegal before performing the task. &#xA0;If I find it is legal, then I would continue with the task. &#xA0;If not, then I would report the request to the boss of the person who asked me to do it. &#xA0;If the boss does not take appropriate action, I would find out why and report the incident to Human Resources myself.</a>&quot;<br><br>This is making you sound firm and stubborn. &#xA0;But in this situation, you have to be bold with your answer. &#xA0;You cannot let them think that you would hide the fact. &#xA0;This is especially true if you are interviewing for a finance or accounting position that deals with money or other important information.\r\n"
}