{
    "categoryIndex": 3,
    "sectionIndex": 5,
    "title": "If you were unfairly criticized, what would you do?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=339",
    "lessonIndex": 530,
    "html": "\r\n<h1>\r\nIf you were unfairly criticized, what would you do?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I80/sentence/I80S1.mp3\">If you were unfairly criticized, what would you do?</a>&quot;</b><br><br>This is the hardest question I have to answer here. &#xA0;Being unfairly criticized is one of my biggest pet peeves. &#xA0;I hate it when it happens and I usually blow up. &#xA0;I get mad and start to argue. &#xA0;But as you know, this is a bad answer to this question. &#xA0;They are asking you this question because they want to see if you will react professionally. &#xA0;Any answer that shows professionalism will be good.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I80/sentence/I80S2.mp3\">I&apos;d probably ask for clarity on the criticism. &#xA0;I think it&apos;s important to accept criticism for self improvement, but if it&apos;s unfair, then I will clear things up by asking for clarity.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I80/sentence/I80S3.mp3\">When I&apos;m unfairly criticized, I usually think about the criticism and try to view it from a different angle. &#xA0;If I still can&apos;t see why I was criticized, then I&apos;ll approach the person and initiate a dialog to resolve the unfair criticism.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I80/sentence/I80S4.mp3\">I usually use all criticism to help me grow. &#xA0;If I was criticized unfairly, there must be a little truth to it. &#xA0;I&apos;ll learn as much as I can from it, but if it was really out of line, I would definitely approach the person and ask for clarity.</a>&quot;<br><br><b>Long Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I80/sentence/I80S5.mp3\">If I was unfairly criticized in private, then I would initiate dialog asking why he or she thought this way. &#xA0;I would try to understand their point of view and explain my point of view. &#xA0;If I was unfairly criticized in public, then I would be a little upset but I would wait to address the problem until the person criticizing me was alone. &#xA0;I would do this because if I&apos;m upset, I wouldn&apos;t want to start an argument without thinking. &#xA0;So after some time, I would approach the person and ask him or her why I was criticized. &#xA0;If it was justified, then I would use that as constructive criticism to improve myself. &#xA0;If not, then I would tell that person that it isn&apos;t good to publicly criticize someone when they are not sure if it is correct.</a>&quot;<br><br>This is a professional answer, but it could sound like you are a weak person. &#xA0;If you want an example of becoming upset, then this is how I would get upset in a professional way.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I80/sentence/I80S6.mp3\">If I&apos;m publicly criticized unjustly, I would immediately ask that person on what grounds he or she is saying that. &#xA0;One of my pet peeves is putting someone down in public and if I don&apos;t say anything there, then this person is getting away with something terrible, and everyone there will think I did something wrong. &#xA0;I would keep my temper in check but make sure that people know the criticism wasn&apos;t justified.</a>&quot;\r\n"
}