{
    "categoryIndex": 3,
    "sectionIndex": 5,
    "title": "What are you looking to gain from your next job?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=340",
    "lessonIndex": 531,
    "html": "\r\n<h1>\r\nWhat are you looking to gain from your next job?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I81/sentence/I81S1.mp3\">What are you looking to gain from your next job?</a>&quot;</b><br><br>The answer will depend on where you are in your career. &#xA0;If you are new, then you want to gain more experience and learn a wide variety of things. &#xA0;If you have a lot of previous experience, you might want to find something challenging and more opportunities for growth.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I81/sentence/I81S2.mp3\">I want a position where I&apos;ll be challenged. &#xA0;I want to learn a lot of new things and I want to continually grow. &#xA0;So I&apos;m looking for a job that will provide these things for me.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I81/sentence/I81S3.mp3\">I want to gain experience in many areas of accounting. &#xA0;I want a position where things are not routine and where many of my accounting skills are utilized.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I81/sentence/I81S4.mp3\">In my next job, I want more opportunities to write automation. &#xA0;In my previous position, we didn&apos;t have these opportunities because we outsourced this work to other groups.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I81/sentence/I81S5.mp3\">For the last several years, I have done a wide variety of things. &#xA0;I have set my goals and continually moved forward. &#xA0;I have worked in a time constraint environment, juggled many tasks at one time, and even managed several people. &#xA0;However, one of my goals is to improve my creative side of design. &#xA0;Working for a large company demands a lot of work from each designer. &#xA0;So although creating graphics came naturally for me, I never had the luxury of creating work without being pulled in four different directions. &#xA0;So I want to find a position where I can use more of my creativity.</a>&quot;<br><br>This is a stronger answer than the generic one about learning and finding something challenging. &#xA0;This answer displays a lot of experience, ability to work hard, and the ability to deliver items quickly. &#xA0;This person answers by saying he wants to find a position where he can use more creativity, while showing off his credentials as a good worker.\r\n"
}