{
    "categoryIndex": 3,
    "sectionIndex": 5,
    "title": "If you are given work from your manager that is boring and tedious, what...",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=342",
    "lessonIndex": 533,
    "html": "\r\n<h1>\r\nIf you are given work from your manager that is boring and tedious, what will you do?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I83/sentence/I83S1.mp3\">If you are given work from your manager that is boring and tedious, what will you do?</a>&quot;</b><br><br>This is an important question for the manager. &#xA0;If you are hired on as a analyst and you have to do some data entry, you might not be happy about it. &#xA0;But if there it has to be done, then the manager has to assign the work to someone. &#xA0;They want to find out if you are the type of person who is willing to work on boring and tedious things. &#xA0;The long answer is the answer I gave when I was asked this question.<br><br><b>Short Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I83/sentence/I83S2.mp3\">If it&apos;s helping the company in any way, I don&apos;t mind doing boring work.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I83/sentence/I83S3.mp3\">My responsibility as an employee is to help the company succeed. &#xA0;If the work I&apos;m given will help the company, then I&apos;ll do the best that I can no matter if it&apos;s boring or tedious.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I83/sentence/I83S4.mp3\">I don&apos;t mind doing boring and tedious work. &#xA0;As long as I don&apos;t have to do it for a long duration such as six months, then I really wouldn&apos;t have a problem.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I83/sentence/I83S5.mp3\">I trust that management knows what is best for the project. &#xA0;Whatever work I&apos;m given, I&apos;m going to do my best knowing that it&apos;s helping the entire company. &#xA0;I&apos;m more oriented towards the success of the company and I&apos;ll do whatever it takes to help out. &#xA0;So I wouldn&apos;t mind doing boring and tedious work for awhile.</a>&quot;<br><br>This answer is showing loyalty and being able to sacrifice personal interest for the success of the company. &#xA0;Maybe it was this question that helped me pass my third interview.\r\n"
}