{
    "categoryIndex": 3,
    "sectionIndex": 5,
    "title": "How long do you plan on staying with this company?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=343",
    "lessonIndex": 534,
    "html": "\r\n<h1>\r\nHow long do you plan on staying with this company?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I84/sentence/I84S1.mp3\">How long do you plan on staying with this company?</a>&quot;</b><br><br>This question is usually asked to the people who move between jobs frequently. &#xA0;They do not want to hire someone who will leave after several months. &#xA0;The hiring process costs the company money and time and they want to hire someone who is looking to stay for awhile. &#xA0;I recommend saying you want to stay for a long time.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I84/sentence/I84S2.mp3\">To tell you the truth, I have been working and gaining experience to get into this company. &#xA0;This is where I want to be and I plan on staying a long time if I&apos;m offered the job.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I84/sentence/I84S3.mp3\">The only time I get bored is if there is no work to do. &#xA0;As long as there&apos;s a lot of work, then I&apos;ll be happy and stay a long time. &#xA0;I&apos;m a busy body and I need to do work.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I84/sentence/I84S4.mp3\">This company has everything I&apos;m looking for. &#xA0;It provides the type of work I love, the employees are all happy, and the environment is great. &#xA0;I plan on staying a long time.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I84/sentence/I84S5.mp3\">One of my goals is to obtain a position in this company. &#xA0;I know that once I start working here, it&apos;ll be for a long time.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I84/sentence/I84S6.mp3\">As far as I can tell, this company has everything I&apos;m looking for. &#xA0;I enjoy this type of work and the benefits at this company are great. &#xA0;I&apos;m looking for a long term position and if there are opportunities for advancement and growth here, then I want to stay for a long time.</a>&quot;<br><br>This is another question you can answer in a short way. &#xA0;You don&apos;t want to answer with a single line answer because it doesn&apos;t sound believable. &#xA0;So a couple of sentences explaining what you want will convince them that you want to stay for a long time.\r\n"
}