{
    "categoryIndex": 3,
    "sectionIndex": 5,
    "title": "What do you do when there is no work to do?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=346",
    "lessonIndex": 537,
    "html": "\r\n<h1>\r\nWhat do you do when there is no work to do?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I87/sentence/I87S1.mp3\">What do you do when there is no work to do?</a>&quot;</b><br><br>The interviewer wants to find out what type of person you are. &#xA0;Are you a busy body looking for work, or are you a lazy person doing only the work that they tell you to do? &#xA0;This question will determine just that so make sure you give them an answer showing your great work habits.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I87/sentence/I87S2.mp3\">I always try to be productive even if there isn&apos;t much work to do. &#xA0;I use my time to find areas of improvement within the office, take time to study new things that will help me on future projects, and volunteer to help other coworkers that might have too much work.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I87/sentence/I87S3.mp3\">Usually when I have nothing to do, I ask my manager if any of my peers need help. &#xA0;If not, then I usually spend time studying material that will help me on my next project.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I87/sentence/I87S4.mp3\">As a sales associate, there are many times when there is no work. &#xA0;But I always stay busy by cleaning and rearranging the items I&apos;m selling before customers come in.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I87/sentence/I87S5.mp3\">When I have no direct work, I always find side project such as thinking about a process of some sort that helps with office efficiency. &#xA0;One time, I created a small tool using MS Word that helped our team speed up the mailing process.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I87/sentence/I87S6.mp3\">I&apos;m a type of person who hates not having work to do. &#xA0;In my last position, I frequently asked my supervisor for more work when I finished early. &#xA0;And in times when there really is no work, I go around searching for work and if I&apos;m still unsuccessful, I&apos;ll try to make work that will make existing processes more efficient. &#xA0;So I believe there never is a time when there is no work to do.</a>&quot;<br><br>Would you want a person like this? &#xA0;I think most companies will love an employee who wants to continually work. &#xA0;So the example is the type of answer you should give.\r\n"
}