{
    "lessonIndex": 538,
    "categoryIndex": 3,
    "sectionIndex": 5,
    "title": "What do you do when there are too many things to do?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=347",
    "html": "\r\n<h1>\r\nWhat do you do when there are too many things to do?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I88/sentence/I88S1.mp3\">What do you do when there are too many things to do?</a>&quot;</b><br><br>When someone is busy, it is important to take some time to organize and prioritize the work. &#xA0;Many people just try to work faster, but that doesn&apos;t really help. &#xA0;Planning and working smarter is the best answer when times get busy.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I88/sentence/I88S2.mp3\">I usually plan, organize, prioritize and then work real hard. &#xA0;I always keep my cool and work on one item after another. &#xA0;I found that this is efficient instead of worrying about how much work there is to do.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I88/sentence/I88S3.mp3\">I really like it when there is so much work. &#xA0;I&apos;m a fast and efficient worker and I like taking challenges that are big. &#xA0;With proper planning and execution, I have always managed to complete all my tasks.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I88/sentence/I88S4.mp3\">I regain my composure, take a deep breath, and work diligently. &#xA0;If there is a chance that I might not finish something due to the size of the work item, I&apos;ll inform my manager and make sure my manager is aware of my situation.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I88/sentence/I88S5.mp3\">I believe in hard work. &#xA0;A lot can get accomplished by working diligently. &#xA0;In a situation where there are many things to do, I&apos;ll reprioritize my work, plan and organize as much as I can and work hard.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I88/sentence/I88S6.mp3\">For me, the busier it gets, the more I organize and plan. &#xA0;Some people might think I could use the time I spend in planning out my day to work on something, but I realized how efficient I can work when I organize my work ahead of time and plan out my day thoroughly. &#xA0;Also, it prevents me from panicking or from blowing up from the pressure. &#xA0;I learned from my previous manager that when there are many things to do, you should work smarter instead of faster.</a>&quot;<br><br>You can answer by saying that you will work harder or work faster or even work overtime, but people with experience knows that working smarter by planning and organizing comes from experience. &#xA0;So even if you don&apos;t have much experience, this type of answer can make you look like you have been in this type of position many times and overcame them.\r\n"
}