{
    "categoryIndex": 3,
    "sectionIndex": 5,
    "title": "What do you do when you feel burned out?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=348",
    "lessonIndex": 539,
    "html": "\r\n<h1>\r\nWhat do you do when you feel burned out?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I89/sentence/I89S1.mp3\">What do you do when you feel burned out?</a>&quot;</b><br><br>If you never burn out, then you are either superman or you don&apos;t work that hard. &#xA0;It is ok to admit to burning out at times, and you should provide an answer that shows how you deal with the times when you do get burned out.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I89/sentence/I89S2.mp3\">I think it&apos;s important to anticipate being burned out before it happens. &#xA0;But if a deadline requires me to work so much that I end up being burned out, I try to relax myself and get reenergized by not thinking about work at home and watching a good movie.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I89/sentence/I89S3.mp3\">When I feel burned out, I go to the gym and work out. &#xA0;This actually helps me because it moves the focus from my mind to my body. &#xA0;After a good work out, I really feel mentally rejuvenated.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I89/sentence/I89S4.mp3\">I usually use the weekends to engage in my personal hobbies to prevent me from burning out. &#xA0;I like to play tennis and golf, and these activities keep me mentally energized to work hard in the office.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I89/sentence/I89S5.mp3\">I try to prevent burning out by maintaining a healthy balanced life. &#xA0;I try to engage in personal hobbies outside of work such as playing the guitar or going for a hike. &#xA0;They keep me energized to work hard in the office. &#xA0;But if I do feel burned out, I like to rent a movie and relax for the night.</a>&quot;<br><br>As you can tell, this is an easy answer. &#xA0;Many times a person who constantly works without a break can eventually become a bad employee by burning out. &#xA0;Being able to communicate exactly what you do during burnouts or how to prevent them indicates that you have balance. &#xA0;So simply listing a couple of hobbies and adding, &apos;keeps me energized to work hard in the office&apos; is a good enough answer that the interviewer will accept.\r\n"
}