{
    "lessonIndex": 545,
    "categoryIndex": 3,
    "sectionIndex": 6,
    "title": "What do you do when you have a problem with a direct?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=354",
    "html": "\r\n<h1>\r\nWhat do you do when you have a problem with a direct?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I95/sentence/I95S1.mp3\">What do you do when you have a problem with a direct?</a>&quot;</b><br><br>This is more of a question for management. &#xA0;There are multiple ways you can answer this, but you should show that you are responsible and that you know how to resolve these types of problems.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I95/sentence/I95S2.mp3\">I believe in open communication. &#xA0;I always analyze the problem and then tell my direct clearly. &#xA0;I always provide steps that we both can take to deal with the problem. &#xA0;This approach helps me because it shows my respect.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I95/sentence/I95S3.mp3\">In this situation, I believe communication is very important. &#xA0;I&apos;ll usually have a meeting with my direct on the problems I have. &#xA0;It&apos;s easier to work on a problem together when everyone involved is aware, so I always communicate the problems that I see.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I95/sentence/I95S4.mp3\">I believe feedback is important to solve problems with a direct. &#xA0;I meet with my directs regularly and always provide suggestions on how to improve. &#xA0;I also use this time to work out problems we might have. &#xA0;It&apos;s important to let my directs know where I stand so they don&apos;t have to make assumptions.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I95/sentence/I95S5.mp3\">Because I&apos;m the manager, I feel it&apos;s my responsibility to improve the relationship. &#xA0;If the problem is work related, I&apos;ll narrow the problem down whether it&apos;s with his working style or another type of problem and assist in anyway I can. &#xA0;This would also involve providing feedback and suggestions on how to approach problems. &#xA0;But if our personality&apos;s conflict then I would try to be more understanding.</a>&quot;\r\n"
}