{
    "categoryIndex": 3,
    "sectionIndex": 6,
    "title": "How do you get along…",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=363",
    "lessonIndex": 554,
    "html": "\r\n<h1>\r\nHow do you get along...\r\n</h1>\r\n<b>How do you get along...</b><br><br>This isn&apos;t a very popular question because it&apos;s hard to learn about the person answering. &#xA0;The answers are all going to be the same. &#xA0;It&apos;s just a matter of how you say it. &#xA0;Because there isn&apos;t anything exciting to say here, you should show friendly characteristics so it is believable. &#xA0;These answers can be short. &#xA0;It really doesn&apos;t matter how long the answer is but you have to make sure you show your friendliness through your voice.<br><br><br><b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I104/sentence/I104S1.mp3\">How do you get along with your subordinates?</a>&quot;</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I104/sentence/I104S2.mp3\">My relationship with my directs is very good. &#xA0;They&apos;re very open and honest with me and I&apos;m sure they feel they can come to me with any problems.</a>&quot;<br><br><b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I104/sentence/I104S3.mp3\">How do you get along with your co-workers?</a>&quot;</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I104/sentence/I104S4.mp3\">I&apos;ve always had an easy time getting along with different types of people. &#xA0;So I never had a problem getting along with my co-workers. &#xA0;I consider many of them my friends.</a>&quot;<br><br><b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I104/sentence/I104S5.mp3\">How do you get along with your superiors?</a>&quot;</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I104/sentence/I104S6.mp3\">I&apos;ve had my share of great managers and mediocre managers, but I&apos;ve always gotten along with all of them very well. &#xA0;I&apos;ve rarely had conflicts with them and if there was an issue, I always talked it over with them.</a>&quot;\r\n"
}