{
    "categoryIndex": 4,
    "sectionIndex": 0,
    "title": "Airport - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=394",
    "lessonIndex": 582,
    "html": "<h1>At the Airport - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/T4/practice/T4P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/T4/practice/T4P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/T4/practice/T4P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Welcome. May I have your tickets?&quot;<br>B: &quot;Here you go.&quot;<br>A: &quot;Is anybody else traveling with you two?&quot;<br>B: &quot;No. It&apos;s just us.&quot;<br>A: &quot;Do you have your passports with you?&quot;<br>B: &quot;Yes. Here it is.&quot;<br>A: &quot;I&apos;m going to ask you a series of questions. Please respond with a yes or a no.&quot;<br>B: &quot;Ok.&quot;<br>A: &quot;Did someone you do not know ask you to take something on the plane with you?&quot;<br>B: &quot;No.&quot;<br>A: &quot;Did you have possession of your luggage since you packed?&quot;<br>B: &quot;Yes.&quot;<br>A: &quot;Did you leave your luggage unattended at all in the airport?&quot;<br>B: &quot;No.&quot;<br>A: &quot;Are you carrying any weapons or firearms?&quot;<br>B: &quot;No.&quot;<br>A: &quot;Are you carrying any flammable material?&quot;<br>B: &quot;No.&quot;<br>A: &quot;Do you have any perishable food items?&quot;<br>B: &quot;No.&quot;<br>A: &quot;Great. Can you place your baggage over here?&quot;<br>B: &quot;Sure.&quot;<br>A: &quot;Would you like an aisle or a window seat?&quot;<br>B: &quot;Window seat please.&quot;<br>A: &quot;Ok. I am placing you two in 21A and 21B. The gate number is C2. It is on the bottom of the ticket. They will start boarding 20 minutes before the departure time. C2 is located around the corner through the hall. Thank you.&quot;<br>B: &quot;Can you point me to gate C2?&quot;<br>A: &quot;Sure. It&apos;s that way. Around that corner.&quot;<br>B: &quot;Great. Thank you.&quot;<br></td></tr></table>"
}