{
    "lessonIndex": 606,
    "categoryIndex": 4,
    "sectionIndex": 4,
    "title": "Restaurant - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=421",
    "html": "<h1>At the Restaurant - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/T25/practice/T25P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/T25/practice/T25P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/T25/practice/T25P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Welcome to McDonald&apos;s. May I take your order?&quot;<br>B: &quot;I&apos;ll take the number one.&quot;<br>A: &quot;What size would you like?&quot;<br>B: &quot;Medium please.&quot;<br>A: &quot;Will that be for here or to go?&quot;<br>B: &quot;Here please.&quot;<br>A: &quot;The total comes to $4.89. We&apos;ll have that right out for you.&quot;<br><br></td></tr><tr><td>2 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/T25/practice/T25P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/T25/practice/T25P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/T25/practice/T25P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Can I get a drink started for you?&quot;<br>B: &quot;I&apos;ll take a coke.&quot;<br>A: &quot;One coke. I&apos;ll be right out with your coke.&quot;<br> --Pause-- &quot;Here&apos;s is your coke. Are you ready to order?&quot;<br>B: &quot;Can I have one more minute?&quot;<br>A: &quot;Sure. I&apos;ll be back in a little bit.&quot;<br> --Pause-- &quot;Do you need more time?&quot;<br>B: &quot;I&apos;m ready now. I&apos;ll have the Patty Melt with fries.&quot;<br>A: &quot;Do you want regular fries or steak fries?&quot;<br>B: &quot;Steak fries please.&quot;<br>A: &quot;I&apos;ll have that out for you in a few minutes.&quot;<br> --Pause-- &quot;Here you go. Do you need anything else?&quot;<br>B: &quot;Can I have a bottle of ketchup?&quot;<br>A: &quot;I have one right here.&quot;<br>B: &quot;Great. Thanks.&quot;<br>A: &quot;Is everything ok here?&quot;<br>B: &quot;Yes. Thank you.&quot;<br> --Pause-- &quot;Excuse me. Can I have my bill?&quot;<br>A: &quot;Sure. Here you go.&quot;<br></td></tr></table>"
}