{
    "lessonIndex": 613,
    "categoryIndex": 4,
    "sectionIndex": 6,
    "title": "Starting a Conversation",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=429",
    "html": "\r\n<h1>\r\nStarting a Conversation\r\n</h1>\r\nThe best time to start a conversation is when you are next to someone who is not moving. &#xA0;You can&apos;t start talking to someone walking away from you. &#xA0;Then you are bothering them by making them stop. &#xA0;But if you are sitting down on a bench and someone is next to you, or you are at a beach and someone is close by, you can start a conversation by saying something generic. &#xA0;Here are some conversation starting sentences. &#xA0;But after you make your first sentence, you should see by their reaction if they want to continue the conversation or not. &#xA0;If they appear a little rude, then stop talking to them. &#xA0;You don&apos;t have to say anything to stop talking. &#xA0;They don&apos;t expect you to. &#xA0;They expect you to not say another word. &#xA0;But if they ask a question back, and they seem friendly, then you can continue with the conversation.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/T31/sentence/T31S1.mp3\">The weather is so nice today. &#xA0;Are you from around here?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/T31/sentence/T31S2.mp3\">How is your day going so far?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/T31/sentence/T31S3.mp3\">There are a lot of people out here today. &#xA0;Is this normal?</a>&quot;<br><br>An easy way to start talking is when you notice something such as their kids, family, or a dog they might be with.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/T31/sentence/T31S4.mp3\">Are you here with your family?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/T31/sentence/T31S5.mp3\">Are you on vacation?</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/T31/sentence/T31S6.mp3\">Are those your kids? &#xA0;They&apos;re so cute?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/T31/sentence/T31S7.mp3\">What kind of dog is that?</a>&quot;<br><br>It&apos;s much easier if they start the conversation. &#xA0;If they make a comment or ask a question, then you know that they would like to talk.<br><br>Finally, it&apos;s common for these types of conversation to last only a couple of minutes. &#xA0;So don&apos;t feel bad or feel pressured to keep the conversation alive.<br><br>There isn&apos;t that much more to tell you about speaking with strangers. &#xA0;The best way to understand what types of things are said in a stranger to stranger conversation is to hear a couple of examples. &#xA0;I will give a couple examples to help you understand more.\r\n"
}