{
    "lessonIndex": 897,
    "categoryIndex": 7,
    "sectionIndex": 1,
    "title": "Perfect Progressive Tense\r\n",
    "link": "http://www.talkenglish.com/Grammar/perfect-progressive-tense.aspx",
    "html": "<h1>Perfect Progressive Tense\r\n</h1>The perfect progressive tense describes actions that repeated over a period of time in the past, are continuing in the present, and/or will continue in the future.<br><br>The present perfect progressive tense tells you about a continuous action that was initiated in the past and finished at some point in the past; however, the action has some relation to the present time. Use <i>have/has + been + ing</i>.<br><br><ul><li>It has been raining, and the street is still wet.</li><li>I have been running, and I am still tired.</li><li>She has been practicing the piano, and she is much better now.</li></ul>The past perfect progressive tense illustrates a continuous action in the past that was completed before another past action. Use <i>had + been + ing</i>.<br><br><ul><li>It had been raining, and the street was still wet.</li><li>I had been running, and I was still tired.</li><li>She had been practicing the piano, and she had gotten much better.</li></ul>The future perfect progressive tense indicates a continuous action that will be completed in the future. Use <i>will + have + been + ing</i>.<br><br><ul><li>By tonight, it will have been raining several hours, and the street will be very wet.</li><li>By next summer, I will have been running for almost a year, and I will be fit and healthy.</li><li>By the time of the concert, she will have been practicing the piano for several months, and she will be much better.</li></ul><br><b><font size=\"3\">[Quiz 12.1]</font></b><br><br>Choose the incorrect sentence from the following.<br><br>1)I have been sleeping all day today.<br>2)They will have been walking for almost an hour by the time they arrive at their destination.<br>3)She have been eating a lot recently.<br><br><a href=\"javascript:showHide(&apos;div1&apos;)\"><font size=\"3\"><b>View Answers</b></font></a><div id=\"div1\" style=\"DISPLAY: none\">[12.1]<br>3) have -&gt; has<br></div>"
}