{
    "categoryIndex": 7,
    "sectionIndex": 1,
    "title": "Active Voice and Passive Voice",
    "link": "http://www.talkenglish.com/Grammar/active-passive-voice.aspx",
    "lessonIndex": 902,
    "html": "<h1>Active Voice and Passive Voice</h1>Verbs are either active or passive in voice. In the active voice, the subject and verb relationship is straightforward: the subject is a do-er. In the passive voice, the subject of the sentence is not a do-er. It is shown with by + do-er or is not shown in the sentence.<br>Passive voice is used when the action is the focus, not the subject. It is not important (or not known) who does the action. <br><br><ul><li>The window is broken. (It is not known who broke the window, or it is not important to know who broke the window.)</li><li>The class has been canceled. (The focus is on the class being canceled. It is not important to know who canceled it.)</li><li>The passive voice is often used. (The focus is on the passive voice. It is not important to explain who the writer is.)</li></ul>Passive voice should be avoided when you want more clarity in writing. However, in some cases, you need to use passive voice to stress the action, not the actor. Also, passive voice can be considered more polite, as it sounds less aggressive or dramatic. <br><br><ul><li>That building was built in 1990.</li><li>The car was invented about a hundred years ago.</li><li>I was told that Mary moved to a different country.</li><li>Your business is appreciated.</li><li>She was elected to city council.</li><li>It was rumored that the company would lay off a few people soon.</li><li>It is recommended that the billing process be shortened.</li></ul>You can easily rewrite an active sentence to a passive sentence. The object in the active sentence becomes a subject in the passive sentence. The verb is changed to a &#x201C;be&#x201D; verb + past participle. The subject of the active sentence follows by or is omitted. <br><br><ul><li>Sam wrote a letter to Jamie.</li><li>A letter was written to Jamie by Sam.</li><br><br><li>The government built a new bridge.</li><li>A new bridge was built by the government.</li><br><br><li>I recommend that you apply for this position.</li><li>It is recommended that you apply for this position.</li></ul><br><b><font size=\"3\">[Quiz 17.1]</font></b><br><br>Rewrite the following sentence in passive voice.<br><br>John gave me a bunch of flowers on my birthday.<br><br><b><font size=\"3\">[Quiz 17.2]</font></b><br><br>Choose the sentences written incorrectly in the passive voice.<br><br>1)I was eaten an ice cream.<br>2)The song was sung by a singer.<br>3)I was deceived by the TV program.<br>4)The concert was finished at 12 p.m.<br>5)He was written a novel.<br>6)The tennis match was aired on TV.<br>7)He was treated kindly.<br>8)I have been managed a company since 2004.<br><br><a href=\"javascript:showHide(&apos;div1&apos;)\"><font size=\"3\"><b>View Answers</b></font></a><div id=\"div1\" style=\"DISPLAY: none\">[17.1]<br>I was given a bunch of flowers on my birthday by John.<br>OR<br>A bunch of flowers was given to me on my birthday by John.<br><br>[17.2]<br>1) I ate an ice cream.<br>5) He wrote a novel.<br>8) I have managed a company since 2004.<br></div>"
}