{
    "lessonIndex": 112,
    "categoryIndex": 1,
    "sectionIndex": 0,
    "title": "Weather - Long Description",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=544",
    "html": "\r\n<h1>\r\nWeather - Long Description\r\n</h1>\r\nBeing able to speak specific sentences is good, however, it is more important to be able to say a whole paragraph when talking about topics such as the weather. &#xA0;I&apos;ll have a specific lesson about putting sentences together in a future lesson. &#xA0;But I&apos;ll give one advice now. &#xA0;Basically, make about 10 sentences. &#xA0;After you know your ten sentences about this question, you can say all of them one after the other so it is a long answer. &#xA0;The ten sentences should be in a list format.<br><br>We will learn how to speak longer in a future lesson, but if you want to give it a try now, here are two examples.<br><br>Question: &#xA0;&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L19/sentence/L19S1.mp3\">What is the weather like in Korea?</a>&quot;<br>Answer: &#xA0;&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L19/sentence/L19S2.mp3\">Well, the weather in Korea is unique with four distinct seasons. &#xA0;In the winter, the temperature is about zero degrees Celsius. &#xA0;But, because it doesn&apos;t rain much in the winter, there isn&apos;t much snow and the air is very dry. &#xA0;In spring, the days warm up significantly but the night gets a little chilly. &#xA0;The summer has two characteristics. &#xA0;It is very hot and humid most of the time, and for about 3 weeks or so, we have a rainy season called monsoon. &#xA0;It gets very rainy and windy during that time period. &#xA0;But we all look forward to autumn. &#xA0;It is a beautiful time of year and the temperature is very pleasant. &#xA0;If you plan on visiting Korea, I highly recommend visiting during autumn.</a>&quot;<br><br>Question: &#xA0;&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L19/sentence/L19S3.mp3\">Which season do you like the most?</a>&quot;<br>Answer: &#xA0;&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L19/sentence/L19S4.mp3\">I like summer the most, but at the same time, I hate it. &#xA0;I like summer because it&apos;s warm. &#xA0;I don&apos;t mind the heat and I like the longer days. &#xA0;So, I can do more activities like swimming, bicycling, rollerblading, and many other outdoor activities. &#xA0;I usually take a short vacation during the summer so I always look forward to that. &#xA0;However, the part about summer I hate the most is during the monsoon season. &#xA0;I can tolerate the humidity, but when it gets hot and humid along with the rain and the wind, then it gets terrible.</a>&quot;\r\n"
}