{
    "categoryIndex": 1,
    "sectionIndex": 1,
    "title": "Small Talk - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=549",
    "lessonIndex": 116,
    "html": "<h1>Small Talk - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L21/practice/L21P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L21/practice/L21P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L21/practice/L21P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Paul. What are you doing here?&quot;<br>B: &quot;How&apos;s it going? I&apos;m meeting up with a friend here.&quot;<br>A: &quot;How have you been man?&quot;<br>B: &quot;Not too bad. I&apos;m still in school and having a little fun.&quot;<br>A: &quot;How are you enjoying Mr. Lee&apos;s history class?&quot;<br>B: &quot;It&apos;s so boring.&quot;<br>A: &quot;Tell me about it. If it wasn&apos;t a requirement, I wouldn&apos;t have taken it.&quot;<br>B: &quot;How about you? What have you been up to?&quot;<br>A: &quot;I finished school last spring. I&apos;m searching for a job now, but I&apos;m slacking off.&quot;<br>B: &quot;I heard the job market is not that hot right now.&quot;<br>A: &quot;I could always take a low end job, but I&apos;m not that desperate yet.&quot;<br>B: &quot;Well, good luck to you.&quot;<br>A: &quot;Thanks. It was good seeing you again.&quot;<br>B: &quot;Yeah. I&apos;ll catch you later.&quot;<br>A: &quot;Have a good night.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L21/practice/L21P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L21/practice/L21P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L21/practice/L21P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;You&apos;re John right?&quot;<br>B: &quot;Yes. Oh, you&apos;re in my English class right?&quot;<br>A: &quot;Yeah. I&apos;m Martha.&quot;<br>B: &quot;Well it&apos;s good to finally meet you.&quot;<br>A: &quot;How are you enjoying the class?&quot;<br>B: &quot;I&apos;m not sure. Some days it seems ok, but other days I am totally bored in class.&quot;<br>A: &quot;I know what you mean. Do you know what is wrong with the weather these days? I haven&apos;t seen the sun in 2 weeks.&quot;<br>B: &quot;The weather has been pretty terrible recently.&quot;<br>A: &quot;I&apos;m really hoping the weather gets better.&quot;<br>B: &quot;Do you have something coming up?&quot;<br>A: &quot;To tell you the truth, it&apos;s just depressing seeing so much rain.&quot;<br>B: &quot;I don&apos;t blame you. It has been pretty gloomy for sometime now.&quot;<br>A: &quot;This is my stop. I&apos;ll see you later.&quot;<br>B: &quot;I&apos;ll see you in class. Bye.&quot;<br><br></td></tr></table>"
}