{
    "categoryIndex": 1,
    "sectionIndex": 1,
    "title": "Exercise - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=824",
    "lessonIndex": 136,
    "html": "<h1>Exercise - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L36/practice/L36P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L36/practice/L36P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L36/practice/L36P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Michael. Where are you going?&quot;<br>B: &quot;No where special. I was just taking a walk.&quot;<br>A: &quot;What for?&quot;<br>B: &quot;To get a little exercise. I&apos;m so out of shape.&quot;<br>A: &quot;Hey, I play basketball with a bunch of friends twice a week. It&apos;s great exercise and it&apos;s fun too. Why don&apos;t you come out and play with us?&quot;<br>B: &quot;That sounds great. Give me a call next time you guys play.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L36/practice/L36P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L36/practice/L36P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L36/practice/L36P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;All I do all day is work and watch TV. I really should start thinking about my health.&quot;<br>B: &quot;I never thought about that, but you&apos;re right. What do you think we should do?&quot;<br>A: &quot;For starters, we should start doing more outdoor activities. That way we&apos;ll get some exercise.&quot;<br>B: &quot;I was thinking about taking tennis lessons. I always have an hour to spare in the afternoon. What do you think about that?&quot;<br>A: &quot;That&apos;s not a bad idea. How much is it?&quot;<br>B: &quot;I heard it is only about one hundred twenty dollars a month for 8 lessons.&quot;<br>A: &quot;Playing tennis twice a week will be a good start. Count me in.&quot;<br></td></tr></table>"
}