{
    "lessonIndex": 140,
    "categoryIndex": 1,
    "sectionIndex": 1,
    "title": "Exercise Gym - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=580",
    "html": "<h1>Exercise Gym - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L39/practice/L39P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L39/practice/L39P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L39/practice/L39P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;What do you do besides work and watching TV?&quot;<br>B: &quot;When I have some time, I like to exercise.&quot;<br>A: &quot;Do you go jogging or do you go to a health club?&quot;<br>B: &quot;I joined Samsung Health Club a couple of months ago.&quot;<br>A: &quot;How do you exercise?&quot;<br>B: &quot;I usually spend 30 minutes on the bicycle for the cardio, and then I lift weights for about 45 minutes.&quot;<br>A: &quot;How often do you go?&quot;<br>B: &quot;I want to go four times a week, but I&apos;m too lazy. Last week, I only went to workout once.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L39/practice/L39P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L39/practice/L39P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L39/practice/L39P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Jimmy. Let&apos;s go workout later today.&quot;<br>B: &quot;Sure. What time do you want to go?&quot;<br>A: &quot;How about at 3:30.&quot;<br>B: &quot;That sounds good. Today we work on Legs and forearm.&quot;<br>A: &quot;Hey. I just played basketball earlier, so my legs are a little sore. Let&apos;s work out on arms and stomach today.&quot;<br>B: &quot;I&apos;m on a weekly schedule. You&apos;re messing everything up.&quot;<br>A: &quot;C&apos;mon. We&apos;re only switching two days. You can do legs on Friday.&quot;<br>B: &quot;Aright. I&apos;ll meet you at the gym at 3:30 then.&quot;<br><br></td></tr><tr><td>3 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L39/practice/L39P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L39/practice/L39P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L39/practice/L39P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Damn Scott. You got big.&quot;<br>B: &quot;Yeah, I&apos;ve been working out a lot.&quot;<br>A: &quot;How long have you been lifting weights?&quot;<br>B: &quot;For a year and a half.&quot;<br>A: &quot;Yeah. Last time I saw you, it was like 2 years ago.&quot;<br>B: &quot;Has it been that long?&quot;<br>A: &quot;How often do you go to the gym?&quot;<br>B: &quot;I usually go every other day for about 3 hours.&quot;<br>A: &quot;That&apos;s a lot.&quot;<br>B: &quot;Yeah, I used to work out for an hour a day 4 times a week, and I saw no results. This is what you have to do to get noticeable results.&quot;<br>A: &quot;I don&apos;t think I have the discipline for that.&quot;<br>B: &quot;Just think of it as a hobby. Then it&apos;s actually fun.&quot;<br></td></tr></table>"
}