{
    "lessonIndex": 156,
    "categoryIndex": 1,
    "sectionIndex": 2,
    "title": "Examinations - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=597",
    "html": "<h1>Examinations - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L51/practice/L51P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L51/practice/L51P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L51/practice/L51P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Did you already take the history exam?&quot;<br>B: &quot;Yeah. It was hard. When do you take it?&quot;<br>A: &quot;I take it tomorrow morning. There is so much material, that I don&apos;t know what to emphasize on. What types of questions did you get?&quot;<br>B: &quot;Mostly on the civil war. You should also study the impact Martin Luther King Jr. had on American society.&quot;<br>A: &quot;How about Abraham Lincoln? Did you get any questions about him?&quot;<br>B: &quot;I only had 1 question about him. But you might get more. I don&apos;t know if he will have the same exam or not.&quot;<br>A: &quot;Hopefully he will use the same exam, cause I&apos;m going to spend most of my time studying the civil war. It is a huge section and that is what he lectured the most on in class.&quot;<br>B: &quot;If you can&apos;t study everything, then that is probably the best way to go.&quot;<br>A: &quot;Aright. Thanks for the info. I gotta go to the library now.&quot;<br>B: &quot;Good luck.&quot;<br>A: &quot;Thanks. See ya.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L51/practice/L51P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L51/practice/L51P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L51/practice/L51P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Jack. You look tired. What&apos;s going on?&quot;<br>B: &quot;It&apos;s finals week and I have been up all night studying.&quot;<br>A: &quot;How many exams do you have left?&quot;<br>B: &quot;Three more to go?&quot;<br>A: &quot;Have you been keeping up, or are you cramming everything?&quot;<br>B: &quot;If I was keeping up, I wouldn&apos;t need to stay up all night.&quot;<br>A: &quot;Ha ha ha. Looks like you are in for a tough week.&quot;<br>B: &quot;Tell me about it. How about you? What have you been up to?&quot;<br>A: &quot;I finished my last final this morning.&quot;<br>B: &quot;So you&apos;re completely done?&quot;<br>A: &quot;No. I have one more report that is due this Friday. I haven&apos;t started it yet, but it shouldn&apos;t be too tough.&quot;<br>B: &quot;How many pages do you have to write?&quot;<br>A: &quot;It&apos;s a 10 page paper on habitual behavior for psychology 211.&quot;<br>B: &quot;You wanna take one of my exams for me?&quot;<br>A: &quot;I would if I could, but you know that&apos;s not possible.&quot;<br>B: &quot;Yeah, I know.&quot;<br>A: &quot;If you need help with your chemistry class, I can help you over the weekend.&quot;<br>B: &quot;That would be great.&quot;<br>A: &quot;Let&apos;s get together Saturday around lunch time.&quot;<br>B: &quot;You don&apos;t know how much this means to me. Thanks.&quot;<br>A: &quot;Don&apos;t mention it. I&apos;ll see you on Saturday.&quot;<br></td></tr></table>"
}