{
    "categoryIndex": 1,
    "sectionIndex": 3,
    "title": "Fraternity and Sorority - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=606",
    "lessonIndex": 165,
    "html": "<h1>Fraternity and Sorority - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L58/practice/L58P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L58/practice/L58P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L58/practice/L58P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey John. How are you doing?&quot;<br>B: &quot;I&apos;m doing great. How about you?&quot;<br>A: &quot;Me too. I just finished moving into the dormitory. It seems alright.&quot;<br>B: &quot;Oh man. You should have joined a fraternity.&quot;<br>A: &quot;You&apos;re in a fraternity? Which one?&quot;<br>B: &quot;I&apos;m with Delta Tau Delta. It is going to be so much fun.&quot;<br>A: &quot;How much does it cost?&quot;<br>B: &quot;I have to pay $475 a month. It comes with two meals (a day) though.&quot;<br>A: &quot;Damn. That&apos;s the same price I&apos;m paying for the dormitory. How often do they take new members?&quot;<br>B: &quot;Every semester. When they start recruiting, I&apos;ll be sure to let you know.&quot;<br>A: &quot;That would be great.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L58/practice/L58P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L58/practice/L58P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L58/practice/L58P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hi, I was looking to join a sorority. Where can I find information about your sorority?&quot;<br>B: &quot;What would you like to know?&quot;<br>A: &quot;How many people are in this sorority?&quot;<br>B: &quot;We have 72 ladies so far. We have room for 28 more girls.&quot;<br>A: &quot;How often do you have parties here?&quot;<br>B: &quot;Only about once a month.&quot;<br>A: &quot;Do you provide meals here?&quot;<br>B: &quot;We provide breakfast and dinner every Monday through Friday.&quot;<br>A: &quot;Can I take a tour of the place?&quot;<br>B: &quot;Sure. I can show you around.&quot;<br>A: &quot;Wow. It looks great here. What do I need to do to get in?&quot;<br>B: &quot;You need to fill out this application, and then we will call you for an interview. If you pass the interview, then you will have to go through initiation.&quot;<br>A: &quot;What is involved in the initiation?&quot;<br>B: &quot;That&apos;s a secret.&quot;<br></td></tr></table>"
}