{
    "categoryIndex": 1,
    "sectionIndex": 3,
    "title": "Drinking - Terminologies",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=615",
    "lessonIndex": 174,
    "html": "\r\n<h1>\r\nDrinking - Terminologies\r\n</h1>\r\nMany countries have drinking rules such as using two hands to receive drinks, never allowing your drinking friend to pour their own drinks, never leaving a glass empty too long, and so on. &#xA0;But in America, there isn&apos;t that many rules you need to know. &#xA0;I&apos;ll cover as much as I can and soon enough, you shouldn&apos;t have any problems talking while drinking in America. &#xA0;(I do not know the drinking etiquettes of other English speaking countries such as England, so learn about drinking rules before going there)<br><br>In a Bar<br>There are a few terminologies you have to learn. <br><br>Tap - Beer in a glass that is from a large container<br>Well - Same as Tap. &#xA0;Different wording<br>Pint - This is 16 fluid ounces. &#xA0;This roughly translates to 500cc.<br>Bottles - Bottles of beer<br>Pitchers - Same as Tap, but put in a pitcher<br>Mixed Drinks - Special Drinks like a mixture of Vodka and Orange Juice. &#xA0;They have names for these such as Fuzzy Navel, Rum and Coke, Buttery Nipple, Gin and tonic, and so on.<br>Wine - Red or white. &#xA0;Bottle or glass<br>Shots - Hard alcohol in small shot glass <br>On the Rocks - Hard alcohol in a bigger glass with ice<br>Straight Up - Used when ordering a hard alcohol. &#xA0;Specifying that you do not want ice<br>Double - Two shots in a bigger glass<br>Round - Used in groups when ordering together. &#xA0;<br>Bottoms up - One shot. &#xA0;Drink everything in your glass<br>Cheers - Word used before hitting glasses together before drinking<br>Champagne - Carbonated wine used in special occasions such as weddings.<br>Toast - A person usually makes a speech at a special occasion with glasses raised before all taking a drink together. &#xA0;Usually with champagne\r\n"
}