{
    "categoryIndex": 1,
    "sectionIndex": 3,
    "title": "College Related Topics Review - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=621",
    "lessonIndex": 180,
    "html": "<h1>College Related Review - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L69/practice/L69P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L69/practice/L69P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L69/practice/L69P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey John. I didn&apos;t know you were coming to this school.&quot;<br>B: &quot;Yeah, what a coincidence. It&apos;s good to see you.&quot;<br>A: &quot;It&apos;s been a while hasn&apos;t it?&quot;<br>B: &quot;What have you been up to?&quot;<br>A: &quot;Not much. Just school and stuff.&quot;<br>B: &quot;Where are you going now?&quot;<br>A: &quot;I&apos;m going to the registration building to see if I can withdrawal from one of my classes.&quot;<br>B: &quot;Are you bombing the class or something?&quot;<br>A: &quot;Partially that, but mostly it&apos;s a boring class and I am getting nothing out of it.&quot;<br>B: &quot;Where are you off to?&quot;<br>A: &quot;I finished class for today so I am meeting my girlfriend to watch a movie?&quot;<br>B: &quot;What are you watching?&quot;<br>A: &quot;The Lord of the Rings. I haven&apos;t seen it yet. Have you?&quot;<br>B: &quot;Yeah, I saw that about a month ago. It was really good.&quot;<br>A: &quot;Don&apos;t tell me anything about it. I don&apos;t want to ruin the surprise.&quot;<br>B: &quot;No problem. Hey, what are you doing this weekend?&quot;<br>A: &quot;Nothing really. I was going to rent a video and just hang out at home.&quot;<br>B: &quot;My fraternity is going to have a party on Saturday night. Wanna come?&quot;<br>A: &quot;Hey, that sounds like fun. What fraternity are you in?&quot;<br>B: &quot;I&apos;m over at the Delta Fraternity house.&quot;<br>A: &quot;Cool. Give me your number and I&apos;ll call you Saturday.&quot;<br>B: &quot;It&apos;s 206-555-1212.&quot;<br>A: &quot;Aright. I&apos;ll see you on Saturday.&quot;<br>B: &quot;See you later.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L69/practice/L69P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L69/practice/L69P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L69/practice/L69P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;You&apos;re Jason right?&quot;<br>B: &quot;Yeah. Tom right?&quot;<br>A: &quot;Yeah. What&apos;s going on?&quot;<br>B: &quot;Not much. Just hanging out. A bunch of guys are playing a game for shots.&quot;<br>A: &quot;You&apos;re not playing?&quot;<br>B: &quot;I had enough to drink already.&quot;<br>A: &quot;I hear ya.&quot;<br>B: &quot;You in school or do you work?&quot;<br>A: &quot;I work at a marketing company. How about you?&quot;<br>B: &quot;I&apos;m still in school. I have one more year left.&quot;<br>A: &quot;What are you majoring in?&quot;<br>B: &quot;I&apos;m majoring in computer science.&quot;<br>A: &quot;Where do you want to work?&quot;<br>B: &quot;I would love to work at Microsoft. But it&apos;s pretty tough to get in.&quot;<br>A: &quot;So I hear. So you come to this club often?&quot;<br>B: &quot;Every now and then. I usually hang out at Pioneer Square.&quot;<br>A: &quot;Yeah. That&apos;s a cool place. There are a ton of bars to hit in that area.&quot;<br>B: &quot;Are you here with Mike?&quot;<br>A: &quot;No. Some of my work buddies. I haven&apos;t seen Mike in a while now. Do you know what he is up to?&quot;<br>B: &quot;He&apos;s going to grad school.&quot;<br>A: &quot;What a surprise. I didn&apos;t know he was so studious.&quot;<br>B: &quot;Yeah. Surprised us all. Hey, I&apos;m going to get another drink. You want one?&quot;<br>A: &quot;It&apos;s aright. I still have to work on this one.&quot;<br>B: &quot;I&apos;ll catch you later.&quot;<br>A: &quot;Aright man.&quot;<br><br></td></tr><tr><td>3 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L69/practice/L69P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L69/practice/L69P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L69/practice/L69P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hi. My name is Robert.&quot;<br>B: &quot;I&apos;m John. It&apos;s nice to meet you.&quot;<br>A: &quot;Do you know what this professor is like?&quot;<br>B: &quot;I have no idea. This is my first year.&quot;<br>A: &quot;You a freshman? Me too. Where are you from?&quot;<br>B: &quot;I&apos;m from San Francisco.&quot;<br>A: &quot;I&apos;ve been there a few times. It&apos;s a great city.&quot;<br>B: &quot;Where are you from?&quot;<br>A: &quot;I grew up in this area all my life.&quot;<br>B: &quot;So you know where all the fun places to hang out right?&quot;<br>A: &quot;Yeah. The best place is over by the water. They have a lot of clubs and bars.&quot;<br>B: &quot;I drove by that area before. I didn&apos;t know it was a college hang-out.&quot;<br>A: &quot;It gets pretty wild over there sometimes. You should go.&quot;<br>B: &quot;Sounds like a good idea. Do you know what you are majoring in yet?&quot;<br>A: &quot;Not yet. I&apos;m leaning towards business, but that&apos;s only if I can&apos;t get into computer science. How about you?&quot;<br>B: &quot;I want to go to med school, so I&apos;ll probably end up majoring in biology.&quot;<br>A: &quot;That&apos;s cool.&quot;<br>B: &quot;Is the weather this bad all the time in the fall?&quot;<br>A: &quot;Yap. This is a typical autumn. It gets worse though. At least it&apos;s not raining that much.&quot;<br>B: &quot;That sucks.&quot;<br>A: &quot;You&apos;ll get used to it. In the meantime, you&apos;ll have to watch a lot of movies. Seems like the only thing to do with the bad weather.&quot;<br>B: &quot;Too expensive. Can you believe how much movies cost these days?&quot;<br>A: &quot;Yeah. It&apos;s crazy. It&apos;s like 9 bucks a movie. I remember when it was half that.&quot;<br>B: &quot;Unless it&apos;s a date, I&apos;m not going to pay that much to watch a movie.&quot;<br>A: &quot;That makes sense.&quot;<br>B: &quot;Oh. The professor is coming. I&apos;ll talk to you later.&quot;<br>A: &quot;Aright.&quot;<br><br></td></tr></table>"
}