{
    "categoryIndex": 1,
    "sectionIndex": 4,
    "title": "Body Parts - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=630",
    "lessonIndex": 187,
    "html": "<h1>Body Parts - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L74/practice/L74P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L74/practice/L74P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L74/practice/L74P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Sarah. Why are you limping?&quot;<br>B: &quot;Oh. Hi Matt. I went snowboarding yesterday and my whole body aches.&quot;<br>A: &quot;Was it your first time?&quot;<br>B: &quot;Yeah. And I never want to go again.&quot;<br>A: &quot;I remember the first time I went. My back was sore, I couldn&apos;t sit down because it hurt my butt, and my legs would cramp if I walked too fast.&quot;<br>B: &quot;That&apos;s exactly how I feel now.&quot;<br>A: &quot;It&apos;s only like that the first couple of times.&quot;<br>B: &quot;Ha. There won&apos;t be a next time.&quot;<br>A: &quot;You gotta give it a chance. It&apos;s fun after awhile.&quot;<br>B: &quot;I&apos;ll think about it after I start feeling better. Right now, I don&apos;t even want to hear the word snowboarding.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L74/practice/L74P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L74/practice/L74P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L74/practice/L74P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Ahhchooo!&quot;<br>B: &quot;You&apos;ve been sneezing a lot lately. Are you sick or something?&quot;<br>A: &quot;No. Every spring time around April, I&apos;m stricken with allergies.&quot;<br>B: &quot;I never have seasonal allergies.&quot;<br>A: &quot;Consider yourself lucky.&quot;<br>B: &quot;What are all the symptoms?&quot;<br>A: &quot;Well, as you just saw, I sneeze a lot. Also, my nose becomes very runny, my throat sometimes itches, and my eyes start to water.&quot;<br>B: &quot;That doesn&apos;t sound good.&quot;<br>A: &quot;No it&apos;s not. So you don&apos;t have any type of allergies?&quot;<br>B: &quot;Well, I have a severe allergic reaction to alcohol. It runs in the family.&quot;<br>A: &quot;Everyone to some extent is allergic to alcohol.&quot;<br>B: &quot;I get it pretty bad. My whole face turns red, including my ears. My eyes become bloodshot, and I start to itch all over my body.&quot;<br>A: &quot;That&apos;s pretty bad.&quot;<br>B: &quot;But that doesn&apos;t stop me from drinking. Hahaha.&quot;<br></td></tr></table>"
}