{
    "categoryIndex": 1,
    "sectionIndex": 4,
    "title": "Dating - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=642",
    "lessonIndex": 199,
    "html": "<h1>Dating - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L84/practice/L84P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L84/practice/L84P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L84/practice/L84P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hi there. Do you know anyone here?&quot;<br>B: &quot;I&apos;m a friend of Stacy.&quot;<br>A: &quot;Stacy Miller? I know her.&quot;<br>B: &quot;Really? How do you know her?&quot;<br>A: &quot;We went to middle school together.&quot;<br>B: &quot;That&apos;s cool. What a small world.&quot;<br>A: &quot;So how do you know Stacy?&quot;<br>B: &quot;We went to the same sorority.&quot;<br>A: &quot;What did you major in?&quot;<br>B: &quot;I majored in Sociology.&quot;<br>A: &quot;Really? Me too. That&apos;s kinda cool.&quot;<br>B: &quot;Where did you go to school?&quot;<br>A: &quot;I went to Berkley.&quot;<br>B: &quot;So what are you doing here in New York?&quot;<br>A: &quot;I work at a consulting firm.&quot;<br>B: &quot;Isn&apos;t that hard work?&quot;<br>A: &quot;It was in the beginning, but I got used to it. It&apos;s a lot of hours though.&quot;<br>B: &quot;I bet. I don&apos;t like working more than 40 hours. I need time to play.&quot;<br>A: &quot;I hear that. I wish I had more time to play. But I do like my job.&quot;<br>B: &quot;I think it is important to like your job.&quot;<br>A: &quot;I like talking with you.&quot;<br>B: &quot;Really? I feel the same way.&quot;<br>A: &quot;Do, you wanna go out sometime, like dinner or something?&quot;<br>B: &quot;I&apos;d like that. Here, let me give you my number.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L84/practice/L84P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L84/practice/L84P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L84/practice/L84P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;You see that chick over there?&quot;<br>B: &quot;The one in the red shirt?&quot;<br>A: &quot;Yeah. Isn&apos;t she hot?&quot;<br>B: &quot;She&apos;s alright.&quot;<br>A: &quot;Just alright?!? She&apos;s hot!&quot;<br>B: &quot;Why don&apos;t you go talk to her?&quot;<br>A: &quot;You think she&apos;s out of my league?&quot;<br>B: &quot;Hell no! You&apos;re just a chicken that&apos;s all.&quot;<br>A: &quot;C&apos;mon. I get nervous when I talk to girls.&quot;<br>B: &quot;Why don&apos;t you go stand next to her for awhile and if an opportunity comes up, strike a conversation.&quot;<br>A: &quot;What do I talk about?&quot;<br>B: &quot;It doesn&apos;t matter. You gotta find what she&apos;s interested in and go with that.&quot;<br>A: &quot;I don&apos;t know...&quot;<br>B: &quot;Do you want me to go talk to her?&quot;<br>A: &quot;No. Stay away from her.&quot;<br>B: &quot;If you don&apos;t do anything, I&apos;ll bet somebody else will.&quot;<br>A: &quot;Ok already. I&apos;ll try.&quot;<br></td></tr></table>"
}