{
    "lessonIndex": 204,
    "categoryIndex": 1,
    "sectionIndex": 5,
    "title": "Marriage - Getting a Church ",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=652",
    "html": "\r\n<h1>\r\nMarriage - Getting a Church\r\n</h1>\r\nIn this lesson, we will cover the process of marriage and all the things you need to know how to say in English. &#xA0;In the previous session, we learned about the engagement and initial wedding procedures. &#xA0;Let&apos;s now look into more depth at the marriage process.<br><br>After two people agree to marry, there are many things to plan. &#xA0;There are many different things you can do, and depending on your budget, you will have more or less. &#xA0;I will give an example of the marriages I have seen around me.<br><br>The first thing you need to do after you set a date is find a church. &#xA0;In eastern cultures, marrying in a church is not as popular, but in America, a large percentage of marriages still take place in the church.<br><br>You will need to call a church and ask if you can rent there place for a marriage.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L92/sentence/L92S1.mp3\">Hello. &#xA0;I&apos;m going to get married and I was wondering if you rent out your church for this purpose.</a>&quot;<br><br>If they say no, you can say thank you and good bye. &#xA0;If they say yes, then you can follow up with more questions.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L92/sentence/L92S2.mp3\">I was looking to get married on June 15th. &#xA0;Will your church be available on that date?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L92/sentence/L92S3.mp3\">What Saturday do you have available in the month of June?</a>&quot;<br><br>If timing is an issue, then you will need to tell them the time.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L92/sentence/L92S4.mp3\">We would like to get married at 1:00pm. &#xA0;Is that ok?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L92/sentence/L92S5.mp3\">We would like to get married at 4:00pm. &#xA0;Does that time work for you?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L92/sentence/L92S6.mp3\">We are pretty flexible with the time so I will take whatever time is available on that date.</a>&quot;<br><br>After a date and time is confirmed, they might ask you to meet and get all the details from you.\r\n"
}