{
    "lessonIndex": 207,
    "categoryIndex": 1,
    "sectionIndex": 5,
    "title": "Wedding Process - Gifts and Reception",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=655",
    "html": "\r\n<h1>\r\nWedding Process - Gifts and Reception\r\n</h1>\r\nIn some cultures, wedding present is usually given in the form of money. &#xA0;In America, money is rarely given among friends. &#xA0;Family might provide financial support, but for presents, it is always a gift bought at a store. &#xA0;In order to prevent duplicate gifts or gifts that you don&apos;t want, many stores such as The Bon, provide a wedding registry. &#xA0;You go and pick all the things you want and they enter it into a computer. &#xA0;You tell everyone in the invitation you sent out that the gift registry is at The Bon. &#xA0;They will go to The Bon and print out a list of what you have selected. &#xA0;If someone bought it already, then that item will not show up.<br><br>This is a way to get what you need and makes it easier for the people buying you gifts.<br><br>In the store, you simply tell the person:<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L95/sentence/L95S1.mp3\">I&apos;m going to get married in June and I would like my registry here.</a>&quot;<br><br>If you are a person buying a present, then you can ask,<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L95/sentence/L95S2.mp3\">My friend is getting married and they registered here. &#xA0;Where can I get a list of presents they selected?</a>&quot;<br><br>After the church is selected, the flowers have been ordered, and the photographer is reserved, then you have to practice. &#xA0;The wedding party usually meets at the church a day or two before the wedding and rehearses the coming day&apos;s event. &#xA0;After the rehearsal, a rehearsal dinner should be provided.<br><br>Don&apos;t forget about the reception. &#xA0;You have to plan for a reception after the wedding. &#xA0;Usually it is a meal at a different location or at the church. &#xA0;Again, this is all dependent on how much you can afford. &#xA0;An open bar is also an option that many people like. &#xA0;An open bar is a bar that people can order drinks for free.<br><br>Now that we looked through the process of a wedding, let&apos;s work on a few sentences friends say to each other before and during the busy wedding process.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L95/sentence/L95S3.mp3\">Planning for a wedding is so time consuming. &#xA0;I don&apos;t know if I can finish everything on time.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L95/sentence/L95S4.mp3\">I&apos;m getting so stressed out. &#xA0;It feels like there are a hundred different things to do.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L95/sentence/L95S5.mp3\">I think I&apos;m almost done with my wedding plans. &#xA0;Although I&apos;m relieved, I now feel anxious about the wedding.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L95/sentence/L95S6.mp3\">Did you help your fianc&#xE9; plan for the wedding?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L95/sentence/L95S7.mp3\">You made her do all the work?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L95/sentence/L95S8.mp3\">My boyfriend was so helpful. &#xA0;He literally did most of the planning.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L95/sentence/L95S9.mp3\">Are you going to have the reception at the church or did you reserve another place?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L95/sentence/L95S10.mp3\">How much did your wedding cost?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L95/sentence/L95S11.mp3\">How much was the reception?</a>&quot;<br><br>A wedding is much larger and requires much more planning than I described here. &#xA0;I primarily covered the larger items in a broad way. &#xA0;This is to give you an idea and a starting point. &#xA0;If you have additional questions or specific requests, feel free to ask.\r\n"
}