{
    "lessonIndex": 234,
    "categoryIndex": 1,
    "sectionIndex": 6,
    "title": "Baseball - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=684",
    "html": "<h1>Baseball - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L119/practice/L119P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L119/practice/L119P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L119/practice/L119P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;What sport do you like the most?&quot;<br>B: &quot;I like baseball the best.&quot;<br>A: &quot;Me too. Did you play when you were a kid?&quot;<br>B: &quot;Yeah. I played until I graduated from high school.&quot;<br>A: &quot;What position did you play?&quot;<br>B: &quot;I think I tried every position, but the last few years, I played third.&quot;<br>A: &quot;I hate third base. It&apos;s scary when the ball is coming at you so fast.&quot;<br>B: &quot;It was scary at first, but after awhile, I got used to it. If you have fast reflexes, then it&apos;s not really a problem. What position did you play?&quot;<br>A: &quot;I played outfield. I hated the infield because I never figured out all the bounces.&quot;<br>B: &quot;I wish I could play again, but there isn&apos;t much opportunities around here.&quot;<br>A: &quot;I&apos;m on a softball league. It&apos;s not fast pitch, but it&apos;s still fun. You wanna join our group?&quot;<br>B: &quot;When do you guys play?&quot;<br>A: &quot;We play either Tuesdays or Thursdays.&quot;<br>B: &quot;Sounds pretty fun. I&apos;ll come out and join you next time.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L119/practice/L119P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L119/practice/L119P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L119/practice/L119P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Do you like to watch baseball?&quot;<br>B: &quot;Yeah. I follow the Mariners every year.&quot;<br>A: &quot;I wonder how they will do this year.&quot;<br>B: &quot;I don&apos;t know if they have a chance. Did you hear that A-Rod went to the Yankees?&quot;<br>A: &quot;I know. Their team was too good even before getting Alex.&quot;<br>B: &quot;Yeah. The richest team is usually the best team. They need to put a salary cap to make things fair.&quot;<br>A: &quot;I agree. I don&apos;t know why they haven&apos;t done so already.&quot;<br>B: &quot;But don&apos;t lose hope too soon. The Yankees don&apos;t have a good pitching staff this year. They might end up like the Texas Rangers. Great offense, no pitching.&quot;<br>A: &quot;I highly doubt that. Even though they lost Pettite, they still have a decent pitching rotation.&quot;<br>B: &quot;We&apos;ll see. I hope the Mariners do well this year.&quot;<br>A: &quot;Me too. Oh, did you buy any tickets this year?&quot;<br>B: &quot;I got a couple of games with Oakland and Boston, but I couldn&apos;t get anything with the Yankees.&quot;<br>A: &quot;Same here. I went in on the second day and all the tickets with the Yankees were already sold out.&quot;<br>B: &quot;There&apos;s still plenty of other games though. We should go together one of these days.&quot;<br>A: &quot;Sounds good. Let&apos;s plan for late June.&quot;<br></td></tr></table>"
}