{
    "categoryIndex": 1,
    "sectionIndex": 6,
    "title": "Football",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=691",
    "lessonIndex": 241,
    "html": "\r\n<h1>\r\nFootball\r\n</h1>\r\nFootball is referred to as soccer in most countries, but in America, football is different than soccer. &#xA0;That is why I sometimes refer to football as American football. &#xA0;American football is not popular worldwide yet, but it&apos;s very popular in America. &#xA0;The Superbowl is the most watched sports event. &#xA0;To buy commercial time during the Superbowl is the most expensive.<br><br>In this lesson, I&apos;ll give you some pointers on having a football conversation, and I will also explain some rules. &#xA0;Let&apos;s start with the rules first because not everyone will know them. &#xA0;I will not be too specific because this isn&apos;t a lesson on football rules. &#xA0;Rather, I will give a brief description so you have an understanding of the game before we move on to the conversation aspect.<br><br>There are eleven players on the field for each side. &#xA0;That means you need 22 people to play an official football game. &#xA0;The point of the game is to reach the other side, which is called the end zone, with the ball. &#xA0;A player can run with the ball, or they can throw the ball to another person.<br><br>Touchdown is worth 6 points.<br><br>If you are close enough but not quite in the end zone, you can kick the ball. That is called a field goal.<br><br>Field goals are worth 3 points.<br><br>After you make a touchdown, you can either kick a ball, similar to a field goal for 1 point or you can run or pass it for 2 points. &#xA0;This is called a two point conversion.<br><br>Quarterback always starts with the ball. &#xA0;He either passes it to a wide receiver, hands off to a running back, or runs the ball himself.<br><br><b>Offense positions:</b><br><br>Center - The person hiking the ball to the quarterback each play.<br>Quarterback - The main person starting with the ball each play. &#xA0;Either passes, hands off, or runs.<br>Running back - The person who runs with the ball. &#xA0;Running backs can catch passes as well.<br>Wide Receivers - The people who run out and catch balls from the quarterback.<br>Tight End - Similar to a wide receiver but blocks a lot as well.<br>Full back - Like a running back who runs with the ball, but mostly blocks for the main running back.<br>Offensive Guard - blocks for the quarterback positioned right next to the Center on each side<br>Offensive Tackle - same as the guard and standing right next to the guard<br><br><b>Defense positions:</b><br><br>Nose Tackle - Person in the middle facing the center<br>Defensive Guard and Tackle - Opposite the offensive guard and tackle<br>Linebacker - People right behind the front line.<br>Cornerbacks - People on the sides of linebackers. &#xA0;Primarily covers the wide receivers and outside running plays.<br>Saftey - People behind the cornerbacks who covers wide receiver and passing plays<br><br>The object for the offense is to get in the endzone. &#xA0;The goal of the defense is to prevent the offense from getting in the endzone. &#xA0;A defensive person is always trying to tackle the person who has the ball. &#xA0;If the person goes down to the ground with the ball, then that play is over.<br><br>There are four downs. &#xA0;After four downs, your team no longer has possession of the ball. &#xA0;If you gain 10 yards before the four downs are used, then you start with four downs again.<br><br>Usually on first down, they call it first and ten. &#xA0;That means it is the first down, and I need ten yards to regain first down. &#xA0;If on the first play I only get one yard, then the next down is called second and nine. &#xA0;It is the second play and I need 9 yards more. &#xA0;On the second down, I get 5 yards, then it is third and 4. &#xA0;And on third down if I get 5 more yards, I have succeeded in getting 10 yards, and it is first and 10 once again. &#xA0;You continue to do this until you either get a touch down or get a field goal or fail to reach 10 yards in four plays.<br><br>On the fourth down, your team can punt the ball. &#xA0;Punting the ball is used because you do not think you can get first down and punting the ball would move the other team further away from their end zone, making it harder for them. &#xA0;To punt the ball, a punter grabs the football and kicks it as high and as far as possible.<br><br>There are many other rules, but I think this much explanation will be sufficient to understand a little about American football. &#xA0;Let&apos;s move on to speaking about this topic now.\r\n"
}