{
    "categoryIndex": 1,
    "sectionIndex": 6,
    "title": "Football - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=694",
    "lessonIndex": 244,
    "html": "<h1>Football - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L127/practice/L127P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L127/practice/L127P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L127/practice/L127P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;What are you watching?&quot;<br>B: &quot;A football game. Packers are playing the Chiefs.&quot;<br>A: &quot;I never understood this game.&quot;<br>B: &quot;It&apos;s not that hard. If you watch a couple of games, you&apos;ll start to understand it.&quot;<br>A: &quot;Do you watch a lot of football?&quot;<br>B: &quot;I like the Packers, so I watch all their games.&quot;<br>A: &quot;Did you play football before?&quot;<br>B: &quot;Only in high school. I was too small to play for college.&quot;<br>A: &quot;What position did you play?&quot;<br>B: &quot;I was the corner back.&quot;<br>A: &quot;Is that the main guy in offense?&quot;<br>B: &quot;No. That&apos;s the quarterback. The corner back is a defensive player covering passing plays and outside running plays.&quot;<br>A: &quot;I see. Do you think it is more fun than baseball?&quot;<br>B: &quot;It&apos;s hard to compare the two because they&apos;re so different. I like both baseball and football. How about you? You like baseball a lot?&quot;<br>A: &quot;Yeah. I&apos;m a big baseball fan.&quot;<br>B: &quot;Baseball is fun, but you should also learn football. I&apos;ll explain as we watch.&quot;<br>A: &quot;Cool.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L127/practice/L127P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L127/practice/L127P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L127/practice/L127P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;What sports do you like to play?&quot;<br>B: &quot;I like baseball and basketball.&quot;<br>A: &quot;How about football?&quot;<br>B: &quot;In my country football is brand new, so I never learned the game when I was younger.&quot;<br>A: &quot;It&apos;s a very popular game in America.&quot;<br>B: &quot;Yeah. I heard a lot about it. Is it really that fun?&quot;<br>A: &quot;For me, it&apos;s one of those games that are fun to both watch and play.&quot;<br>B: &quot;Are you a football player?&quot;<br>A: &quot;No, just for fun with my friends. We play two hand touch or flag football. We&apos;re too old to play tackle football.&quot;<br>B: &quot;What is two hand touch and flag football?&quot;<br>A: &quot;Instead of tackling somebody, you just have to touch them with two hands, or if it is flag football, grab the flag that the ball carrier is wearing.&quot;<br>B: &quot;I see. It&apos;s safer then right?&quot;<br>A: &quot;Exactly. We play every Saturdays on the field by the tennis courts. If you want to learn and play a little, you&apos;re welcome to join us.&quot;<br>B: &quot;I&apos;ll give it a try. Give me a call and let&apos;s go down together.&quot;<br>A: &quot;Ok. I&apos;ll call you Saturday morning.&quot;<br>B: &quot;Great.&quot;<br></td></tr></table>"
}