{
    "lessonIndex": 245,
    "categoryIndex": 1,
    "sectionIndex": 7,
    "title": "Golf - Terminologies",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=695",
    "html": "\r\n<h1>\r\nGolf - Terminologies\r\n</h1>\r\nGolf is a sport that is increasing in popularity. &#xA0;This is more true for Asian countries with many great golfers coming from Korea, Japan, and China. &#xA0;Golf is also great because it is a sport for all ages and both genders. &#xA0;In this lesson, we will cover all the things you need to know to have a great conversation about golf.<br><br>Before we start, let&apos;s cover some terminologies and equipment<br><br>Iron set - A typical set of irons consist of a pitching wedge and 3 through 9 irons<br>5 wood - Fairway wood designed to hit the ball a little farther than the 3 iron<br>3 wood - Fairway wood designed to hit the ball a little farther than the 5 wood<br>Driver - The club used to hit the ball the farthest off the Tee<br>Putter - The club used to putt the ball in the cup<br><br>Tee box - The place where you hit your first shot<br>Fairway - The short grass area in the middle<br>Rough - Taller grass next to the fairway that is not in the middle<br>Green - The area where the hole is and where you putt the ball.<br><br>Par 3 - Short holes where it should take 3 shots to get in the cup<br>Par 4 - Middle length holes where it should take 4 shots<br>Par 5 - Long holes where it should take 5 shots<br><br>Hole in one - When the ball goes in the cup on the first hit. &#xA0;Usually only on par 3&apos;s.<br>Double Eagle - Ball goes in the cup after hitting the ball twice on a par 5. &#xA0;3 under par<br>Eagle - Ball goes in the cup after hitting the ball 3 times on a par 5 or 2 times on a par 4. &#xA0;2 under par<br>Birdie - Reaching the hole at one under par. &#xA0;So on a par 3, you reached the cup in 2, par 4, you reached in 3, and par 5, you reached in 4.<br>Par - When you put the ball in the cup in the number specified by the par. &#xA0;Par 3, in three, par 4 in four shots, and par 5 in five shots<br>Bogey - Using one extra shot to reach the cup. &#xA0;For example, on a par 4, you used 5 shots to get in the cup.<br>Double bogey - 2 over par<br>Triple bogey - 3 over par<br>Quadruple bogey - 4 over par<br>Etc.\r\n"
}