{
    "lessonIndex": 248,
    "categoryIndex": 1,
    "sectionIndex": 7,
    "title": "Golf - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=698",
    "html": "<h1>Golf - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L130/practice/L130P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L130/practice/L130P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L130/practice/L130P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Steve. When&apos;s the next time you&apos;re going to play golf?&quot;<br>B: &quot;I&apos;m going out this Saturday.&quot;<br>A: &quot;Do you already have a foursome?&quot;<br>B: &quot;Unfortunately, we do. Let&apos;s plan for something together for Wednesday. We can go right after work.&quot;<br>A: &quot;That sounds good. Where do you want to play?&quot;<br>B: &quot;We won&apos;t have much time, so let&apos;s play somewhere close to work.&quot;<br>A: &quot;How about Bellevue? It&apos;s pretty close.&quot;<br>B: &quot;How much does it cost over there?&quot;<br>A: &quot;Twilight rates are 21 dollars.&quot;<br>B: &quot;That&apos;s pretty good. Let&apos;s do it.&quot;<br>A: &quot;Aright. I&apos;ll get a tee time for Wednesday at about 4:00.&quot;<br>B: &quot;Make it 4:15. I won&apos;t get off until 4:00.&quot;<br>A: &quot;Ok. I&apos;ll call you later when I get a tee time.&quot;<br>B: &quot;Sounds good. I&apos;ll see you on Wednesday then.&quot;<br>A: &quot;Aright. Have fun on Saturday.&quot;<br>B: &quot;Will do.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L130/practice/L130P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L130/practice/L130P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L130/practice/L130P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;How did you golf on Saturday?&quot;<br>B: &quot;I did pretty good. I shot a 13.&quot;<br>A: &quot;Not too bad. I thought you were going to break single.&quot;<br>B: &quot;I had a chance. I shot a 4 on the front nine, but the back nine killed me.&quot;<br>A: &quot;What happened?&quot;<br>B: &quot;My drive was totally off. All of the sudden, I started hooking the ball. I hit two balls OB, and that killed me score right there.&quot;<br>A: &quot;That sucks. You could have broken single if it wasn&apos;t for the penalty strokes.&quot;<br>B: &quot;Yeah. I was so frustrated after that hole. But overall, I shot well, so I&apos;m not too disappointed. How about you? How have you been hitting lately?&quot;<br>A: &quot;I hit great on the range, but when I get on the course, I can&apos;t seem to hit the ball right.&quot;<br>B: &quot;That happened to me for the longest time. It just takes time and practice. When you go out on the course more often, that problem will fix itself.&quot;<br>A: &quot;I&apos;m still trying to break 90. I&apos;ve been hitting in the mid nineties for ever.&quot;<br>B: &quot;How far does your driver go?&quot;<br>A: &quot;I don&apos;t use it that much. I use my 3 wood more. I&apos;m not consistent with the driver to use it.&quot;<br>B: &quot;You gotta keep practicing with it. Eventually you&apos;ll get the hang of it.&quot;<br>A: &quot;Yeah. I practice with it on the range, but I&apos;m not making any progress on it.&quot;<br>B: &quot;Let&apos;s go to the range together and I&apos;ll check out your swing.&quot;<br>A: &quot;That sounds good. Let&apos;s go tomorrow night.&quot;<br>B: &quot;Ok. That will give us practice for our round on Wednesday.&quot;<br>A: &quot;I&apos;ll meet you there at 6:30.&quot;<br>B: &quot;Ok. See you tomorrow then.&quot;<br></td></tr></table>"
}