{
    "lessonIndex": 249,
    "categoryIndex": 1,
    "sectionIndex": 7,
    "title": "Poker - Terminologies ",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=699",
    "html": "\r\n<h1>\r\nPoker - Terminologies\r\n</h1>\r\nPoker is a fun activity among your friends. &#xA0;Poker is also something a person can do in a casino without friends. &#xA0;I will cover all the things you need to say to be effective with your English at the poker table.<br><br>There are many different poker games. &#xA0;I will not cover the different types of poker games, but feel free to learn about them through poker books or other poker web sites. &#xA0;For this lesson, I will use Texas Hold &apos;em as the example game because of its popularity.<br><br>First, let&apos;s look at some terminologies:<br><br>No Pair - A hand without anything.<br>One Pair - Having two of the same card<br>Two Pair - Having two sets of pair<br>Three of a kind - Having three of the same card<br>Straight - Having five number or face cards in a row<br>Flush - Having all 5 cards with the same suit<br>Full house (another name is &apos;boat&apos;) - Three of a kind and a pair together<br>Four of a kind - Four of the same card<br>Straight flush - Five number or face cards in a row all in the same suit<br>Royal flush - 10, Jack, Queen, King, and Ace all in the same suit<br><br>Wheel - A straight consisting of Ace, 2, 3, 4, and 5<br><br><b>Betting</b><br><br>Check - When it is your turn and you don&apos;t want to bet anything<br>Call - When someone in front of you bets and you want to match to stay in the game. &#xA0;Other terminology for call is &apos;see.&apos;<br>Fold - Dying or forfeiting your hand because you don&apos;t want to pay anymore. &#xA0;Other terminologies for this are, mucking your hand, dying, and out.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L131/sentence/L131S1.mp3\">I fold.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L131/sentence/L131S2.mp3\">He mucked his hand.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L131/sentence/L131S3.mp3\">I&apos;m out.</a>&quot;<br><br>Raise - When someone in front of you bets and you want to put in more money.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/L131/sentence/L131S4.mp3\">I see (call) your ten, and I raise you another ten.</a>&quot;\r\n"
}