{
    "categoryIndex": 1,
    "sectionIndex": 7,
    "title": "Poker - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=702",
    "lessonIndex": 252,
    "html": "<h1>Poker - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L133/practice/L133P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L133/practice/L133P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L133/practice/L133P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Jack. What did you do last weekend?&quot;<br>B: &quot;Josh had a bunch of guys over at his house and we played poker.&quot;<br>A: &quot;Why didn&apos;t you guys call me?&quot;<br>B: &quot;We did. But you weren&apos;t home. If you had a cell phone, maybe you wouldn&apos;t be left out.&quot;<br>A: &quot;Yeah. I need to get a cell phone. So, what games did you play?&quot;<br>B: &quot;We only play Texas Hold &#xB5;em.&quot;<br>A: &quot;That&apos;s all good. What was the bid amount?&quot;<br>B: &quot;We started playing no limit. It&apos;s so much fun.&quot;<br>A: &quot;That sounds awesome. Let me join you next time.&quot;<br>B: &quot;No problem. Just get a cell phone so we can contact you.&quot;<br>A: &quot;Aright. Who won though?&quot;<br>B: &quot;John. He always wins. He&apos;s damn good.&quot;<br>A: &quot;You only played one game?&quot;<br>B: &quot;We played 2 games and he won both of them.&quot;<br>A: &quot;What is the buy in?&quot;<br>B: &quot;Only 10 bucks.&quot;<br>A: &quot;That sounds fun. Ten bucks isn&apos;t that much money to have fun while chilling with your friends.&quot;<br>B: &quot;Exactly.&quot;<br>A: &quot;But what happens if you get out in the first ten minutes?&quot;<br>B: &quot;Then you&apos;re screwed. You can watch tv or play the XBOX.&quot;<br>A: &quot;Better not die soon then. So, when is the next time you guys are playing?&quot;<br>B: &quot;Probably this Friday. Give me a call Friday morning and I&apos;ll let you know the exact time.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L133/practice/L133P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L133/practice/L133P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L133/practice/L133P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;How long did you stay at Tim&apos;s playing poker last night?&quot;<br>B: &quot;I stayed for a couple more hours after you left.&quot;<br>A: &quot;So you guys ended up playing one more game?&quot;<br>B: &quot;Yeah.&quot;<br>A: &quot;How did you do on the second game?&quot;<br>B: &quot;I was third. I had a pair of Kings and went all in. Albert had an Ace Queen and called me. When the cards came out, he ended up with a pair of aces and I lost.&quot;<br>A: &quot;I hate when that happens. So did Albert end up winning?&quot;<br>B: &quot;No. He lost to Jerry. Anyway on the last game, it was me and Andrew. I had Ace King suited. On the flop, it was Ace, King, and Queen. Andrew went all in and I called. The next card was a King and I had a full house. It was nearly impossible for me to lose. Except another Queen came out and he had four of a kind. Can you believe that? I had a full house and I lost.&quot;<br>A: &quot;That sucks. He&apos;s so lucky. I can&apos;t believe he got four of a kind.&quot;<br>B: &quot;That&apos;s poker I guess.&quot;<br>A: &quot;I hear they are going to play again this Saturday? Are you going to play?&quot;<br>B: &quot;Hell yeah. Do you know what time they&apos;re playing?&quot;<br>A: &quot;I think they want to start a little earlier because it takes a long time to play. Probably around 7:00.&quot;<br>B: &quot;I get off at 6:30 so it&apos;s going to be tight. I&apos;ll come as soon as possible.&quot;<br>A: &quot;Aright. See you later.&quot;<br></td></tr></table>"
}