{
    "lessonIndex": 261,
    "categoryIndex": 1,
    "sectionIndex": 7,
    "title": "Shopping - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=711",
    "html": "<h1>Shopping - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L140/practice/L140P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L140/practice/L140P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L140/practice/L140P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Welcome. Can I help you with anything?&quot;<br>B: &quot;Hi. I&apos;m shopping for my boyfriend&apos;s birthday. Do you have any suggestions?&quot;<br>A: &quot;Let&apos;s see. How about a nice shirt and tie? You can&apos;t go wrong there.&quot;<br>B: &quot;Well. He doesn&apos;t wear ties that often.&quot;<br>A: &quot;We have some nice pants. You can also get him a belt with it.&quot;<br>B: &quot;That sounds good. Which one do you recommend?&quot;<br>A: &quot;These slacks are very popular. He can wear them to dress up a little or on a normal casual day.&quot;<br>B: &quot;I like them. Do you have matching belts?&quot;<br>A: &quot;Yes. Right over here.&quot;<br>B: &quot;How much are they?&quot;<br>A: &quot;The pants are on sale for $40, and the belt is $25.&quot;<br>B: &quot;What is your return policy just in case he doesn&apos;t like them?&quot;<br>A: &quot;Just save the receipt and we will gladly return or exchange them for you.&quot;<br>B: &quot;That sounds great. I&apos;ll take them.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L140/practice/L140P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L140/practice/L140P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L140/practice/L140P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Jackie. What are you doing?&quot;<br>B: &quot;Nothing much. I&apos;m just relaxing today. Why? What&apos;s going on?&quot;<br>A: &quot;I was thinking about heading to the mall. Do you want to go?&quot;<br>B: &quot;Are they having a sale?&quot;<br>A: &quot;Yeah. Both Bon and Nordstrom&apos;s is having there annual sale. It&apos;s a great time to buy some clothes you&apos;ve been holding out on.&quot;<br>B: &quot;That sounds great. Where should we meet?&quot;<br>A: &quot;I&apos;ll meet you in front of Nordstrom&apos;s in 30 minutes.&quot;<br>B: &quot;Sounds good. See you there.&quot;<br>A: &quot;What do you think about these shoes?&quot;<br>B: &quot;They&apos;re cute. But do you think you&apos;ll wear them much?&quot;<br>A: &quot;No. Not really.&quot;<br>B: &quot;This sweater is so pretty. I love the low neck design.&quot;<br>A: &quot;I bet it&apos;s expensive.&quot;<br>B: &quot;It&apos;s on sale for $80. What do you think? Should I try them on?&quot;<br>A: &quot;For 80 bucks it looks great. Go try it on.&quot;<br><br></td></tr><tr><td>3 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L140/practice/L140P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L140/practice/L140P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L140/practice/L140P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Where is your dressing room?&quot;<br>B: &quot;Right over there.&quot;<br><i>Person A comes out of the dressing room</i><br>B: &quot;How did you like the sweater?&quot;<br>A: &quot;I loved it. I&apos;ll take it.&quot;<br>B: &quot;Great. I can ring you up over here. It comes to $87.04.&quot;<br>A: &quot;Here you go?&quot;<br>B: &quot;Do you have a credit card with us?&quot;<br>A: &quot;No I don&apos;t.&quot;<br>B: &quot;If you open up a card, you can save 10% on all your purchases today.&quot;<br>A: &quot;Not today. Thanks though.&quot;<br>B: &quot;No problem. We always have this offer, so when ever you decide to, just let us know.&quot;<br>A: &quot;Sure.&quot;<br>B: &quot;Is there anything else I can help you with?&quot;<br>A: &quot;Yeah. I was looking at some of your pants, but they are all a bit too long. Do you have alteration services here?&quot;<br>B: &quot;Yes. It cost $7, and it takes one day.&quot;<br>A: &quot;Great. Thanks for your help.&quot;<br>B: &quot;Thank you, and have a great day.&quot;<br></td></tr></table>"
}