{
    "categoryIndex": 1,
    "sectionIndex": 8,
    "title": "Happy and Feeling Good - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=721",
    "lessonIndex": 271,
    "html": "<h1>Happy and Feeling Good - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L147/practice/L147P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L147/practice/L147P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L147/practice/L147P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey John. I have some great news.&quot;<br>B: &quot;What happened?&quot;<br>A: &quot;I got a job offer from Dell.&quot;<br>B: &quot;That&apos;s great. I thought you said you didn&apos;t get the job.&quot;<br>A: &quot;I thought I did bad on the interview, but I guess I was wrong. I&apos;m so happy right now.&quot;<br>B: &quot;I bet. That&apos;s great news. I&apos;m very happy for you.&quot;<br>A: &quot;Thanks. I feel like celebrating. Let&apos;s go have a beer. It&apos;s on me.&quot;<br>B: &quot;Sounds good.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L147/practice/L147P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L147/practice/L147P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L147/practice/L147P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Mike, did you win the lottery or something? Why the big smile?&quot;<br>B: &quot;I&apos;m so relieved. I just passed the bar exam.&quot;<br>A: &quot;You did? That&apos;s great! You must be very happy now?&quot;<br>B: &quot;That&apos;s an understatement. I&apos;m on cloud nine. I couldn&apos;t be any happier.&quot;<br>A: &quot;Did you tell your parents yet?&quot;<br>B: &quot;Not yet. I didn&apos;t get a hold of them. I&apos;ll try to call them again tonight.&quot;<br>A: &quot;They&apos;re probably going to be so happy.&quot;<br>B: &quot;I think so. It&apos;s turning out to be a great day.&quot;<br><br></td></tr><tr><td>3 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L147/practice/L147P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L147/practice/L147P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L147/practice/L147P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Life&apos;s so boring.&quot;<br>B: &quot;Well, most of the time it is, I guess.&quot;<br>A: &quot;What do you think will make you happy?&quot;<br>B: &quot;I think money will make me happy.&quot;<br>A: &quot;You heard people say that money doesn&apos;t guarantee happiness.&quot;<br>B: &quot;It will for me. Then I can do all the things I want to do.&quot;<br>A: &quot;You&apos;ll get bored eventually.&quot;<br>B: &quot;Then I can find something new to do. If I don&apos;t have to worry about money, then I don&apos;t have to work.&quot;<br>A: &quot;That&apos;s true, I guess. If I didn&apos;t have to work, I think I would be happy.&quot;<br>B: &quot;You see... money doesn&apos;t equal happiness, but it takes away a lot of responsibilities.&quot;<br></td></tr></table>"
}