{
    "categoryIndex": 1,
    "sectionIndex": 8,
    "title": "Anger - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=726",
    "lessonIndex": 276,
    "html": "<h1>Anger - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L151/practice/L151P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L151/practice/L151P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L151/practice/L151P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;What happened to your car?&quot;<br>B: &quot;A tow truck was towing my car and put all those dents in my car.&quot;<br>A: &quot;Are they going to pay you for the damages?&quot;<br>B: &quot;They&apos;re saying it was already there.&quot;<br>A: &quot;What the hell. That doesn&apos;t make sense. What are you going to do.&quot;<br>B: &quot;I have to go to court. A cop was there so he can prove that the damage wasn&apos;t there.&quot;<br>A: &quot;That sucks. I&apos;d be pissed if that happened to me.&quot;<br>B: I got an estimate and it&apos;s four thousand dollars.&quot;<br>A: &quot;Oh my gosh. Damn... screw the court, I would burn down their store.&quot;<br>B: &quot;We&apos;ll see what happens after court.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L151/practice/L151P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L151/practice/L151P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L151/practice/L151P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Jack, what&apos;s wrong?&quot;<br>B: &quot;You!&quot;<br>A: &quot;What are you talking about? What did I do?&quot;<br>B: &quot;You told Martha that I was on a date? What was that all about?&quot;<br>A: &quot;No... that&apos;s not what I meant. I didn&apos;t mean that. She asked me where you were and I jokingly said that you were on a date with Sara. I thought Martha knew that you and Sara were just friends.&quot;<br>B: &quot;She started feeling suspicious after you said that.&quot;<br>A: &quot;I&apos;m sorry man. I didn&apos;t know. I didn&apos;t mean to screw anything up.&quot;<br>B: &quot;Martha gets jealous easily and it took a while to convince her that Sara was just a friend. Now, I have to explain to Sara that I can&apos;t hang around her because of you.&quot;<br>A: &quot;Look. I really didn&apos;t mean to, and next time I see Martha, I&apos;ll really tell her that you and Sara are really just friends.&quot;<br>B: &quot;Don&apos;t bother.&quot;<br></td></tr></table>"
}