{
    "categoryIndex": 1,
    "sectionIndex": 8,
    "title": "Stress - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=739",
    "lessonIndex": 289,
    "html": "<h1>Stress - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L161/practice/L161P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L161/practice/L161P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L161/practice/L161P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hi Jackie. You don&apos;t look too well. What&apos;s going on?&quot;<br>B: &quot;It&apos;s nothing. I&apos;m just a little stressed out.&quot;<br>A: &quot;Why? What&apos;s stressing you out?&quot;<br>B: &quot;School. Since I was working part time, I had a difficult time keeping up with class. Now that we have exams coming up, I&apos;m totally freaking out.&quot;<br>A: &quot;The best thing to do is study as much as you can. I&apos;m sure you&apos;ll do alright.&quot;<br>B: &quot;I hope so. I guess I won&apos;t be sleeping for the next 3 days. That&apos;s what it&apos;ll take.&quot;<br>A: &quot;I have to study for an exam too. Why don&apos;t we study together. We can encourage each other.&quot;<br>B: &quot;That will be great.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L161/practice/L161P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L161/practice/L161P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L161/practice/L161P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Mike. What are you doing tonight?&quot;<br>B: &quot;Nothing planned. How about you?&quot;<br>A: &quot;Work is kicking my ass. I&apos;m so stressed. Let&apos;s go grab a drink.&quot;<br>B: &quot;I&apos;m always up for a drink. To tell you the truth, it&apos;s been quite stressful here too.&quot;<br>A: &quot;I say we get drunk tonight. I don&apos;t want to think about all this stuff.&quot;<br>B: &quot;But we have to work tomorrow.&quot;<br>A: &quot;We won&apos;t stay out too late. I just need to forget about work.&quot;<br>B: &quot;I hear ya. Let&apos;s do it.&quot;<br><br></td></tr><tr><td>3 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L161/practice/L161P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L161/practice/L161P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L161/practice/L161P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;What stresses you out the most?&quot;<br>B: &quot;Probably my parents.&quot;<br>A: &quot;How so?&quot;<br>B: &quot;Well, during school, they wanted good grades. Then after I got a job, they wanted me to get a better job. And finally, they want me to get married.&quot;<br>A: &quot;You have to deal with a lot of pressure from your parents.&quot;<br>B: &quot;Your parents are not like that?&quot;<br>A: &quot;Ever since I brought home some bad grades in elementary school, they never expected much.&quot;<br>B: &quot;You&apos;re lucky.&quot;<br>A: &quot;What do you do to deal with the stress?&quot;<br>B: &quot;Not much I can do. It&apos;s always there. I sometimes go out with some friends and drink, but that&apos;s only a temporary solution. The stress always returns in the morning.&quot;<br>A: &quot;That sucks. You wanna go grab a beer?&quot;<br>B: &quot;Sure. Sounds great. Let&apos;s go.&quot;<br></td></tr></table>"
}