{
    "categoryIndex": 1,
    "sectionIndex": 9,
    "title": "Other Emotions - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=762",
    "lessonIndex": 312,
    "html": "<h1>Other Emotions - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L179/practice/L179P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L179/practice/L179P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L179/practice/L179P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;How are you feeling these days?&quot;<br>B: &quot;I don&apos;t know. A little bored and restless I guess.&quot;<br>A: &quot;Why is that?&quot;<br>B: &quot;I have so much time on my hands and I have nothing to do.&quot;<br>A: &quot;Why don&apos;t you go out and have fun?&quot;<br>B: &quot;I would like to, but I have to save some money so I can&apos;t go out all the time.&quot;<br>A: &quot;That sucks.&quot;<br>B: &quot;After awhile, I start to feel anxious.&quot;<br>A: &quot;Try relaxing and reading a good book. That&apos;s always a good way to kill time.&quot;<br>B: &quot;That&apos;s true. How about you? How are you these days?&quot;<br>A: &quot;I&apos;m doing pretty good these days. My kid just finished kindergarten. I&apos;m so proud of him.&quot;<br>B: &quot;That&apos;s great to hear. He must be big now. It&apos;s been a year since I saw your son.&quot;<br>A: &quot;Yeah. He grew a lot in the last year.&quot;<br>B: &quot;I bet you&apos;re very proud of your son.&quot;<br>A: &quot;Yes I am. Thanks.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L179/practice/L179P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L179/practice/L179P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L179/practice/L179P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;What happened to that girl you were seeing?&quot;<br>B: &quot;Oh Jackie? We broke up last week.&quot;<br>A: &quot;That was a short relationship. You only started dating 2 months ago.&quot;<br>B: &quot;It was actually a long two months. She was a psycho.&quot;<br>A: &quot;What do you mean?&quot;<br>B: &quot;She would be laughing one moment, and if I said something insensitive, she would start crying. I didn&apos;t want to deal with that.&quot;<br>A: &quot;She sounds very emotional.&quot;<br>B: &quot;She was a psycho man. One time we were suppose to get together. I was waiting for her call, and when she finally called, she was screaming why I wasn&apos;t at her place.&quot;<br>A: &quot;Were you suppose to be there?&quot;<br>B: &quot;I thought she was going to call when she was done shopping. It was a misunderstanding. She was literally screaming on the phone over this.&quot;<br>A: &quot;Ok. You&apos;re right. She&apos;s a psycho.&quot;<br>B: &quot;I&apos;m just glad it&apos;s over.&quot;<br></td></tr></table>"
}