{
    "categoryIndex": 1,
    "sectionIndex": 9,
    "title": "TalkEnglish Milestone Review - InteractivePractice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=766",
    "lessonIndex": 316,
    "html": "<h1>English Milestone Review - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L181/practice/L181P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L181/practice/L181P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L181/practice/L181P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hi. Aren&apos;t you in my sociology class?&quot;<br>B: &quot;I think so. With Professor Robinson right?&quot;<br>A: &quot;Yeah. I&apos;m Nicole.&quot;<br>B: &quot;I&apos;m George. It&apos;s nice to meet you.&quot;<br>A: &quot;How are you liking the class so far?&quot;<br>B: &quot;I like the subject. I think it&apos;s pretty interesting.&quot;<br>A: &quot;Me too. But it&apos;s hard to sit in class when the weather is so nice.&quot;<br>B: &quot;Tell me about it. The weather has been so great lately.&quot;<br>A: &quot;So, what year are you?&quot;<br>B: &quot;I&apos;m a sophomore. How about you?&quot;<br>A: &quot;I&apos;m a freshman.&quot;<br>B: &quot;Where are you from around here?&quot;<br>A: &quot;No. I&apos;m from the east. I grew up in New York.&quot;<br>B: &quot;New York? That seems like a fun place.&quot;<br>A: &quot;More like a busy place. Everyone is always on the run over there.&quot;<br>B: &quot;I grew up in San Francisco.&quot;<br>A: &quot;That&apos;s not too far from here. Do you like living on the west coast?&quot;<br>B: &quot;I haven&apos;t been to many other places, but the west coast is a great place.&quot;<br>A: &quot;Yeah. I like it too.&quot;<br>B: &quot;Are you ready for the mid term next Friday?&quot;<br>A: &quot;I&apos;m so behind. I&apos;ve been going out a lot. I&apos;m having so much fun, but I really need to catch up on my school work.&quot;<br>B: &quot;Where do you usually hang out?&quot;<br>A: &quot;No where specific. We always do different things.&quot;<br>B: &quot;Have you been to Alcatraz yet?&quot;<br>A: &quot;Not yet. I want to go though.&quot;<br>B: &quot;I highly recommend it. It&apos;s an interesting place to visit.&quot;<br>A: &quot;Maybe you could take me there.&quot;<br>B: &quot;If you get a B or better on your midterm, I&apos;ll take you there.&quot;<br>A: &quot;Deal. It was great meeting you. I&apos;ll talk to you again tomorrow.&quot;<br>B: &quot;Ok. See you later.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L181/practice/L181P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L181/practice/L181P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L181/practice/L181P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;I can&apos;t believe it took you so long to ask me out on a date.&quot;<br>B: &quot;I always thought you like Mark, so I didn&apos;t think I had a chance.&quot;<br>A: &quot;I had this thing about him, but it&apos;s over. So, what do you like to do on your free time?&quot;<br>B: &quot;I like sports, watching movies, reading books. Things like that.&quot;<br>A: &quot;What type of movies do you like?&quot;<br>B: &quot;I like drama and comedy.&quot;<br>A: &quot;Me too. Mostly drama though. Have you seen Pay it forward?&quot;<br>B: &quot;Yeah. I loved that movie.&quot;<br>A: &quot;It&apos;s one of my favorites. I cried so much at the end.&quot;<br>B: &quot;I thought the idea of paying it forward was awesome.&quot;<br>A: &quot;What was your favorite comedy?&quot;<br>B: &quot;Do you remember the Three Amigos?&quot;<br>A: &quot;Vaguely. I was pretty little when that came out.&quot;<br>B: &quot;I don&apos;t remember it much back then, but I saw it again the other day and it cracked me up.&quot;<br>A: &quot;Maybe I need to see that movie again.&quot;<br>B: &quot;I think it is a classic. So many funny scenes.&quot;<br>A: &quot;I really liked the Mask with Jim Carrey.&quot;<br>B: &quot;He is hilarious. I love that guy.&quot;<br>A: &quot;I like most of his movies. He is such a character.&quot;<br>B: &quot;What else do you like to do?&quot;<br>A: &quot;Well, I like to exercise.&quot;<br>B: &quot;Where do you exercise?&quot;<br>A: &quot;I go to a health club by my house. But on a nice day, I like to jog around the lake.&quot;<br>B: &quot;That&apos;s good. I like to stay in shape too. But I do that by playing a lot of sports. Do you play any sports?&quot;<br>A: &quot;I played a little bit in high school, but nothing really these days.&quot;<br>B: &quot;Have you tried golf?&quot;<br>A: &quot;Don&apos;t start with that. My dad always nagged at me to play, but I never got into it.&quot;<br>B: &quot;What do you usually do with your friends?&quot;<br>A: &quot;We go out shopping a lot.&quot;<br>B: &quot;Where do you usually go?&quot;<br>A: &quot;Usually downtown. It&apos;s more fun in the city than in the mall. Plus, there are too many high school students at the mall.&quot;<br>B: &quot;I know some girls like bags, and some like shoes, what do you like to shop for the most?&quot;<br>A: &quot;I can never have too many pairs of shoes. I have like 30 pairs already, but I am always shopping for more.&quot;<br>B: &quot;Oh. The foods here.&quot;<br>A: &quot;Great. I&apos;m so hungry.&quot;<br>B: &quot;After dinner, do you want to catch a movie?&quot;<br>A: &quot;Sure. I&apos;m always up for a good movie.&quot;<br><br></td></tr><tr><td>3 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L181/practice/L181P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L181/practice/L181P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L181/practice/L181P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Mark. What are you doing?&quot;<br>B: &quot;Just watching some TV.&quot;<br>A: &quot;Anything interesting on?&quot;<br>B: &quot;Not really. Just watching the sports highlight on ESPN.&quot;<br>A: &quot;So I take it you&apos;re pretty bored too.&quot;<br>B: &quot;Just killing time until I find something to do. What are you up to?&quot;<br>A: &quot;It&apos;s Saturday and we are sitting at home doing nothing. What&apos;s wrong with us?&quot;<br>B: &quot;You wanna shoot some hoops?&quot;<br>A: &quot;I already tried to call up some of the guys, but they are all busy.&quot;<br>B: &quot;Where&apos;s your girlfriend? I thought you were going out with her today.&quot;<br>A: &quot;She&apos;s out shopping with her friends.&quot;<br>B: &quot;Let&apos;s go to Starbucks and think of something to do then.&quot;<br>A: &quot;Aright. Do you have any cigarettes?&quot;<br>B: &quot;I only have a couple left. Why don&apos;t you pick some up on the way.&quot;<br>A: &quot;Ok. See you there in about 30 minutes.&quot;<br>B: &quot;Aright. See you there.&quot;<br><br></td></tr><tr><td>4 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L181/practice/L181P4.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L181/practice/L181P4b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L181/practice/L181P4a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Damn Mark. I never noticed that belly of yours.&quot;<br>B: &quot;It&apos;s all the beer. I need to start working out again.&quot;<br>A: &quot;That reminds me. I should&apos;ve hit the gym today.&quot;<br>B: &quot;Where do you work out?&quot;<br>A: &quot;At Bally&apos;s. It&apos;s pretty close to home so it is convenient.&quot;<br>B: &quot;How much are you paying?&quot;<br>A: &quot;I only pay 20 bucks a month.&quot;<br>B: &quot;That&apos;s pretty good. I think I should join.&quot;<br>A: &quot;If you join, we could work out together. It&apos;s so much better working out with another person. It&apos;s hard to motivate yourself when you are alone.&quot;<br>B: &quot;What do you usually do in the gym?&quot;<br>A: &quot;I usually spend about 20 minutes on the step master, and then lift weights for about an hour.&quot;<br>B: &quot;Do you go everyday?&quot;<br>A: &quot;No. I try to go 4 times a week, but lately, I&apos;ve been only going about 2 times a week. That&apos;s why I need you there. You should join.&quot;<br>B: &quot;Will it help me to get some girls?&quot;<br>A: &quot;If you get rid of that belly of yours, I promise you&apos;ll have a better chance with girls. Anyways, there are so many fine chicks working out at the club.&quot;<br>B: &quot;Really? I&apos;m signing up tomorrow.&quot;<br>A: &quot;There are some girls with tight outfits. You can see the shape of their body and some of them are really fine.&quot;<br>B: &quot;As long as there are some ladies with nice legs, I don&apos;t mind.&quot;<br>A: &quot;So you&apos;re really going to join?&quot;<br>B: &quot;Yeah. Let&apos;s go in tomorrow and I&apos;ll sign up. We can work out together.&quot;<br>A: &quot;Cool. Let&apos;s go hit some bars to celebrate.&quot;<br>B: &quot;I&apos;m down with that.&quot;<br></td></tr></table>"
}