{
    "lessonIndex": 363,
    "categoryIndex": 1,
    "sectionIndex": 11,
    "title": "Organizing Time",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=246",
    "html": "\r\n<h1>\r\nOrganizing Time\r\n</h1>\r\nBeing able to manage your time efficiently can help relieve some stress of trying to get things done and also help accomplish goals in the proper time frame. &#xA0;We will take a look at a few different ways to better/help manage your time wisely.<br><br><b>Organizing Time</b><br><br>Just as stated above, managing your time can be an important tool in performing jobs in a time frame as well helping with some of the stress that comes with getting things done. &#xA0;Here are a number of ways/tools to help manage your time wisely. &#xA0;Using a daily calendar to mark down appointments, commitments, or special events will help remind you of what needs to be done. &#xA0;A monthly calendar can basically work the same way as a daily one but enable you to plan ahead far in advance.<br><br>Here are some questions commonly used when organizing your time.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P246/sentence/P246S1.mp3\">What is the best tool to organize time/appointments?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P246/sentence/P246S2.mp3\">Should I use monthly or a weekly planner?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P246/sentence/P246S3.mp3\">Should I carry my planner with me?</a>&quot;<br><br><b>Daily Planner</b><br><br>A daily planner will help you schedule your time wisely when dealing with a busy life full of events. &#xA0;Using a daily planner can help organize meetings, lunch plans and other responsibilities throughout your day. Daily planners come in all shapes and sizes. &#xA0;From writing things down to using an electronic planner, lots of options are available.<br><br>Here are some questions commonly used when using a daily planner.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P246/sentence/P246S4.mp3\">How do I know what to use as a daily planner?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P246/sentence/P246S5.mp3\">If I use an electronic planner should I set reminders?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P246/sentence/P246S6.mp3\">What if I have more things to do than the time to do it?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P246/sentence/P246S7.mp3\">What if I need to cancel something?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P246/sentence/P246S8.mp3\">What if I need to make an appointment?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P246/sentence/P246S9.mp3\">If I have someone at work who plans for me should I still keep a planner?</a>&quot;<br><br>Monthly Planner/Yearly Planner<br><br>A monthly or yearly planner is essentially the same as a daily planner except the fact that they allow you to plan far in advance. &#xA0;Just as daily planners can be as simple as writing things down on a calendar or using an electronic device to keep track, the same methods can be applied on a monthly or yearly planner. &#xA0;Managing your time, making and keeping appointments, and keeping notified of special events are all functions of a planner. &#xA0;<br>\r\n"
}