{
    "lessonIndex": 364,
    "categoryIndex": 1,
    "sectionIndex": 11,
    "title": "Habits and Health",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=247",
    "html": "\r\n<h1>\r\nHabits and Health\r\n</h1>\r\nHabits and heath are popular topics with almost everyone. &#xA0;From listening to the radio, watching T.V, or talking with friends, the topic of habits and health seem to always come up. &#xA0;Habits can include such things as smoking, drinking and eating and health topics can include dieting to exercising. &#xA0;Talking about these subjects with others depends on your comfort level or interest on the subjects. Often times these subjects come up because of curiosity or even by someone looking for other options. &#xA0;While information on these subjects is readily available for people to research on their own, it is important when talking about them to be caring and show respect while not telling someone what they SHOULD be doing but instead talk about your experience and thoughts while lending some support. <br><br><b>Habits</b><br><br>The definition of a habit is an unconscious pattern of behavior that is acquired through frequent repetition. &#xA0;Although you hear a lot about &apos;bad&apos; habits, not all are. &#xA0;You could have a habit of shaking hands when greeting someone or a habit of looking both ways before you cross the street for example. &#xA0;But without a doubt the &apos;bad&apos; habits are the ones you will hear the most about and the ones people like to discuss. &#xA0;Below you will find some questions associated with bad habits.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P247/sentence/P247S1.mp3\">How can I stop smoking?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P247/sentence/P247S2.mp3\">How can I cut down on drinking?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P247/sentence/P247S3.mp3\">How can I reduce my eating?</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P247/sentence/P247S4.mp3\">I should stop smoking.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P247/sentence/P247S5.mp3\">I think I drink too much.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P247/sentence/P247S6.mp3\">I have to watch what I eat.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P247/sentence/P247S7.mp3\">I have a bad habit of interrupting people when they speak.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P247/sentence/P247S8.mp3\">I have a habit of smoking when I drink.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/P247/sentence/P247S9.mp3\">Why are most habits bad for you? &#xA0;I wish I had a habit of eating vegetables.</a>&quot;<br>\r\n"
}