{
    "categoryIndex": 2,
    "sectionIndex": 0,
    "title": "Office Basics - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=443",
    "lessonIndex": 378,
    "html": "<h1>Office Basics - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B7/practice/B7P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B7/practice/B7P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B7/practice/B7P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;I can&apos;t get the printer to work.&quot;<br>B: &quot;Did you check to see if it had paper?&quot;<br>A: &quot;Yeah. That&apos;s the first thing I checked.&quot;<br>B: &quot;I don&apos;t know then. You might have to call the technician.&quot;<br>A: &quot;How do I do that?&quot;<br>B: &quot;Just tell the admin and she should take care of it.&quot;<br>A: &quot;Is there another printer that I can use?&quot;<br>B: &quot;Yeah. There&apos;s one down the hall next to the supply room.&quot;<br>A: &quot;Oh yeah... I remember that one. Thanks.&quot;<br>B: &quot;No problem.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B7/practice/B7P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B7/practice/B7P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B7/practice/B7P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Do you have a lot of work?&quot;<br>B: &quot;Yeah. I&apos;m pretty busy. Why?&quot;<br>A: &quot;Oh. I needed some help on documenting this process.&quot;<br>B: &quot;Does this have to be done right now?&quot;<br>A: &quot;The manager wants it by Friday.&quot;<br>B: &quot;I&apos;ll try to free up my schedule. Remind me again tomorrow morning, and I&apos;ll help you in the afternoon.&quot;<br>A: &quot;Do you need to read the documents first?&quot;<br>B: &quot;Yeah. That would help.&quot;<br>A: &quot;I&apos;ll print you a copy and then drop them off.&quot;<br>B: &quot;Make sure you drop it off before five because I have to leave early.&quot;<br>A: &quot;No problem. Thanks.&quot;<br><br></td></tr><tr><td>3 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B7/practice/B7P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B7/practice/B7P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B7/practice/B7P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Are you new here?&quot;<br>B: &quot;Yeah. I just started yesterday.&quot;<br>A: &quot;Welcome aboard. I&apos;m Jack.&quot;<br>B: &quot;I&apos;m Mark. Nice to meet you.&quot;<br>A: &quot;What are you going to be working on?&quot;<br>B: &quot;I&apos;m going to work on the planning team. But I haven&apos;t started yet. I&apos;m still in training.&quot;<br>A: &quot;The planning team is great. Our marketing team works with them closely. We&apos;ll end up working together sometimes.&quot;<br>B: &quot;That&apos;s great. Oh, can I ask you some questions?&quot;<br>A: &quot;Sure.&quot;<br>B: &quot;Does this company have a casual Friday?&quot;<br>A: &quot;Not really. You can get away with wearing slacks, but I&apos;ve never seen anyone wear jeans.&quot;<br>B: &quot;That&apos;s alright. Do you know any good places to eat around here?&quot;<br>A: &quot;Yeah there&apos;s a deli right across the street. They have fresh sandwiches and sometimes hot dishes like teriyaki. It&apos;s pretty good.&quot;<br>B: &quot;That sounds good. Thanks for the info.&quot;<br>A: &quot;No problem. If you need anything, I sit right around the corner here.&quot;<br></td></tr></table>"
}