{
    "lessonIndex": 380,
    "categoryIndex": 2,
    "sectionIndex": 1,
    "title": "Very Late",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=445",
    "html": "\r\n<h1>\r\nVery Late\r\n</h1>\r\nIf you are going to be a lot later than 5 minutes, then you should call your manager and tell them about it.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B9/sentence/B9S1.mp3\">Hi Barbara, I&apos;m going to be 30 minutes late today. &#xA0;My car is having trouble this morning, so I arranged for a ride with a friend.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B9/sentence/B9S2.mp3\">Hey Jack, I&apos;m running a little late today. &#xA0;I just got out of my dentist appointment and it was longer than I expected.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B9/sentence/B9S3.mp3\">Mark? &#xA0;This is Pat. &#xA0;I&apos;m stuck in traffic. &#xA0;I think there is an accident that is holding up traffic. &#xA0;I&apos;m going to be a little late.</a>&quot;<br><br><br>When you plan on being late ahead of time, it is much easier. &#xA0;For example, if you have a doctor&apos;s appointment in the morning, you can tell them in advance and then you don&apos;t have to worry about coming in on time.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B9/sentence/B9S4.mp3\">I have a doctor&apos;s appointment tomorrow morning. &#xA0;Remember I told you earlier this week? &#xA0;I&apos;ll come in right after my appointment.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B9/sentence/B9S5.mp3\">My daughter has been sick, so I&apos;m going to take her to see the doctor tomorrow morning. &#xA0;Is it ok if I&apos;m a little late? &#xA0;My appointment is at seven in the morning, so I&apos;ll only be an hour late.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B9/sentence/B9S6.mp3\">I have to take my parents to the airport tomorrow. &#xA0;I shouldn&apos;t be too late, but wanted to tell you ahead of time.</a>&quot;\r\n"
}