{
    "categoryIndex": 2,
    "sectionIndex": 2,
    "title": "Network share and public share",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=452",
    "lessonIndex": 387,
    "html": "\r\n<h1>\r\nNetwork share and public share\r\n</h1>\r\nNetwork share is a location on your network that you can access. &#xA0;The files are stored on a different computer. &#xA0;If you do not have a network set up in the office you work at, then you won&apos;t need this section.<br><br>In order for you to save data on a network share, you will need permission. &#xA0;The person in charge of the computer has the ability to add users. &#xA0;If you know of a public share and you cannot access it, then tell your administrator or the person in charge of that computer to give you permission.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B15/sentence/B15S1.mp3\">I have it saved on a network share. &#xA0;You can find it at <i>computername</i> public John data.doc.</a>&quot;<br><br>Whenever you tell someone a network location, you tell them the name by the path. &#xA0;I&apos;ll use the previous sentence as an example. &#xA0;<i>Computername</i> is the name of the computer, then the next word is a folder name. &#xA0;The next name is also a folder name. &#xA0;Finally, data.doc is the name of the file. &#xA0;So, the location of data.doc is in a folder named John that is under a folder called public under the computer <i>computername</i>. &#xA0;When you say a path verbally, you just leave a pause after each word or say slash between the words. &#xA0;In the written form, it looks like this, \\\\<i>computername</i>\\public\\John\\data.doc.<br><br>When people share documents, they save them on their own computer and put it in a folder that they made public. &#xA0;Or, a co-worker might have data saved on their computer. &#xA0;If you don&apos;t want to deal with the floppy disks, then you can retrieve the data from the network if they make the folder public.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B15/sentence/B15S2.mp3\">I have those files in my public folder. &#xA0;Just go to John01 public. &#xA0;You should see all the documents there.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B15/sentence/B15S3.mp3\">I saved it at John01 public. &#xA0;Go ahead and take what you need.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B15/sentence/B15S4.mp3\">I&apos;ll need all the information on ABC Company. &#xA0;Didn&apos;t you say you have the information? &#xA0;Can you put them on a public share?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B15/sentence/B15S5.mp3\">Hey John, I don&apos;t have permission to get into John01. &#xA0;Can you check the permissions on the folder?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B15/sentence/B15S6.mp3\">I don&apos;t have write access on the folder. &#xA0;Can you give me write permissions?</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B15/sentence/B15S7.mp3\">I don&apos;t want anybody changing the data, so everyone only has read permissions.</a>&quot;\r\n"
}