{
    "categoryIndex": 2,
    "sectionIndex": 2,
    "title": "Computer Related - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=461",
    "lessonIndex": 392,
    "html": "<h1>Computer Related - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B19/practice/B19P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B19/practice/B19P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B19/practice/B19P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Barbara, did you finish the report on XYZ Company?&quot;<br>B: &quot;Yes. I just finished today.&quot;<br>A: &quot;I would like to review them before we send the report. Can you give me a copy?&quot;<br>B: &quot;Sure. Would you like a hard copy?&quot;<br>A: &quot;No. Just send me the path to the location of the report. I&apos;ll look them over on my computer.&quot;<br>B: &quot;Sure. I&apos;ll give you permission for the folder. You can find them at barbara01 slash XYZ. I&apos;ll give you permission right now.&quot;<br>A: &quot;Great. Thanks.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B19/practice/B19P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B19/practice/B19P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B19/practice/B19P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;John, are you having problems with your network?&quot;<br>B: &quot;I think our whole network is down for upgrades. It should be back up in an hour.&quot;<br>A: &quot;That&apos;s too late. I need the review documents from the company network share.&quot;<br>B: &quot;I have a copy of that on my computer.&quot;<br>A: &quot;Really? Can I get a copy?&quot;<br>B: &quot;Sure. But since the network is down, I&apos;ll have to put it on a disk for you.&quot;<br>A: &quot;That would be great.&quot;<br>B: &quot;Do you have a floppy disk?&quot;<br>A: &quot;I think I have one on my desk. Here it is.&quot;<br>B: &quot;Ok. It&apos;s saving now. Here you go.&quot;<br>A: &quot;Thanks. You saved me a great deal of trouble. I&apos;m so glad you had a copy of this on your machine.&quot;<br>B: &quot;No problem. I&apos;m glad I could help.&quot;<br><br></td></tr><tr><td>3 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B19/practice/B19P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B19/practice/B19P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B19/practice/B19P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Don&apos;t we need a tax software to do this work?&quot;<br>B: &quot;Yeah. Don&apos;t you have it installed on your computer?&quot;<br>A: &quot;No. They said they would install it for me, but they didn&apos;t do it yet.&quot;<br>B: &quot;Go ask your manager. He probably forgot.&quot;<br>A: &quot;That&apos;s a good idea. Is there an instructional manual for this software?&quot;<br>B: &quot;It&apos;s in the second file cabinet under Software Applications.&quot;<br>A: &quot;Thanks. I&apos;ll probably need it when I get the software.&quot;<br>B: &quot;Actually, it&apos;s not that difficult to use. I think you should be able to figure it out without the manual. The manual is only good for advanced options that we don&apos;t really need.&quot;<br>A: &quot;You&apos;re probably right. Many of the manuals I&apos;ve read were not that helpful. Do you mind if I come to you for questions when I am using the software?&quot;<br>B: &quot;Not at all. Feel free to ask any questions. If I know the answer, I&apos;ll let you know.&quot;<br>A: &quot;Great. I better go find the manager to get the software installed on my computer.&quot;<br></td></tr></table>"
}