{
    "categoryIndex": 2,
    "sectionIndex": 3,
    "title": "Email - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=469",
    "lessonIndex": 400,
    "html": "<h1>Email - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B26/practice/B26P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B26/practice/B26P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B26/practice/B26P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;I&apos;ll have the report ready for review tonight. Will you be able to look at it tomorrow?&quot;<br>B: &quot;I&apos;m not going to be in the office tomorrow. Can you email it to me? I&apos;ll look at it from home.&quot;<br>A: &quot;Sure. What&apos;s your email address?&quot;<br>B: &quot;It is someone@hotmail.com.&quot;<br>A: &quot;The file is pretty big. Will the email allow me to send a file that big?&quot;<br>B: &quot;If it is under one mega byte, you shouldn&apos;t have a problem.&quot;<br>A: &quot;I don&apos;t think it&apos;s that big. I&apos;ll send it tonight. Just get back to me when you finish the review tomorrow.&quot;<br>B: &quot;Ok. I should be done with it by noon.&quot;<br>A: &quot;That would be great. Thanks.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B26/practice/B26P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B26/practice/B26P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B26/practice/B26P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;The manager wants us to work on the data analysis together.&quot;<br>B: &quot;Did you get an email from her?&quot;<br>A: &quot;Yeah. You were on the &#xB5;to&apos; line as well.&quot;<br>B: &quot;I never got it yet. When did you get the mail?&quot;<br>A: &quot;I got it about 30 minutes ago. Should we have her send the mail again?&quot;<br>B: &quot;No, I don&apos;t want to bother her right now. Can you just forward the mail to me?&quot;<br>A: &quot;No problem. I&apos;ll do it now.&quot;<br>B: &quot;I&apos;m still not getting it.&quot;<br>A: &quot;Maybe your exchange server is down.&quot;<br>B: &quot;I think you&apos;re right. Can you send it to my personal account? It is someone@hotmail.com.&quot;<br>A: &quot;Sure. Sending now.&quot;<br>B: &quot;I got it. Thanks for forwarding me the mail. After I read it, let&apos;s get together to discuss how we are going to work on the data analysis.&quot;<br>A: &quot;Perfect. Just ping me when ever.&quot;<br><br></td></tr><tr><td>3 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B26/practice/B26P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B26/practice/B26P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B26/practice/B26P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hi Jack, this is Cindy from the audit team.&quot;<br>B: &quot;Hi Cindy.&quot;<br>A: &quot;I&apos;m calling in regards to the 2003 bank statements you sent over to me last week. I cannot find the August statement. Can you resend that one by any chance?&quot;<br>B: &quot;I can fax them over to you in about an hour. Will that be ok?&quot;<br>A: &quot;That would be great. I also have questions on several of the withdrawals. Do you know who I should contact to straighten this out?&quot;<br>B: &quot;You should talk to Joe Smith. He is our senior accountant over here. His number is 555-123-4567.&quot;<br>A: &quot;That was Joe Smith at 555-123-4567?&quot;<br>B: &quot;That&apos;s correct.&quot;<br>A: &quot;Do you have his email address. I might need it later.&quot;<br>B: &quot;Sure. It&apos;s joesmith@ourcompany.com.&quot;<br>A: &quot;joesmith@ourcompany.com. Ok. Thanks for all your help.&quot;<br>B: &quot;No problem. Have a good day.&quot;<br>A: &quot;You too. Thanks again. Bye.&quot;<br></td></tr></table>"
}