{
    "lessonIndex": 401,
    "categoryIndex": 2,
    "sectionIndex": 4,
    "title": "Explanations and Presentations General",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=470",
    "html": "\r\n<h1>\r\nExplanations and Presentations General\r\n</h1>\r\nThis lesson will give some guidelines on how to explain something and how to speak during presentations. &#xA0;Because I cannot be specific to every topic, I&apos;ll choose general ones. &#xA0;You should primarily be looking at the structure and style for this Business English lesson.<br><br>It is understandable if you feel nervous or uneasy about having to explain something in <br>English. &#xA0;Because English is not your first language, it is very difficult. &#xA0;However, in the office, you will be in many situations when you have to explain something. &#xA0;Here are 3 tips to make your explanation or presentation easier.<br><br>First, you should not talk fast. &#xA0;I work in a large company with many different people from all over the world. &#xA0;The hardest time I have when listening to someone is when they talk fast with a bad accent. &#xA0;The problem they have is that they are fluent and comfortable speaking English, but they do not realize how bad their accent is. &#xA0;If you speak slower, you can avoid this problem. &#xA0;Unless you are certain that your accent is understandable, always speak a little slower.<br><br>Second, you should speak clearly. &#xA0;Say each word clearly and emphasize the important words. &#xA0;Even if they don&apos;t understand every word in your sentence, they will understand the whole meaning with proper emphasis.<br><br>Third, prepare and practice ahead of time. &#xA0;You should record yourself and listen to the recording. &#xA0;You should also get an American friend to judge you. &#xA0;This is a lot of work you have to do in the beginning, but this is VERY important. &#xA0;Even though it will make your presentation or explanation clearer and better, that is not the reason I am saying you should do the recording and getting a friend to listen. &#xA0;The reason why this is so important is because you are laying the foundation on proper communication in regards to intonation and pronunciation. &#xA0;For example, if you don&apos;t do this, you might think you don&apos;t have a problem and you will continue to practice incorrectly. &#xA0;Soon, you will be someone who can talk fast but have terrible pronunciation. &#xA0;You will become the type of people I described... hard to understand. &#xA0;If you take the time to practice for several hours before each presentation, you will be practicing the correct way to enhance your English abilities.\r\n"
}