{
    "lessonIndex": 403,
    "categoryIndex": 2,
    "sectionIndex": 4,
    "title": "Presentation",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=472",
    "html": "\r\n<h1>\r\nPresentation\r\n</h1>\r\nPresentations are longer than an explanation, but it is easier in the sense that you have time to prepare for it. &#xA0;The biggest mistake I have seen is that people do not use short simple sentences. &#xA0;Many of the best presentations from English speakers I have seen are those who use simple sentences that are easy to understand. &#xA0;Remember that a long paragraph can consist of 10 short sentences. &#xA0;It is still effective and much easier to say.<br><br>Many times, a person will be using a presentation software like Power Point. &#xA0;If that is the case, then you should prepare your slides and a separate document with your sentences for each slide. &#xA0;You shouldn&apos;t read them, but at least it is there just in case you forget to mention something. &#xA0;Use it as a preparation material before the presentation and reference during the presentation. &#xA0;Each sentence should be step by step explaining the content on the slide.<br><br>I am not going to be giving an example because presentations are all different depending on the subject. &#xA0;But keep in mind the process I explained on the house selling example. &#xA0;Keep the sentences short, speak slowly and clearly, put emphasis on key words, and leave a short pause after each sentence.<br><br>There are many times when you will have to explain something. &#xA0;Here are some questions you might hear.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B29/sentence/B29S1.mp3\">What did you do this week?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B29/sentence/B29S2.mp3\">What are you going to do next week?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B29/sentence/B29S3.mp3\">What is your schedule like for the next two weeks?</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B29/sentence/B29S4.mp3\">Can you explain how to perform an evaluation for a partner feedback?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B29/sentence/B29S5.mp3\">How do I perform a refund for a credit card purchase?</a>&quot;<br><br>There are numerous questions like these you might run into. &#xA0;To answer all of them, just follow the list example.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B29/sentence/B29S6.mp3\">This week, I finished the analysis on Ford Motor, I started writing a report on international market penetration, and I showed our new employee how to use our software.</a>&quot;<br><br>This example is very simple. &#xA0;It is basically a list of three things. &#xA0;You don&apos;t need to include any words in between.<br><br>You can use this same style of answer for many different types of questions.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B29/sentence/B29S7.mp3\">Next week, I have to finish my report, research information on GM Motors, and make a presentation on our market strategy.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B29/sentence/B29S8.mp3\">To perform a feedback on a partner you need to specify who the partner is, what project they worked on, the outcome of the project, where they need to improve, and finally what they did well.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B29/sentence/B29S9.mp3\">On the credit card machine, press the refund button. &#xA0;Then type in the credit card number and press enter. &#xA0;Type in the amount, and press enter. &#xA0;That&apos;s all you need to do.</a>&quot;<br><br>Whenever you are giving an explanation, remember the easiest way to do it is by giving a list and putting them together. &#xA0;In order to be able to do this, you must know how to say key words in your area of expertise.<br><br>When you have to give a presentation, remember that preparing is the most important. &#xA0;As I said earlier, take the time on your first several presentations to record yourself and find a friend to listen to your presentation.<br><br>Finally, let&apos;s review the three key steps you need to remember when giving an explanation or a presentation.<br><br>Don&apos;t talk fast: &#xA0;Even people with perfect English have this problem. &#xA0;Talking fast is not good when you are explaining something or giving a presentation.<br><br>Talk clearly: &#xA0;Making the words in each sentence clear will help anyone to understand you better.<br><br>Prepare and Practice: &#xA0;This is the most important. &#xA0;As time goes on, you will realize how much your preparation will help with your overall English skills.\r\n"
}