{
    "categoryIndex": 2,
    "sectionIndex": 6,
    "title": "Phone Call",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=478",
    "lessonIndex": 409,
    "html": "\r\n<h1>\r\nPhone Call\r\n</h1>\r\nTalking on the phone is very common in the office. &#xA0;You will be in a situation where you have to call someone, receive a phone call, leave a message, return a call, and a variety of other tasks. &#xA0;We will use this lesson to cover all the details about making and receiving phone calls.<br><br>Receiving a call is probably the easiest.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B35/sentence/B35S1.mp3\">Hello, this is Mike.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B35/sentence/B35S2.mp3\">Microsoft, this is Steve.</a>&quot;<br><br>Calling someone is a little more difficult. &#xA0;You should state your name, where you are from, what you are calling for, and the question. &#xA0;Let&apos;s give it a try through an example.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B35/sentence/B35S3.mp3\">Hi Mary, this is Michael Johnson from ABC Consulting. &#xA0;I am reviewing the financial data for the payroll project. &#xA0;I will need the 2002 fiscal report to complete this task. &#xA0;Do you know where I can get a copy?</a>&quot;<br><br>This example is very clear, organized, and concise. &#xA0;It first explains who the person is, what they are doing, and what they need. &#xA0;If you need to call someone to obtain information, you can use this type of sentence.<br><br>Let&apos;s try one more, but this time, you are asking for help.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B35/sentence/B35S4.mp3\">Hi Bob. &#xA0;This is Steven from ABC Company. &#xA0;I&apos;m calling in regards to the data entry program you created. &#xA0;I&apos;m having trouble locating where the connection is made to the server. &#xA0;Can you help me with this?</a>&quot;<br><br>Similarly, this phone call starts with an introduction of the person, a quick sentence on what the call is regarding, and a short description on what this person needs. &#xA0;If you are in this situation, use this process and write it down so you can say what you need smoothly. &#xA0;After you become familiar with it, you will not need to write it down anymore and you should be able to say it fluently.<br><br>If you have questions and a consultant or another business employee is visiting your company, then asking a question to them is very similar to asking a question to anyone else.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B35/sentence/B35S5.mp3\">Hi Bob. &#xA0;I&apos;m George. &#xA0;I&apos;m the technical writer for this project. &#xA0;I had a question regarding the installation process. &#xA0;If you have a minute, can you show me the installation process? &#xA0;I&apos;m having problems on the confirmation section.</a>&quot;<br><br>Usually, when a person is visiting your company, then it is polite to tell them your position so they can understand what type of help you will need. &#xA0;In the previous example, we used the same process of asking for help with an introduction, telling them what it is regarding, and what the problem or question is.<br><br><b>Verifying Information</b><br><br>Sometimes you have to verify an order, or double check a figure. &#xA0;If you have the information and you just want to verify that it is accurate, then you can use these types of sentences.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B35/sentence/B35S6.mp3\">Hi Debra, I&apos;m analyzing the log files and noticed entry 14 was negative 42. &#xA0;Can you confirm if this is accurate?</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B35/sentence/B35S7.mp3\">I see that our April 2003 revenue was 1.2 million dollars. &#xA0;Can you double check that this figure is accurate?</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B35/sentence/B35S8.mp3\">I am going to meet with the CFO in an hour. &#xA0;Can you look through this report and double check my findings? &#xA0;It should only take you 20 minutes or so.</a>&quot;\r\n"
}