{
    "lessonIndex": 414,
    "categoryIndex": 2,
    "sectionIndex": 6,
    "title": "Phone Call - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=483",
    "html": "<h1>Business Phone Call - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B39/practice/B39P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B39/practice/B39P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B39/practice/B39P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hello? This is Steve.&quot;<br>B: &quot;Hi Steve, this is Mary from ABC Company. I&apos;m returning your call.&quot;<br>A: &quot;Hi Mary. How are you doing?&quot;<br>B: &quot;I&apos;m doing great thanks.&quot;<br>A: &quot;Thanks for returning my call. I couldn&apos;t figure out why the ending balance on fiscal year 2003 didn&apos;t match the beginning balance on of 2004.&quot;<br>B: &quot;When I checked, it was matching. How much is the difference?&quot;<br>A: &quot;The amount is exactly $42,000.&quot;<br>B: &quot;Oh. I know what the problem is. We opened another bank account at the end of fiscal year 2003. I might not have included the new bank statements when I sent over the information.&quot;<br>A: &quot;That makes sense. I&apos;m just glad it wasn&apos;t out of my miscalculation. Can you send over the statements? I should be done by end of day since everything looks good.&quot;<br>B: &quot;Sure. I&apos;ll fax them to you immediately. Is 555-123-4567 the number I should fax it to?&quot;<br>A: &quot;Yes. That is the correct number.&quot;<br>B: &quot;I&apos;ll do it right now.&quot;<br>A: &quot;Thank you for your help.&quot;<br>B: &quot;I should have sent them over to you the first time. I apologize for that.&quot;<br>A: &quot;No problem.&quot;<br>B: &quot;Thank you.&quot;<br>A: &quot;Thank you. Bye.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B39/practice/B39P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B39/practice/B39P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B39/practice/B39P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hello, ABC Company.&quot;<br>B: &quot;Hi, this is Janet from Consult R Us. May I speak with Alex please?&quot;<br>A: &quot;He&apos;s in a meeting right now. Would you like to leave a message?&quot;<br>B: &quot;Yes. Can you have Alex call me back when he is available? My name again is Janet, and he can reach me at 555-987-6543.&quot;<br>A: &quot;It&apos;s Janet at 555-987-6543. Can I tell him what this is regarding?&quot;<br>B: &quot;He sent over a fax, and the last page didn&apos;t print out. I will need for him to resend the fax to me.&quot;<br>A: &quot;I&apos;ll let him know.&quot;<br>B: &quot;Thank you.&quot;<br>A: &quot;Thank you for calling ABC.&quot;<br>B: &quot;Good bye.&quot;<br>A: &quot;Bye.&quot;<br><br></td></tr><tr><td>3 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B39/practice/B39P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B39/practice/B39P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B39/practice/B39P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Microsoft, this is Steve.&quot;<br>B: &quot;Hi Steve, this is Richard from Third Hand Testing. I&apos;m calling in regards to the MSN assignment. Do you have a minute to answer a couple of questions?&quot;<br>A: &quot;Sure. What can I help you with?&quot;<br>B: &quot;We originally agreed on 5 testing procedures, but our program manager received a mail indicating 4 testing procedures. Is 4 the correct number?&quot;<br>A: &quot;Yes it is. We found that we can do the last one here.&quot;<br>B: &quot;Great. Does the timeline change because we reduced one of the testing procedures?&quot;<br>A: &quot;We don&apos;t have to change the timeline. Our original timeframe was very aggressive.&quot;<br>B: &quot;That makes our job a little easier.&quot;<br>A: &quot;Do you have any other questions?&quot;<br>B: &quot;No. That&apos;s all I had. Thanks for your time.&quot;<br>A: &quot;No problem.&quot;<br>B: &quot;Ok. Good bye.&quot;<br>A: &quot;Bye.&quot;<br></td></tr></table>"
}