{
    "categoryIndex": 2,
    "sectionIndex": 8,
    "title": "Asking for more work",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=491",
    "lessonIndex": 422,
    "html": "\r\n<h1>\r\nAsking for more work\r\n</h1>\r\nMost companies will have so much work that you will never run out of things to do. &#xA0;But there are times when you don&apos;t have enough to do. &#xA0;In this situation, you should ask your manager to give you more work.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B46/sentence/B46S1.mp3\">Hi Mark, I finished all my weekly duties already. &#xA0;Do you have more work I can do?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B46/sentence/B46S2.mp3\">I&apos;ve been completing my work early on a regular basis. &#xA0;Can I have more responsibilities?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B46/sentence/B46S3.mp3\">I have a lot of extra time. &#xA0;I usually double check all my work, but that doesn&apos;t take much time. &#xA0;Is there any additional work I can do?</a>&quot;<br><br>Although asking for more work is a good sign of being productive, there is actually something better. &#xA0;Instead of asking for more work, find the extra work without asking. &#xA0;After you find something to do, then tell your manager that you want to do the work.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B46/sentence/B46S4.mp3\">I had extra time on my hands so I started investigating the network problem. &#xA0;If you don&apos;t mind, I would like to work on this project to help the office productivity around here.</a>&quot;<br><br>If you are a manager, would you want someone asking you what to do, or would you prefer a worker who found a problem and wants to fix it. &#xA0;I have had people ask me for more work and it is stressful trying to think of something. &#xA0;I am busy and don&apos;t have that much time to find extra work. &#xA0;If a worker identifies more work to do, then I would appreciate it that much more.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B46/sentence/B46S5.mp3\">I have been completing my work a day early every week. &#xA0;I know the reference material has been sitting there for some time. &#xA0;Would you like me to do that project, or did you want to assign another project to me?</a>&quot;<br><br>Although having extra time to do more work is a good situation to be in, there might be times when you have too much work. &#xA0;Here are a couple of sentences to ask for help.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B46/sentence/B46S6.mp3\">Hi Mark, the addition we made to the project made it difficult to complete by myself. &#xA0;If the deadline doesn&apos;t change, I will need some help to complete it. &#xA0;Can you assign someone to help me out?</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B46/sentence/B46S7.mp3\">I have spent every minute on this project and have been putting in serious overtime. &#xA0;This project is a lot bigger than we anticipated. &#xA0;I am going to need some help to complete it on time. &#xA0;Do you have anyone available to help me?</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B46/sentence/B46S8.mp3\">The Alpha project has been eating so much of my time that I didn&apos;t have much time to work on the Beta project. &#xA0;Is there anyone with extra bandwidth to help me finish the Beta project?</a>&quot;\r\n"
}