{
    "lessonIndex": 423,
    "categoryIndex": 2,
    "sectionIndex": 8,
    "title": "Complaining and Showing Frustration",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=492",
    "html": "\r\n<h1>\r\nComplaining and Showing Frustration\r\n</h1>\r\nShowing frustration is ok if you do it right. &#xA0;If you are frustrated and you start complaining, then the manager will either think you are not capable of doing your work, or the manager will realize that you have way too much work. &#xA0;So it is important how you complain and how you show your frustration.<br><br>Showing frustration because of your mistake is ok to do. &#xA0;It shows that you are upset at yourself and that you can&apos;t believe you made a mistake. &#xA0;So it is indicating to the manager that you are not going to screw up again. &#xA0;Hopefully you won&apos;t screw anything up, but just in case, here are some ways to show your frustration.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B47/sentence/B47S1.mp3\">I can&apos;t believe I messed that up. &#xA0;I don&apos;t think I am stupid, but this is suggesting otherwise.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B47/sentence/B47S2.mp3\">I am so frustrated at myself. &#xA0;How did I not catch that?</a>&quot;<br><br>Complaining about someone else is not good. &#xA0;But if you are so frustrated and you have to tell your manager, take a deep breath, calm yourself down, and say something like my example as calmly as you can.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B47/sentence/B47S3.mp3\">It&apos;s frustrating working with Tim. &#xA0;I&apos;m doing everything I can to help and I am trying to be understanding, but he is slowing our project down immensely.</a>&quot;<br><br>The best kind of frustration is when the manager knows exactly what you are talking about. &#xA0;If the manager is frustrated as well, then he or she will completely understand. &#xA0;An example of this is when you are working with another company and they are not doing their work properly.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B47/sentence/B47S4.mp3\">I&apos;m having a hard time working with ABC Company. &#xA0;They are always late and the work they do has numerous errors. &#xA0;It is really frustrating because I have to spend a great deal of time proof reading the material. &#xA0;I recommend not giving ABC Company any more work.</a>&quot;\r\n"
}