{
    "categoryIndex": 2,
    "sectionIndex": 8,
    "title": "Talking to your boss about another boss",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=493",
    "lessonIndex": 424,
    "html": "\r\n<h1>\r\nTalking to your boss about another boss\r\n</h1>\r\nSometimes there are multiple bosses and they both give you work. &#xA0;This can cause some problems. &#xA0;The best way to handle this situation is to tell your direct boss what is happening so it gets straightened out at the management level.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B48/sentence/B48S1.mp3\">Hey Mark. &#xA0;I&apos;m doing all the projects you gave me, but John gives me additional work. &#xA0;I don&apos;t mind it, but lately it&apos;s been too much.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B48/sentence/B48S2.mp3\">Hey Mark. &#xA0;John has been assigning a lot of work to me. &#xA0;I have a lot of current work I am doing, so I would like to know what work has more priority.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B48/sentence/B48S3.mp3\">John wants me to do the payroll analysis. &#xA0;He said he needs it by end of week. &#xA0;But didn&apos;t you want the employee headcount finished by Friday? &#xA0;I can&apos;t finish both. &#xA0;What should I do first?</a>&quot;<br><br>If another boss is giving you a hard time, you can tell your manager what you think. &#xA0;Here are some professional sentences that you can use to show your frustration about another boss.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B48/sentence/B48S4.mp3\">I&apos;m having some problems with John lately. &#xA0;He is very critical and puts me down in public. &#xA0;I don&apos;t know what I am doing wrong so I don&apos;t know where I need to improve. &#xA0;What do you think I should do about this?</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B48/sentence/B48S5.mp3\">John has been very difficult to work with. &#xA0;He is very bossy and expects everything to be done his way. &#xA0;I have been tolerating it because he is a manager, but some of his methods are wasting a lot of time. &#xA0;I always suggest other ways, but he will not hear me out.</a>&quot;\r\n"
}