{
    "categoryIndex": 2,
    "sectionIndex": 9,
    "title": "Talking to your Subordinate or Direct",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=495",
    "lessonIndex": 426,
    "html": "\r\n<h1>\r\nTalking to your Subordinate or Direct\r\n</h1>\r\nIf you are a manager, then you will more likely have someone reporting to you. &#xA0;The most common terminology I am used to is a direct. &#xA0;Throughout this lesson, I will use the word direct.<br><br>There are many things you have to say to a direct. &#xA0;You have to give them work, explain things, encourage them to do better, and even reprimand them when they are not performing well. &#xA0;We will cover these types of sentences in this lesson.<br><br><b>Status</b><br><br>A common question a manager asks is to find out what the status of a project is.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B49/sentence/B49S1.mp3\">What is the status of the marketing documents?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B49/sentence/B49S2.mp3\">How far along are you in your analysis?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B49/sentence/B49S3.mp3\">Are you almost done with the technical report?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B49/sentence/B49S4.mp3\">When are you going to finish the design plans?</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B49/sentence/B49S5.mp3\">Can you give me a status on your progress so far?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B49/sentence/B49S6.mp3\">How is the reporting assignment going?</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B49/sentence/B49S7.mp3\">When can you give me a working draft by?</a>&quot;<br><br>Requesting a weekly status mail from your direct is very common among large companies with many employees. &#xA0;Basically, the status mail will include what has been accomplished the current week, and what will be done next week. &#xA0;If your company has this process, or if you just want to implement it yourself, you can tell your direct something like the following.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B49/sentence/B49S8.mp3\">At the end of every week, can you send me a weekly status mail? &#xA0;I&apos;ll email you a template you should follow. &#xA0;You should email it to me every Friday.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B49/sentence/B49S9.mp3\">I want you to send me a status report at the end of every week. &#xA0;You should include what you did for that week and what you plan on doing for the next week.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B49/sentence/B49S10.mp3\">Can you send me a weekly status report? &#xA0;If you haven&apos;t done it before, let me know and I will send you a template to use.</a>&quot;\r\n"
}