{
    "categoryIndex": 2,
    "sectionIndex": 10,
    "title": "Business Trip - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=506",
    "lessonIndex": 437,
    "html": "<h1>Business Trips - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B58/practice/B58P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B58/practice/B58P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B58/practice/B58P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Mark, I&apos;m assigning you on the Tully project. You&apos;ll have to go to California in two weeks.&quot;<br>B: &quot;What is my objective over there?&quot;<br>A: &quot;You have to review financial documents over there. If you find something missing, work with their accountants to get the documents you need to complete the analysis.&quot;<br>B: &quot;How large is this project?&quot;<br>A: &quot;It&apos;s pretty big, so take someone with you. I think you can finish in a week if two of you are working on it.&quot;<br>B: &quot;Do we have to arrive there at a certain time?&quot;<br>A: &quot;Not really, but you should get there before lunch to settle in. Then you can get in half a day.&quot;<br>B: &quot;Who should I contact when I get there?&quot;<br>A: &quot;I&apos;ll email you the details, but you should go book your flight soon.&quot;<br>B: &quot;Will do. Do you have a recommendation on who should go with me?&quot;<br>A: &quot;Either Seth or Josh.&quot;<br>B: &quot;Ok. I&apos;ll find out who has more time.&quot;<br>A: &quot;Great. Keep me informed.&quot;<br>B: &quot;Got it.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B58/practice/B58P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B58/practice/B58P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B58/practice/B58P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey Seth, you wanna go for lunch soon?&quot;<br>B: &quot;How about in 30 minutes. I&apos;m almost done with this section.&quot;<br>A: &quot;Ok. Where do you want to eat?&quot;<br>B: &quot;I&apos;m ok with anything, but let&apos;s go to a fast food place.&quot;<br>A: &quot;There&apos;s a Burger King around the corner. Let&apos;s go there.&quot;<br>B: &quot;Sounds good. One quick question... I&apos;m going to finish all my work tomorrow. If we finish tomorrow, I suggest we head back home tomorrow evening. What do you think?&quot;<br>A: &quot;I think that&apos;s doable. We&apos;ll see how much we get done today, and if we&apos;re close, I&apos;ll let them know that we&apos;ll be done tomorrow.&quot;<br>B: &quot;Sounds good.&quot;<br></td></tr></table>"
}