{
    "categoryIndex": 2,
    "sectionIndex": 11,
    "title": "Office and Cubicle - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=510",
    "lessonIndex": 441,
    "html": "<h1>Offices and Cubicles - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B61/practice/B61P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B61/practice/B61P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B61/practice/B61P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;How are things at work?&quot;<br>B: &quot;It&apos;s not too bad. But I hate our office setting.&quot;<br>A: &quot;Are you in a cubicle?&quot;<br>B: &quot;No. I would be happy with a cubicle. We have 10 desks all in a large room. The supervisor is at one end with a view of everyone.&quot;<br>A: &quot;That sucks. You have no privacy.&quot;<br>B: &quot;I know. I can&apos;t even take a small break because everyone is watching. But that&apos;s not the worst part. I can hear everyone talking all day long and it&apos;s so distracting.&quot;<br>A: &quot;I feel sorry for you.&quot;<br>B: &quot;I can&apos;t even complain about something to the supervisor because everyone can hear.&quot;<br>A: &quot;Why do they have the office set up like that?&quot;<br>B: &quot;I&apos;m not sure. Maybe they want to save money, or maybe they think it&apos;s more effective.&quot;<br>A: &quot;Is anybody in an office?&quot;<br>B: &quot;Only the people above the supervisor.&quot;<br>A: &quot;Maybe if they got out of their office and worked in the open space they would realize how terrible it is.&quot;<br>B: &quot;I guess I&apos;ll just have to tolerate it for now.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B61/practice/B61P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B61/practice/B61P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B61/practice/B61P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Do you have cubicles in your company?&quot;<br>B: &quot;No. Everyone has their own office.&quot;<br>A: &quot;You&apos;re so lucky. I&apos;m in a cubicle.&quot;<br>B: &quot;I&apos;m so glad we have our own office. There is so much privacy and we can take breaks whenever we want.&quot;<br>A: &quot;How does management know if you are working or not?&quot;<br>B: &quot;Our company doesn&apos;t really keep track of little details. Our performance is based on our assignments and projects. Management doesn&apos;t care when it&apos;s done, they just want the person to do a good job and turn it in on time.&quot;<br>A: &quot;I like that method. In our company, our manager wants to know every detail almost every hour. If we are a little behind, the manager gets mad and starts worrying.&quot;<br>B: &quot;I would hate that environment.&quot;<br>A: &quot;I agree. It&apos;s not a good work environment. Do you ever play video games in your office?&quot;<br>B: &quot;Not when it is busy, but when we are experiencing a down time, I close the door and start a game of Star Craft. If someone comes in, I quickly switch the view on the monitor.&quot;<br>A: &quot;You&apos;re so lucky.&quot;<br>B: &quot;I don&apos;t take it for granted, but I wouldn&apos;t mind a window office soon.&quot;<br>A: &quot;Shut up you freak.&quot;<br></td></tr></table>"
}