{
    "lessonIndex": 447,
    "categoryIndex": 2,
    "sectionIndex": 13,
    "title": "Quitting or Leaving Work",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=516",
    "html": "\r\n<h1>\r\nQuitting or Leaving Work\r\n</h1>\r\nWhen the time comes to leave work, you can do whatever you want. &#xA0;You can raise hell, say you hate everyone and yell out, &apos;I quit!!!&apos; &#xA0;But in other cases when you want to leave professionally, you can use this lesson to help.<br><br>There&apos;s a common phrase when you are leaving a company. &#xA0;&apos;Don&apos;t burn the bridge.&apos;<br><br>This is basically saying you should leave on a good term. &#xA0;If you leave on a good note, then you have the option of coming back to the company or your position if something goes wrong with your next job. &#xA0;So basically, you are leaving the bridge back to your position.<br><br>If you are leaving because you have an offer from a different company, here are some professional statements you can make to your manager.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B66/sentence/B66S1.mp3\">Hi Mark, I have a wonderful opportunity to work at a different company. &#xA0;I enjoyed my time here, but I shouldn&apos;t pass this up. &#xA0;I am putting in my two week notice.</a>&quot;<br><br>Remember that in the States, changing job is very common. &#xA0;So it is no big deal when you leave a company. &#xA0;Businesses understand the need for change and realize that some people want different challenges in their life. &#xA0;So don&apos;t be nervous when you have to leave.<br><br>Giving a two week notice is standard. &#xA0;This gives your current employer the chance to hire someone to replace you. &#xA0;It also gives some time for you to finish the remaining work you have to do. &#xA0;Not giving a two week notice is one way to burn a bridge. &#xA0;The new company you are going into should realize this and will not expect you to start your job immediately if you have to give a two week notice. &#xA0;If you don&apos;t have a job, then this doesn&apos;t apply to you.<br><br>Here is another example.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B66/sentence/B66S2.mp3\">Hi Mark, unfortunately I have to tell you that I am leaving the company. &#xA0;I really enjoyed my time here and I appreciated all your help on my tasks. &#xA0;I have to put in my two week notice.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B66/sentence/B66S3.mp3\">Hi Mark, I received an offer from a different company. &#xA0;This is a great opportunity for me so I accepted the offer. &#xA0;My decision on leaving is not because I didn&apos;t like my duties here. &#xA0;I really enjoyed my experience. &#xA0;But I am at a point where I want to find other challenges. &#xA0;I hope you can understand.</a>&quot;<br><br>I have seen some people leave the company to go on a year trip around the world. &#xA0;Others I have seen just wanted to spend more time with their kids. &#xA0;I know in some countries it is hard to get back into a company after you leave, but in the States, if you are a good employee, it is easy to get their job back. &#xA0;Many times after a long break, they returned to the same company.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B66/sentence/B66S4.mp3\">Mark, I have decided to leave the company. &#xA0;I have worked here for 10 years and I really enjoyed it. &#xA0;But I want to take a break and spend more time with my family. &#xA0;So I am putting in my two week notice.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/B66/sentence/B66S5.mp3\">Hi Mark, I have come to a decision to leave the company. &#xA0;I am going to travel for a year and this is the best time period for me to do so. &#xA0;I have always wanted to travel for an extended time period, and this is the only time I can do it. &#xA0;I can work for another month, so hopefully that should give you some time to find a replacement. &#xA0;And if you want, I can train the new employee on my areas.</a>&quot;\r\n"
}