{
    "lessonIndex": 450,
    "categoryIndex": 2,
    "sectionIndex": 13,
    "title": "Quitting or Leaving Work - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=519",
    "html": "<h1>Quitting or Leaving Work - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B68/practice/B68P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B68/practice/B68P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B68/practice/B68P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hi Mark, I have something important to tell you.&quot;<br>B: &quot;Come on in. What&apos;s on your mind?&quot;<br>A: &quot;Well, I have decided to leave the company. I had a wonderful time here, but it is time to move on for me.&quot;<br>B: &quot;May I ask why?&quot;<br>A: &quot;I got an offer from ABC Company. It&apos;s a management position and I really don&apos;t want to let this opportunity pass me by. You know I have been looking for a management position here, but all the positions here are full.&quot;<br>B: &quot;I understand your decision and you have my support.&quot;<br>A: &quot;Thanks for understanding. I can work here two more weeks.&quot;<br>B: &quot;Ok. Will you be able to finish your current assignment?&quot;<br>A: &quot;Yes I will. And if you hire someone within two weeks, I would be happy to provide training on my areas.&quot;<br>B: &quot;That would be great. We&apos;re going to miss you here.&quot;<br>A: &quot;I&apos;m going to miss this place too. Thanks.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/B68/practice/B68P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B68/practice/B68P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/B68/practice/B68P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hi Mary, I interviewed with another company and they offered me a position. I wanted to let you know before I made my decision.&quot;<br>B: &quot;I&apos;m sorry to hear that. But I appreciate you telling me before you accepted the offer.&quot;<br>A: &quot;I really enjoy my work here, but I was concerned about the lack of opportunities. I put in effort to gain more experience here, but the projects are limited.&quot;<br>B: &quot;What would help you to decide to stay?&quot;<br>A: &quot;I would consider staying more if I could change my position. I would love working in this same group, but I would like to be doing something different. And finally, they offered me 6 percent more than my current salary.&quot;<br>B: &quot;When do you have to make a decision by?&quot;<br>A: &quot;They want me to respond in a week.&quot;<br>B: &quot;Let me see what I can do and I&apos;ll let you know tomorrow or on Wednesday. Can you wait until then?&quot;<br>A: &quot;That&apos;s not a problem.&quot;<br>B: &quot;Great. I&apos;m going to do everything I can to keep you on board.&quot;<br>A: &quot;I appreciate what you are doing for me.&quot;<br>B: &quot;It&apos;s the least I can do. You&apos;re a valuable asset here.&quot;<br></td></tr></table>"
}