{
    "lessonIndex": 451,
    "categoryIndex": 3,
    "sectionIndex": 0,
    "title": "Tell me a little about yourself.",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=259",
    "html": "\r\n<h1>\r\nTell me a little about yourself.\r\n</h1>\r\n<strong>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I1/sentence/I1S1.mp3\">Tell me a little about yourself.</a>&quot;</strong><br><br>You should take this opportunity to show your communication skills by speaking clearly and concisely in an organized manner. Because there is no right or wrong answer for this question, it is important to appear friendly.<br><br><strong>Short Answers</strong><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I1/sentence/I1S2.mp3\">I attended MIT where I majored in Electrical Engineering. My hobbies include basketball, reading novels, and hiking.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I1/sentence/I1S3.mp3\">I grew up in Korea and studied accounting. I worked at an accounting firm for two years and I enjoy bicycling and jogging.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I1/sentence/I1S4.mp3\">I&#x2019;m an easy going person that works well with everyone. I enjoy being around different types of people and I like to always challenge myself to improve at everything I do.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I1/sentence/I1S5.mp3\">I&#x2019;m a hard worker and I like to take on a variety of challenges. I like pets, and in my spare time, I like to relax and read the newspaper.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I1/sentence/I1S6.mp3\">I&#x2019;ve always liked being balanced. When I work, I want to work hard. And outside of work, I like to engage in my personal activities such as golfing and fishing.</a>&quot;<br><br><strong>Long Answer</strong><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I1/sentence/I1S7.mp3\">I went to the University of Washington and majored in English Literature. I went to graduate school because I really enjoyed learning. Afterwards, I started my career at Boeing as a web content editor. I&#x2019;ve been there for 3 years now. Although my emphasis is in writing, I like numbers. I think solving logic problems and riddles are quite fun. I also enjoy jogging, reading, and watching movies.</a>&quot;<br><br>There is no right or wrong answer for this question. Most important thing you should remember is how you deliver the message. The example above shows a short answer telling a little bit about the person. The answer went from education to career, and then to personal interests all in a smooth flow.\r\n"
}