{
    "lessonIndex": 453,
    "categoryIndex": 3,
    "sectionIndex": 0,
    "title": "What are your weaknesses?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=261",
    "html": "\r\n<h1>\r\nWhat are your weaknesses?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I3/sentence/I3S1.mp3\">What are your weaknesses?</a>&quot;</b><br><br>For this answer, you should display a weakness that can be seen as a strength. &#xA0;There are many types of answers that will work. &#xA0;Some answers will be good answers for certain jobs, while the same answer will be a bad answer for a different job. &#xA0;Select an answer that will work for the position you are applying for. &#xA0;Here are a few examples.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I3/sentence/I3S2.mp3\">This might be bad, but in college I found that I procrastinated a lot. &#xA0;I realized this problem, and I&apos;m working on it by finishing my work ahead of schedule.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I3/sentence/I3S3.mp3\">I feel my weakness is not being detail oriented enough. &#xA0;I&apos;m a person that wants to accomplish as much as possible. &#xA0;I realized this hurts the quality and I&apos;m currently working on finding a balance between quantity and quality.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I3/sentence/I3S4.mp3\">I feel my English ability is my weakest trait. &#xA0;I know this is only a temporary problem. &#xA0;I&apos;m definitely studying hard to communicate more effectively.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I3/sentence/I3S5.mp3\">The weakest trait I struggled with was not asking for help. &#xA0;I always try to solve my own problems instead of asking a co-worker who might know the answer. &#xA0;This would save me more time and I would be more efficient. &#xA0;I&apos;m working on knowing when it would be beneficial to ask for help.</a>&quot;<br><br><b>Long Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I3/sentence/I3S6.mp3\">I think my weakest trait is my impatience. &#xA0;Whenever I work in a team and a member is not performing up to my expectations, I can get impatient and annoyed. &#xA0;I understand if they are working hard and their portion is difficult, but sometimes a person can&apos;t do the assignment due to incompetence or laziness. &#xA0;A while back I would get frustrated and start complaining, but I realized that I can help out by explaining things to some people and encouraging lazy people by reminding them of deadlines. &#xA0;I know it&apos;s bad to be impatient, but I&apos;m definitely working on it.</a>&quot;<br><br>&#xA0;&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I3/sentence/I3S7.mp3\">I&apos;m too detail oriented. &#xA0;I never want to leave anything out and I want everything to be perfect. &#xA0;This is bad because it slows down my work. &#xA0;Initially, I tried to work faster to compensate, but that only made me sloppy. &#xA0;So I decided to put more emphasis on priority and planning. &#xA0;By doing so, I&apos;m hoping that I can make the proper decisions on what to work on and what to intentionally leave out.</a>&quot;<br><br>Both of these examples show an answer that is acceptable. &#xA0;Although being impatient is not good, it shows that you are a quick learner and that you like efficiency. &#xA0;The second displays a person that is detail oriented, which can be seen as a good trait. &#xA0;Finally, both answers identify the weakness and show the actions of correcting it.\r\n"
}