{
    "lessonIndex": 455,
    "categoryIndex": 3,
    "sectionIndex": 0,
    "title": "What are your long term goals?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=263",
    "html": "\r\n<h1>\r\nWhat are your long term goals?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I5/sentence/I5S1.mp3\">What are your long term goals?</a>&quot;</b><br><br>This question is asked to see how serious a candidate is about his or her career. &#xA0;Some people might not know their long term goals, and some people might have long term goals of becoming rich and retiring early. &#xA0;Those are incorrect answers for this question. &#xA0;The type of answer you want to give is an ambitious answer that shows you really love your career. &#xA0;A good interviewer will read between the lines and find out if a person is going to be a hard worker or just a mediocre one. &#xA0;Being descriptive and shooting for a big goal is something interviewers want to hear.<br><br><b>Short Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I5/sentence/I5S2.mp3\">I would like to become a director or higher. &#xA0;This might be a little ambitious, but I know I&apos;m smart, and I&apos;m willing to work hard.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I5/sentence/I5S3.mp3\">After a successful career, I would love to write a book on office efficiency. &#xA0;I think working smart is important and I have many ideas. &#xA0;So after gaining more experience, I&apos;m going to try to write a book.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I5/sentence/I5S4.mp3\">I&apos;ve always loved to teach. &#xA0;I like to grow newer employees and help co-workers where ever I can. &#xA0;So in the future, I would love to be an instructor.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I5/sentence/I5S5.mp3\">I want to become a valued employee of a company. &#xA0;I want to make a difference and I&apos;m willing to work hard to achieve this goal. &#xA0;I don&apos;t want a regular career, I want a special career that I can be proud of.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I5/sentence/I5S6.mp3\">My long term goal is to become a partner for a consulting firm. &#xA0;I know the hard work involved in achieving this goal, and I know that many people fail to become a partner. &#xA0;That&apos;s not going to stop me from working hard, learning everything I can, and contributing to a company where I&apos;ll become a valuable asset. &#xA0;I know it&apos;s not a guarantee, but becoming a partner is a long term goal of mine, and I going to work towards this goal throughout my career.</a>&quot;<br><br>This example shows a candidate with a big goal. &#xA0;This person identifies the difficulty of the goal and shows the steps required to achieve this goal. &#xA0;Despite the difficulty, this candidate shows he or she will not get discouraged with difficult situations and will never give up. &#xA0;It is a short answer that goes a long way.\r\n"
}