{
    "lessonIndex": 456,
    "categoryIndex": 3,
    "sectionIndex": 0,
    "title": "What do you want to be doing five years from now?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=265",
    "html": "\r\n<h1>\r\nWhat do you want to be doing five years from now?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I6/sentence/I6S1.mp3\">What do you want to be doing five years from now?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I6/sentence/I6S2.mp3\">Where do you see yourself in five years?</a>&quot;</b><br><br>This is a similar question to the short term question, but you should answer it a little differently. &#xA0;Here are some examples.<br><br><b>Short Answers</b><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I6/sentence/I6S3.mp3\">In five years, I see myself as a valued employee of a company. &#xA0;I want to be an expert at my position and start training to be a manager.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I6/sentence/I6S4.mp3\">In five years, I want to be a senior analyst. &#xA0;I want my expertise to directly impact the company in a positive way.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I6/sentence/I6S5.mp3\">My goal is to become a lead in five years. &#xA0;Although not everyone gets promoted to this level, I believe I can achieve this goal through hard work.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I6/sentence/I6S6.mp3\">Although I really enjoy working hands on as a mechanical engineer, I want to eventually become a manager. &#xA0;I want to continue gaining experience, and after learning many different aspects, I see myself in management.</a>&quot;<br><br><b>Long Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I6/sentence/I6S7.mp3\">Five years from now, I would like to see myself in a management position. &#xA0;I&apos;m going to be learning and gaining practical experience until then, but eventually, I want to become a marketing manager. &#xA0;I know there are a lot of things to learn, but I&apos;m going to be working hard for the next five years. &#xA0;I believe opportunities come to great workers and I&apos;m going to try to be one of them.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I6/sentence/I6S8.mp3\">Five years from now, I want to be a senior sales manager. &#xA0;I&apos;m currently training to become a manager, and if I continue to work hard, I feel I&apos;ll have a management position soon. &#xA0;After gaining several years of experience as a sales manager, I want to be in a position where I can train and provide my expertise to newer sales managers.</a>&quot;<br><br>Both answers display characteristics of working hard. &#xA0;The second example also mentions that he or she wants to train newer managers. &#xA0;This is a good answer because it targets one good trait about upper management... the ability to train managers.\r\n"
}