{
    "lessonIndex": 457,
    "categoryIndex": 3,
    "sectionIndex": 0,
    "title": "If you could change one thing about your personality, what would it be...",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=266",
    "html": "\r\n<h1>\r\nIf you could change one thing about your personality, what would it be and why?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I7/sentence/I7S1.mp3\">If you could change one thing about your personality, what would it be and why?</a>&quot;</b><br><br>This question is another variation to the weakness question. &#xA0;You can provide a similar type of question unless it is the same person asking them. &#xA0;To answer this question, think of a person you respect and the trait they have that you really like. &#xA0;I used to have a manager that was very patient and explained things very carefully. &#xA0;I really liked this trait, so I&apos;m going to provide the long answer by using this example. &#xA0;But first, let&apos;s look at some short answers.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I7/sentence/I7S2.mp3\">I get easily frustrated at people who don&apos;t work very hard. &#xA0;But I know people have different work styles and different work habits. &#xA0;So if I could change something, I would like to be more understanding.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I7/sentence/I7S3.mp3\">I have high expectations and I have these expectations on others. &#xA0;I think if I was more understanding, I could help other workers improve instead of being disappointed.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I7/sentence/I7S4.mp3\">I would like to be more of a risk taker. &#xA0;I always do my work and complete it at an exceptional level, but sometimes taking a risk can make the work even better. &#xA0;I&apos;m working on this by thinking the issue through and weighing the pros and cons.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I7/sentence/I7S5.mp3\">I would like to be more of an extrovert. &#xA0;I&apos;m a little quiet and a little closer to the introvert side. &#xA0;I would like to change this because I would appear more friendly.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I7/sentence/I7S6.mp3\">I wish I was more patient with people. &#xA0;I remember a manager I had a couple of years ago. &#xA0;He was very patient with everyone. &#xA0;Even workers that were not that smart and failed to understand a concept to perform the job. &#xA0;I remember thinking how can this person who can&apos;t understand this concept continue to work here. &#xA0;My manager took a different approach. &#xA0;He was understanding of this worker and explained the concept in a different way. &#xA0;He even explained how to view problems from a different perspective. &#xA0;That helped this worker and in time that worker became a strong contributor. &#xA0;So if I could change one thing about me, I would like to be more patient and understanding. &#xA0;I&apos;m taking the steps to change for the better by remembering the actions of my past manager whenever I&apos;m in a similar situation.</a>&quot;<br><br>This is a little long, but if you can speak smoothly, it shows off your communication skills. &#xA0;Also, the content of the answer is not that bad. &#xA0;They want a personality problem, and this answer is showing impatience while indicating that you understand difficult concepts easily. &#xA0;It also shows that you are working on correcting the bad behavior.\r\n"
}