{
    "lessonIndex": 459,
    "categoryIndex": 3,
    "sectionIndex": 0,
    "title": "What does failure mean to you?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=268",
    "html": "\r\n<h1>\r\nWhat does failure mean to you?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I9/sentence/I9S1.mp3\">What does failure mean to you?</a>&quot;</b><br><br>This is quite simple. &#xA0;I don&apos;t see many right answers so this is what I suggest. &#xA0;You can believe in two of the following. &#xA0;One, you believe that failure is not achieving your goal no matter what. &#xA0;Or two, you can believe failure is only when nothing is learned from the failure. &#xA0;I believe in the latter, but you don&apos;t have to agree with me.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I9/sentence/I9S2.mp3\">Failure is when I do not reach my goal.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I9/sentence/I9S3.mp3\">I think to fail at something is making a mistake and not learning anything from it.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I9/sentence/I9S4.mp3\">To me, failure means to have a goal and not do anything about it.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I9/sentence/I9S5.mp3\">I think failure is not reaching your potential. &#xA0;If you do not use the resources you have and the resources around you, that&apos;s failure because the work or goal could have been done better.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I9/sentence/I9S6.mp3\">I think it&apos;s harder to fail than it is to succeed. &#xA0;The reason is, if you fail in a project, you can learn a valuable lesson from your mistake. &#xA0;Learning from the mistake will allow you to improve future projects, or to simply not repeat them. &#xA0;Just because I believe this, doesn&apos;t mean I believe it&apos;s acceptable to fail at a project, but just in case, I would try to learn everything I can... even when the end result wasn&apos;t that good. &#xA0;So, failure to me means making a mistake and having learned nothing from it.</a>&quot;<br><br>Nobody wants a failure. &#xA0;So you can feel that answering like this will be risky. &#xA0;However, this is a solid answer that most people agree with. &#xA0;If the person doesn&apos;t like this answer, then you might not want to work for this person. &#xA0;Everyone fails and if you work for someone who doesn&apos;t tolerate failure, then you will be in a difficult situation. &#xA0;Even vice presidents of large corporations will believe that learning from mistakes is a valuable lesson. &#xA0;This answer also states that you will do you best not to fail, but just in case, you want to gain something from your experience.\r\n"
}