{
    "categoryIndex": 3,
    "sectionIndex": 0,
    "title": "Are you an organized person?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=269",
    "lessonIndex": 460,
    "html": "\r\n<h1>\r\nAre you an organized person?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I10/sentence/I10S1.mp3\">Are you an organized person?</a>&quot;</b><br><br>You can think that this question is stupid. Actually, I do. &#xA0;Everyone will say they are organized. &#xA0;Who will admit otherwise? &#xA0;You should know that everyone will say similar things. &#xA0;Take this time to be creative with your answer. &#xA0;You can use these types of questions to leave a strong impression with a creative answer. &#xA0;Or, if you are not creative, then the best way to answer this question is with an example. &#xA0;Using a story is more believable and easier to remember. &#xA0;Feel free to mix in a little humor to make it more memorable.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I10/sentence/I10S2.mp3\">I&apos;m a very organized person. &#xA0;I like to know exactly what I&apos;m going to do for the day and the week. &#xA0;So I outline my tasks and organize my work load. &#xA0;By doing so, I can organize my time and work better.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I10/sentence/I10S3.mp3\">I believe I&apos;m very organized. &#xA0;I like to organize my work by priority and deadlines. &#xA0;I do this so I can produce the highest quality work in the amount of time I have.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I10/sentence/I10S4.mp3\">I think I&apos;m quite organized. &#xA0;I like my documents and papers in a way where I can retrieve them quickly. &#xA0;I also organize my work in a way where it&apos;s easy to see exactly what I&apos;m doing.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I10/sentence/I10S5.mp3\">Organization has always come easy to me. &#xA0;I naturally organize things like my desk, time, assignments, and work without thinking about them. &#xA0;This helps me tremendously during times when I&apos;m approaching a deadline.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I10/sentence/I10S6.mp3\">I&apos;m actually a very organized person. &#xA0;It&apos;s funny that you mention this because just the other day, my roommate wanted to borrow my suitcase and saw my closet. &#xA0;He made fun of me for organizing my clothes by length and color. &#xA0;I&apos;m like that with everything. &#xA0;It&apos;s just so much easier to manage things. &#xA0;However, I&apos;m not picky and don&apos;t need to have things in a certain way. &#xA0;I just want things to be organized. &#xA0;So yes, I consider myself organized.</a>&quot;<br><br>This example should only be done if you are confident with your communication abilities. &#xA0;If you appear awkward or if you sound like you are reading this type of answer, it could have a negative effect. &#xA0;Instead, you should make a generic answer if you are uncomfortable with this type of answer.\r\n"
}