{
    "lessonIndex": 467,
    "categoryIndex": 3,
    "sectionIndex": 1,
    "title": "Are you a risk taker or do you like to stay away from risks?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=276",
    "html": "\r\n<h1>\r\nAre you a risk taker or do you like to stay away from risks?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I17/sentence/I17S1.mp3\">Are you a risk taker or do you like to stay away from risks?</a>&quot;</b><br><br>This also depends on the position. &#xA0;But in most cases, I believe someone who likes to take risks is a better candidate. &#xA0;If you choose to answer saying you are a risk taker, you should include why and how you take risks.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I17/sentence/I17S2.mp3\">I consider myself to be in the middle, but if I were to choose from my past experience, I would think I would call myself a careful risk taker.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I17/sentence/I17S3.mp3\">I&apos;m reliable and believe in stability and guarantees. &#xA0;My work will be based on facts without assumptions or guesses, so I tend to stay away from risks.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I17/sentence/I17S4.mp3\">I think it&apos;s important to take some risks. &#xA0;I keep the options open and if the reward justifies the risks, I would definitely try. &#xA0;So I&apos;m more of a risk taker.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I17/sentence/I17S5.mp3\">I take risks because through planning and working smart, it&apos;s possible to reduce some of the risk. &#xA0;So if there&apos;s a reasonable chance of success, I would take the opportunity.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I17/sentence/I17S6.mp3\">I see myself as a risk taker. &#xA0;But before taking the risk, I always evaluate all other options, weigh the pro&apos;s and con&apos;s of success and failure, and after careful consideration, I would definitely take a risk if the rewards were high enough. &#xA0;I view staying away from risks similar to staying away from a gold mine surrounded by dynamite. &#xA0;Of course if you don&apos;t know what triggers the dynamite, it would be unwise to take that risk. &#xA0;But if you study the situation and know the location of all dynamite and the way they are triggered, then the risk is minimized. &#xA0;Some people would not explore the options to reduce the risk, but I would definitely study each situation and take a risk that would improve my personal or company&apos;s situation.</a>&quot;<br><br>You don&apos;t have to use the dynamite example. &#xA0;You can think of any other example. &#xA0;But I used this to clearly explain what I feel about taking risks. &#xA0;Not only did I choose to be a risk taker, but I also explained how and when I would take risks.\r\n"
}