{
    "lessonIndex": 469,
    "categoryIndex": 3,
    "sectionIndex": 1,
    "title": "Tell me about Q's... / Tell me about a time you made a mistake.",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=278",
    "html": "\r\n<h1>\r\nTell me about Q&apos;s... / Tell me about a time you made a mistake.\r\n</h1>\r\n<b>&apos;Tell me about...&apos;</b> type of questions are very popular. &#xA0;It is more effective because it is asking for an answer that comes from experience. &#xA0;If you don&apos;t have a particular experience in one of the questions below, make one up. &#xA0;You should prepare ahead of time because you don&apos;t want to make up a story during the interview. &#xA0;It will be too hard to sound believable. &#xA0;Finally, you should know that some questions will not be asked to certain job types. &#xA0;For example, if you are not in a management position, you probably won&apos;t be asked how you saved the company money. &#xA0;Or if you are not in sales, you won&apos;t be asked about making a great sale.<br><br>These types of answers are usually long because it is explaining an experience. &#xA0;If you want the interviewer to understand the significance of your story, they will need to understand it. &#xA0;So all my examples will be a little longer than regular interview questions. &#xA0;Finally, a lot of these are my own experiences. &#xA0;I encourage you to think back to your experience and create one. &#xA0;I&apos;m providing my answers so you can see the structure and learn from my answers.<br><br><b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I19/sentence/I19S1.mp3\">Tell me about a time you made a mistake.</a>&quot;</b><br><br>The best answer for this question involves learning something from a mistake. &#xA0;If you are having difficulty thinking about a mistake you made that will be an effective answer, try to think of a lesson you learned that improved a good trait. &#xA0;Making a mistake is not good, but since you have to tell them something, you should tell them something that makes you look good. &#xA0;For an example, let&apos;s create a scenario where you learned how to be someone who anticipates problems.<br><br><b>Short Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I19/sentence/I19S2.mp3\">I was given a project to complete in a week. &#xA0;I understood the project, but I misinterpreted one section. &#xA0;After completing the project, I was told by my manager that it was done incorrectly. &#xA0;I really made a mistake by assuming incorrectly in one of the sections instead of asking for clarification. &#xA0;I learned not to assume through the mistake I made.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I19/sentence/I19S3.mp3\">I had a project I was working on, and while I was in the middle of typing up my documentation, my computer started acting weird. &#xA0;It froze for a while and so I rebooted. &#xA0;After 10 minutes, the computer showed a blue screen saying that there were problems and recommended that I reboot the computer again. &#xA0;After another reboot, everything appeared to be ok. &#xA0;I continued my work and finished for the day. &#xA0;I spent two days on this assignment and when I went to retrieve my data the next day to double check my work, my computer wouldn&apos;t start up. &#xA0;A technician came and found that my hard drive malfunctioned. &#xA0;I lost all the data and lost two days of work. &#xA0;I was disappointed and thought I would never trust a computer again, but there was a great lesson to be learned. &#xA0;I had a couple of warnings and I ignored them. &#xA0;From then on, I practiced being someone who can anticipate problems. &#xA0;I now think of potential problems ahead of time and pay attention to details along the way. &#xA0;If I applied this sooner, I would have saved the data on another computer and I wouldn&apos;t have lost a couple days of work. &#xA0;But I can&apos;t say I regret making the mistake because it made me someone who can anticipate problems better.</a>&quot;<br><br>This is a minor mistake, and you can say it is really the computer&apos;s fault. &#xA0;But this is a good example because I wasn&apos;t really at fault. &#xA0;The computer was. &#xA0;But this example is wording it so it looks like the person&apos;s fault and it explains how a great lesson was learned. &#xA0;In the end, this candidate became a better person through this mistake. &#xA0;Learning from a mistake is probably the key point here, and this example demonstrates that.\r\n"
}