{
    "lessonIndex": 472,
    "categoryIndex": 3,
    "sectionIndex": 1,
    "title": "Tell me about a time you fired someone.",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=281",
    "html": "\r\n<h1>\r\nTell me about a time you fired someone.\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I22/sentence/I22S1.mp3\">Tell me about a time you fired someone.</a>&quot;</b><br><br>Firing someone is a difficult task. &#xA0;Usually you will not be asked this question unless it is for a management position. &#xA0;You should emphasize a couple of key things when you answer this question. &#xA0;First, you should be very professional about firing someone. &#xA0;Second, you should mention the procedures you took so the action of firing is justified. &#xA0;I&apos;ll give an example for someone who has never fired someone and an example for having fired someone.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I22/sentence/I22S2.mp3\">In my last position, I had four people reporting to me. &#xA0;One of my direct reports failed to show up on time, complete assignments, and really didn&apos;t care about the work. &#xA0;I tried to encourage the employee, assign different types of work to him, and even sat down and showed him how to do things. &#xA0;After 2 months of trying, I had to let him go.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I22/sentence/I22S3.mp3\">Our company was down sizing and I had to let two people go. &#xA0;It&apos;s easier when a person does a terrible job, but if everyone is doing there job, it&apos;s more difficult. &#xA0;I had to select the bottom two performers and explained why they were being let go.</a>&quot;<br><br><b>Long Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I22/sentence/I22S4.mp3\">During my second year as a manager, I had to fire one of my directs. &#xA0;I can&apos;t say it was a difficult task because not only did he not do his job well, he didn&apos;t want to try. &#xA0;Initially, we put him on probation monitoring his work, we tried to give him different types of work that he might do better at, and we even assigned a mentor to him. &#xA0;However, even through all this, he was a weak performer. &#xA0;I consulted with other management members and we all agreed it was best for the company to let him go. &#xA0;I got together with an HR representative and told him that he no longer has a job here. &#xA0;He wasn&apos;t surprised at all. &#xA0;He just picked up his things and left.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I22/sentence/I22S5.mp3\">I&apos;ve never had to fire somebody yet. &#xA0;I believe that a manager should mentor and lead all team members to be a solid performer. &#xA0;But I know that there are some people who can&apos;t or won&apos;t perform despite management&apos;s best effort. &#xA0;So in that case, I would have to let someone go in a professional manner following the procedures set by the company.</a>&quot;<br><br>Both of these are good answers. &#xA0;They mention that a manager should take actions to make the worker better, but sometimes turning something bad to something good is impossible, so the only action is to fire someone. &#xA0;The person with experience outlines the steps taken. &#xA0;For example, the probation, assigning different work, providing a mentor, etc. &#xA0;Then in the end he was fired. &#xA0;The second example shows despite experience, that he or she would fire someone in a professional manner following procedure.\r\n"
}