{
    "categoryIndex": 3,
    "sectionIndex": 1,
    "title": "Tell me about a time you hired someone.",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=282",
    "lessonIndex": 473,
    "html": "\r\n<h1>\r\nTell me about a time you hired someone.\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I23/sentence/I23S1.mp3\">Tell me about a time you hired someone.</a>&quot;</b><br><br>If you hired somebody before, you know you could have hired someone great, or someone bad. &#xA0;If you have both experiences, you can ask if they want to hear a bad hire experience or a good hire experience. &#xA0;Sometimes the question will be, tell me about the time you made a bad hire. &#xA0;In that case, then you don&apos;t have to ask. &#xA0;I&apos;ll give an example of a good hire and a bad hire.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I23/sentence/I23S2.mp3\">I found a resume on the Internet that was a perfect match for one of our open positions. &#xA0;I contacted the person and we talked for about 10 minutes. &#xA0;During that call, I explained why our company was a great place to work and the opportunities we offered. &#xA0;After a couple more calls, he agreed to come in for an interview and we made an offer. &#xA0;He became a great employee.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I23/sentence/I23S3.mp3\">I received a resume but it didn&apos;t have all our requirements. &#xA0;I initially thought she wasn&apos;t a fit, but after looking over the education background and the previous work experience, I thought this person would have more potential than other candidates. &#xA0;After interviewing her, we extended an offer. &#xA0;She was a quick learner and performed at an exceptional level. &#xA0;Sometimes it&apos;s important to see potential and in this instance, it was a great hire.</a>&quot;<br><br><b>Long Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I23/sentence/I23S4.mp3\">In the last company I worked for, we had a recruiting team. &#xA0;They go through all resumes and submit the ones that would be a good fit for a particular team. &#xA0;I received a resume and after looking it over, I was quite impressed. &#xA0;I called him for a phone interview and after that we scheduled a full interview. &#xA0;He aced almost every question given to him by 5 different interviewers. &#xA0;We made a reasonable and fair offer. &#xA0;He mentioned that he was considering another company. &#xA0;I called him to touch bases with him and reiterated the opportunities, the great environment here, and ultimately that we all looked forward to having him join our team. &#xA0;I tried to make the phone call more personal and warm to show him that our group was a place to be comfortable. &#xA0;He joined our team and became one of our strongest performers. &#xA0;It took a little extra work, but it&apos;s important to take extra steps when you see someone who is going to be great.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I23/sentence/I23S5.mp3\">I had one bad experience when hiring someone. &#xA0;I remember I was following procedures and verifying everything I could from past experience, checking communication skills, personality, work ethic, technical skills, and some tough logic problems. &#xA0;We even had 4 different people interviewing this candidate. &#xA0;Everything looked great. &#xA0;But when the person started, he had a hard time understanding new concepts. &#xA0;I originally thought it was because he was new and had to ramp up on many things, but as months past by, this employee was still unable to work alone. &#xA0;He always had to ask how to do even simple tasks. &#xA0;I remember going through his resume and looking over his background and even thinking about where we missed this flaw in the interview. &#xA0;Using this same interviewing procedure, we hired many great people. &#xA0;But this one turned out a little sour.</a>&quot;<br><br>The first question is straight forward. &#xA0;This person took it one step farther by making a phone call and encouraging the candidate to join his team. &#xA0;But the second answer is an example of doing everything right, but seeing bad results. &#xA0;You can use something like this, but if you do, you must think of follow up questions such as, &apos;what did you do to this employee? &#xA0;What happened in the long run? &#xA0;Did you end up firing this person&apos; &#xA0;But I recommend you think of a situation that you personally experienced. &#xA0;Then you can answer all follow up questions easily. &#xA0;But if you never hired anyone before, then simply say that. &#xA0;It shouldn&apos;t hurt unless it is for a recruiting position.\r\n"
}