{
    "lessonIndex": 475,
    "categoryIndex": 3,
    "sectionIndex": 1,
    "title": "Tell me about a time you found a solution to save the company money.",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=284",
    "html": "\r\n<h1>\r\nTell me about a time you found a solution to save the company money.\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I25/sentence/I25S1.mp3\">Tell me about a time you found a solution to save the company money.</a>&quot;</b><br><br>This question is also for a management level position. &#xA0;If you are not in management, then you probably won&apos;t face this question. &#xA0;But just in case, here are a couple of answers. &#xA0;If you are not in a position to save the company money, then you could think of something small.<br><br><b>Short Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I25/sentence/I25S2.mp3\">Hmmm... I wasn&apos;t really in any position to save the company money, but I have one small example. &#xA0;When we were a smaller company, we didn&apos;t get a significant corporate discount on our hardware. &#xA0;After we grew in size, we qualified for the larger discount, but nobody realized that we now met the quota. &#xA0;I pointed this out and we started saving 5% more on our hardware.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I25/sentence/I25S3.mp3\">We were outsourcing a portion of our work to a 3rd party company. &#xA0;We had two phases for this project. &#xA0;After the first phase, I was given the task to complete the work because the original worker responsible for this project left our group. &#xA0;I quickly got up to speed on the details of the work. &#xA0;I analyzed the information and realized that one portion of the work given to them could&apos;ve been done by our group because we already had the infrastructure in place. &#xA0;So I only spent half a day to set this up and in turn, we were charged 35% less for the second phase from the first one.</a>&quot;<br><br>This is a simple story of an experience. &#xA0;It doesn&apos;t include every detail on the type of work that was outsourced, or what I specifically did during the half days of work. &#xA0;If they choose to ask this, then I will be prepared to answer it, but this answer gives enough details to allow the interviewer to understand how you contributed in saving the company money. &#xA0;Also, depending on the field of work, answers will vary. &#xA0;If your job specifically oversees the finance, then it is probably important to think of a much better answer specifically for that position. &#xA0;Think of some scenarios, write them down, and feel free to ask us if the grammar is correct.\r\n"
}