{
    "categoryIndex": 3,
    "sectionIndex": 1,
    "title": "Tell me about a time you aimed too low.",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=286",
    "lessonIndex": 477,
    "html": "\r\n<h1>\r\nTell me about a time you aimed too low.\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I27/sentence/I27S1.mp3\">Tell me about a time you aimed too low.</a>&quot;</b><br><br>I have never been in sales, but the example answer I want to give is an example of answering the question while displaying good traits. &#xA0;Remember to be clear when explaining your experience and don&apos;t assume that they will understand everything. &#xA0;You should explain it step by step.<br><br><b>Short Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I27/sentence/I27S2.mp3\">There was a new project that I was interested in. &#xA0;Because I had other responsibilities, I didn&apos;t volunteer. &#xA0;I wasn&apos;t too busy, but I was worried I wouldn&apos;t complete the assignment on time. &#xA0;I realized I missed a wonderful opportunity because I aimed too low.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I27/sentence/I27S3.mp3\">When I was selling cell phones for Verizon Wireless, I had a great month where I reached the quota in just two weeks. &#xA0;My goal is to always break quota by more than 10 percent, and this month, I new it was going to be easy. &#xA0;I scheduled to take a week off to relax, and at the end of the month I surpassed the quota by 31%. &#xA0;I had an opportunity to break the location&apos;s record, but I didn&apos;t jump on the opportunity. &#xA0;I was basically thinking that having achieved my original goal of 10% was sufficient. &#xA0;But I think when opportunities arise, I should be flexible and willing to change my goal. &#xA0;I aimed too low and I missed a rare opportunity.</a>&quot;<br><br>This is not a bad mistake. &#xA0;You can say you were burned out, or needed to take some time off, or wanted to rejuvenate yourself. &#xA0;This answer doesn&apos;t show a failure, but shows a great success. &#xA0;In this example, aiming too low resulted in great numbers and great results at the end of the month, so there is no harm done. &#xA0;In the end you are indicating that you could have done even better, that you are willing to re-evaluate your goals, and that you are now able to see and jump on opportunities.\r\n"
}