{
    "lessonIndex": 479,
    "categoryIndex": 3,
    "sectionIndex": 1,
    "title": "Tell me about a time you went over budget.",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=288",
    "html": "\r\n<h1>\r\nTell me about a time you went over budget.\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I29/sentence/I29S1.mp3\">Tell me about a time you went over budget.</a>&quot;</b><br><br>If you go over budget, it is a bad sign. &#xA0;It can mean you are not organized, do not plan well, or are not good with finance. &#xA0;So when you think of an answer, make sure you justify it with a good reason. &#xA0;Here is an example of what I am talking about.<br><br><b>Short Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I29/sentence/I29S2.mp3\">During our marketing campaign, we realized how many customers we were gaining through the radio advertisements. &#xA0;Although we didn&apos;t have budget for more radio advertisement, I still made the decision to place our ad on three more stations. &#xA0;We increased sales by 25% for that month, but I ended up going over budget by 5%.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I29/sentence/I29S3.mp3\">There was a project that had a strict 4 month deadline. &#xA0;I didn&apos;t have enough employees to complete the task, so I had to hire temporary workers. &#xA0;I was given a budget to either hire three extra heads for four months or to hire four extra heads for three months. &#xA0;Because of the importance of the project and the strict deadline, I chose to hire 4 temporary workers for 3 months to give us a time cushion at the end. &#xA0;We had a couple of unexpected obstacles and it turned out that we needed the temporary workers for another two weeks. &#xA0;We completed the project on time and everything turned out well, but in this instance, I went over budget by 5%. &#xA0;Due to the importance of this project, I didn&apos;t want to risk slipping the date. &#xA0;Even though everyone was congratulating me on this accomplishment, I feel I could have done better if I calculated a cushion for unexpected obstacles.</a>&quot;<br><br>This answer is admitting to going over budget, but the reason was good enough. &#xA0;The answer indicates that by saying how everyone was happy and making sure to say how important the project was. &#xA0;In the end you say you learned something. &#xA0;But you can change this answer a little. &#xA0;If you want to be more clear on the importance of the project, you can say a monetary value, like it was a two million dollar deal, and going over budget by $10,000 was acceptable by upper management.\r\n"
}