{
    "categoryIndex": 3,
    "sectionIndex": 2,
    "title": "What extracurricular activities were you involved in?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=289",
    "lessonIndex": 480,
    "html": "\r\n<h1>\r\nWhat extracurricular activities were you involved in?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I30/sentence/I30S1.mp3\">What extracurricular activities were you involved in?</a>&quot;</b><br><br>If you don&apos;t have any work experience, then a company wants to know what extra activities you did in school to see if you are active. &#xA0;It is best to list a couple of things describing what the group is and what role you had in the group. &#xA0;If you were not a part of any group, it might be ok to make something up. &#xA0;It is hard to verify this so they will not find out. &#xA0;But it could back fire, if the interviewer happened to be in the same group at the same university.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I30/sentence/I30S2.mp3\">I was involved in our school newspaper. &#xA0;I was one of the writers for three years.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I30/sentence/I30S3.mp3\">I was very active in our university politics. &#xA0;In my senior year, I was the vice president of the University.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I30/sentence/I30S4.mp3\">Besides studying, I played baseball for our school. &#xA0;I really like to study and to stay physically active.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I30/sentence/I30S5.mp3\">I was involved with a group that helped awareness of environmental problems such as pollution. &#xA0;I was on a team that educated people about driving alternatives such as buses and carpooling.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I30/sentence/I30S6.mp3\">I was very active in the university magazine committee. &#xA0;I was a member of that group for four years. &#xA0;I helped write articles about events occurring in school. &#xA0;In my senior year, I was the editor and did less writing and more managing in regards to the magazine structure, what contents to add, and distributing work among the junior members of the group. &#xA0;I really enjoyed my experience there and learned about working closely together as a group to deliver a quality magazine.</a>&quot;<br><br>If you don&apos;t have work experience, then you will need to say something to show them that you learned some valuable lessons such as team work. &#xA0;I suggest you to reflect on what you did during school and create a list of what you learned.\r\n"
}