{
    "lessonIndex": 481,
    "categoryIndex": 3,
    "sectionIndex": 2,
    "title": "Why did you choose your major?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=290",
    "html": "\r\n<h1>\r\nWhy did you choose your major?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I31/sentence/I31S1.mp3\">Why did you choose your major?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I31/sentence/I31S2.mp3\">Why did you choose to major in History?</a>&quot;</b><br><br>If you are a computer science major interviewing for a computer position, then they will not ask you this question. &#xA0;But if you are an English Literature major and interview for a computer position, then they might want to know why you chose to major in English Literature. &#xA0;To create an answer for English Literature, you can say things learning to be a better communicator, having better reading comprehension, and say how skills learned from English Literature can be applied towards many fields. &#xA0;But something like History is different. &#xA0;Unless you are going to be a Historian, it&apos;s hard to justify how your major is going to help you in your job.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I31/sentence/I31S3.mp3\">I majored in History because I enjoyed learning about the past. &#xA0;I always try to apply my history knowledge in many things I do. &#xA0;This knowledge allowed me to study many different experiences.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I31/sentence/I31S4.mp3\">I majored in English because it was a major that would make me more skilled in reading, writing, and communicating. &#xA0;I believe English is a tool that is used everywhere, so I thought it was the best major for me.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I31/sentence/I31S5.mp3\">I majored in Psychology because I was interested in seeing how the mind works. &#xA0;I also found it useful because it helped me to work with people better by understanding differences in everyone.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I31/sentence/I31S6.mp3\">I majored in Biology because I initially wanted to go to med school. &#xA0;Although I decided not to go to med school, I still wanted to complete my bachelor&apos;s degree.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I31/sentence/I31S7.mp3\">I majored in History because I always had a strong interest in historical facts. &#xA0;I grew up very close to history and chose this major because I really enjoyed the subject. &#xA0;I planned on becoming a high school history teacher or even a professor, but then I started to get into computers. &#xA0;It&apos;s totally different from history but it really fascinated me. &#xA0;Now, instead of looking in the past, I&apos;m always looking into the future through all the technological changes.</a>&quot;<br><br>It doesn&apos;t connect the major to the job but at least it gives an explanation. &#xA0;It&apos;s not bad to say you majored in something because you liked the subject. &#xA0;The only bad answer is to say you didn&apos;t know what else to do and you couldn&apos;t get into a better department.\r\n"
}