{
    "lessonIndex": 482,
    "categoryIndex": 3,
    "sectionIndex": 2,
    "title": "If you redo college again, what would you major in?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=291",
    "html": "\r\n<h1>\r\nIf you redo college again, what would you major in?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I32/sentence/I32S1.mp3\">If you redo college again, what would you major in?</a>&quot;</b><br><br>I already explained this a little in another question about restarting your career. &#xA0;You can use the same answer here if you want, but I will give one more example of not changing your major in the long answer section.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I32/sentence/I32S2.mp3\">I didn&apos;t realize I was so interested in computers until I graduated college. &#xA0;So if I could select a different major, I would major in Computer Science.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I32/sentence/I32S3.mp3\">I liked the fact I completed my degree in English. &#xA0;But if I could redo college again, I would like to double major in English and Business.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I32/sentence/I32S4.mp3\">I would liked to have majored in Engineering. &#xA0;I have a strong interest in hardware so I believe Engineering would have helped.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I32/sentence/I32S5.mp3\">I would choose to major in Marketing in the Business School. &#xA0;I really enjoy this type of work and having more background would have helped me to excel more.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I32/sentence/I32S6.mp3\">If I were to redo college again, I don&apos;t think I would change my major. &#xA0;I liked the fact that I majored in Business and I believe it will help me with my career. &#xA0;I&apos;m pretty good with the computer, but I would like to have taken more computer classes. &#xA0;Because technology is growing so quickly, I think I would have benefited from having a deeper understanding in computers.</a>&quot;<br><br>This answer demonstrates a good choice in the beginning. &#xA0;I included the portion about computers because they want to see something you would have done differently. &#xA0;And making the comment about computers shows the interviewer your understanding about technology to some degree. &#xA0;But don&apos;t say this answer without first stating that you are pretty good with the computer.\r\n"
}