{
    "categoryIndex": 3,
    "sectionIndex": 2,
    "title": "What course did you like the most?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=292",
    "lessonIndex": 483,
    "html": "\r\n<h1>\r\nWhat course did you like the most?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I33/sentence/I33S1.mp3\">What course did you like the most?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I33/sentence/I33S2.mp3\">What was your favorite subject?</a>&quot;</b><br><br>When you answer this question, use a subject that helped you become a better person or a better worker. &#xA0;Although this question is asking for you opinion and there is no wrong answer, you should take advantage of this question by showing your strengths.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I33/sentence/I33S3.mp3\">I really enjoyed an English writing class I took. &#xA0;This class taught me to write more clearly and concisely.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I33/sentence/I33S4.mp3\">My favorite subject was Physics. &#xA0;It really helped my logic abilities and I use this knowledge to solve problems in a variety of ways.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I33/sentence/I33S5.mp3\">There was a speech class I took that I really enjoyed. &#xA0;It helped me to speak in groups better and I learned to speak professionally in front of an audience.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I33/sentence/I33S6.mp3\">My favorite subject was applied science. &#xA0;I really enjoyed learning different ways of applying science into ordinary things.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I33/sentence/I33S7.mp3\">I really enjoyed majoring in electrical engineering and it really helped me to prepare for my career, but the class I enjoyed the most is probably a couple of psychology classes I took. &#xA0;Although it didn&apos;t help me in any technical way, I learned a little bit about human behavior and learned how the brain works. &#xA0;I started to understand the reasons for my strengths and weakness instead of just knowing them. &#xA0;Also, it helped me to understand people who are different than me.</a>&quot;<br><br>This is a simple answer but a very good one. &#xA0;An engineer is mostly technical and they might lack skills in human interaction. &#xA0;So an engineer saying their favorite course was psychology demonstrates that this person has both technical skills and the ability to work with others better. &#xA0;It lists several good examples such as understanding both strengths and weakness along with understanding different people.\r\n"
}