{
    "lessonIndex": 485,
    "categoryIndex": 3,
    "sectionIndex": 2,
    "title": "How will your performance in your worst class affect your performance...",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=294",
    "html": "\r\n<h1>\r\nHow will your performance in your worst class affect your performance on this job?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I35/sentence/I35S1.mp3\">How will your performance in your worst class affect your performance on this job?</a>&quot;</b><br><br>This question is another opportunity to show many good traits. &#xA0;You can display traits such as endurance, effort, and willingness to work on things you don&apos;t like. &#xA0;This is very important because during your career, you will have to do many boring things. &#xA0;This long answer will display that you are a person that will do good at any task.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I35/sentence/I35S2.mp3\">No matter if I liked the class or not, I always tried my hardest. &#xA0;As a result, the lowest grade I ever received was a B. &#xA0;So I&apos;m confident that I&apos;ll be good at any task.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I35/sentence/I35S3.mp3\">I had one class where I really struggled. &#xA0;I asked more questions and studied more. &#xA0;As a result, I did very well. &#xA0;So even if I&apos;m struggling, I feel I can find ways to do a good job by putting in more effort.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I35/sentence/I35S4.mp3\">My performance in my worst class will positively impact my performance on this job. &#xA0;I struggled with a logic class, but I studied harder, researched more information, and I never gave up.</a>&quot;<br><br><b>Long Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I35/sentence/I35S5.mp3\">I remember I did terrible in my astrology class. &#xA0;I didn&apos;t have much interest in the subject and I really didn&apos;t know that I would struggle in it. &#xA0;I thought about just doing enough to make it through, but I decided that I was going to put some effort into it. &#xA0;I continually asked questions and studied more for this class than I did in others. &#xA0;I got a B for all my effort, but at least I didn&apos;t give up and I kept pushing forward. &#xA0;So now I know that whether I like a project or not, I&apos;ll do the best I can because it&apos;s my responsibility.</a>&quot;<br><br>This answer shows maturity and the interviewer should like it.\r\n"
}