{
    "categoryIndex": 3,
    "sectionIndex": 2,
    "title": "Why are you applying for a job that you didn’t major in?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=298",
    "lessonIndex": 489,
    "html": "\r\n<h1>\r\nWhy are you applying for a job that you didn&apos;t major in?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I39/sentence/I39S1.mp3\">Why are you applying for a job that you didn&apos;t major in?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I39/sentence/I39S2.mp3\">Why didn&apos;t you pursue a career in your major?</a>&quot;</b><br><br>In the United States the statistics for a person changing career paths is very high. &#xA0;It&apos;s something like an average person will change careers five times. &#xA0;Changing jobs is one thing, but completely changing careers is a big move. &#xA0;So this question is not that significant. &#xA0;If everyone worked in the industry as their major, then this question is more important, but because everyone changes jobs frequently, it&apos;s no big deal. &#xA0;You just have to use this opportunity to show them how much you like the current industry you are in.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I39/sentence/I39S3.mp3\">I majored in English because I liked to write. &#xA0;Because I didn&apos;t know exactly what I wanted to do, I majored in something I was very interested in. &#xA0;After working for a year on the marketing team, I realized that this is what I want to be doing.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I39/sentence/I39S4.mp3\">I majored in History, but during my senior year, I had an opportunity to work at an accounting firm. &#xA0;After seeing first hand at the work they were doing, I really wanted to become an accountant.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I39/sentence/I39S5.mp3\">I was planning on going to Dental School so I majored in Biology. &#xA0;After working with computers, I realized how interesting and challenging it was. &#xA0;So I studied computers on the side because I wanted a career working with computers.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I39/sentence/I39S6.mp3\">I enjoyed majoring in psychology, but I didn&apos;t want to become a psychologist. &#xA0;I just found the subject to be very interesting. &#xA0;It also helped me to understand a wide variety of things. &#xA0;For my career, I wanted to be doing something I was good at and what I enjoyed doing. &#xA0;I had an opportunity to work at a smaller logistics company as an administrative assistant. &#xA0;During that time period they were short handed and I actually got to do some planning and organizing for one of the smaller clients. &#xA0;I didn&apos;t lead anything, but I realized how much I enjoyed the work. &#xA0;Ever since then, I&apos;ve been studying up on planning, logistics, and business.</a>&quot;<br><br>This example does three things. &#xA0;It explains why this person is not going into a field related to their major, it is explaining why this person is going into logistics, and finally it is showing passion for the industry and a desire to learn. &#xA0;Since you are probably competing against people who majored in logistics, you need to make an impression with your answer. &#xA0;So you should definitely show enthusiasm here.\r\n"
}