{
    "categoryIndex": 3,
    "sectionIndex": 2,
    "title": "Did you do any internships?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=301",
    "lessonIndex": 492,
    "html": "\r\n<h1>\r\nDid you do any internships?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I42/sentence/I42S1.mp3\">Did you do any internships?</a>&quot;</b><br><br>You should be asked this question if your resume doesn&apos;t have any internship experience, or if they didn&apos;t look at your resume. &#xA0;If you do have internship experience, then you can answer, that you do and say the same answer as the one provided with the question, what did you learn from your internship. &#xA0;But if you don&apos;t, you can simply answer that &#xA0;you didn&apos;t do any internship but give a good excuse.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I42/sentence/I42S2.mp3\">Yes. &#xA0;I did two internships. &#xA0;The first internship was for Johnson and Johnson. &#xA0;I worked in the distribution team, and my second internship was for Starbucks. &#xA0;At Starbucks, I had the opportunity to work on overseas venture.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I42/sentence/I42S3.mp3\">I did one internship for IBM. &#xA0;I was on the development team creating applications for business solutions.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I42/sentence/I42S4.mp3\">I love to travel and I realized that when I start my career, I won&apos;t be able to travel for long durations. &#xA0;So I used my summers to travel a lot. &#xA0;I spent one summer in Europe for 2 months. &#xA0;I spent another summer traveling between China and some South East Asian countries, and finally, I took a road trip through the United States.</a>&quot;<br><br>Traveling is not a bad answer. &#xA0;It is not as good as doing an internship, but definitely better than nothing. &#xA0;It is definitely not a wasted summer. &#xA0;Also, if the internship was useless and generic, then the interviewer will not remember this answer as a good answer. &#xA0;So it didn&apos;t do any good. &#xA0;In this case, traveling could be better because the example I gave is significant and interesting. &#xA0;Something different always stands out more.\r\n"
}