{
    "categoryIndex": 3,
    "sectionIndex": 3,
    "title": "During your performance reviews, what criticism do you hear the most?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=304",
    "lessonIndex": 495,
    "html": "\r\n<h1>\r\nDuring your performance reviews, what criticism do you hear the most?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I45/sentence/I45S1.mp3\">During your performance reviews, what criticism do you hear the most?</a>&quot;</b><br><br>This question is primarily for people with work experience. &#xA0;If you are fresh out of college, then you will not be asked this question. &#xA0;The answer to this question should not disclose any real faults. &#xA0;Instead, try to think of something that doesn&apos;t sound too bad. &#xA0;Here is what I hear at my reviews and this is how I would answer this question.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I45/sentence/I45S2.mp3\">I heard that I need to be proactive. &#xA0;I always perform at an exceptional level, but I didn&apos;t volunteer for additional work. &#xA0;I wasn&apos;t accustomed to it so I&apos;m glad that I received this criticism. &#xA0;I now practice keeping an eye out for additional projects I can take on.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I45/sentence/I45S3.mp3\">During my review, my manager told me to voice my opinions more frequently. &#xA0;He always liked my suggestions when I told him, but in group meetings, I usually let my manager speak. &#xA0;Now, I feel more confident that I can suggest my ideas in groups.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I45/sentence/I45S4.mp3\">My manager told me that I should send more updates. &#xA0;He told me I did my projects well, and that I was never late, but he would like more updates so he can report to his manager.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I45/sentence/I45S5.mp3\">I actually like to receive criticism because it gives me information on how to improve. &#xA0;But the most common criticism I hear is hard to correct because I disagree with the comment. &#xA0;I&apos;m told that I should be more visible. &#xA0;I&apos;m told that I do great work and I do a lot of extra work, but in a large organization, it&apos;s important to visibly stand out. &#xA0;I&apos;m not a person who likes to be secluded in the office. &#xA0;I like to go out and collaborate, I like to work with people, and I email my co-workers with valuable information that will help with their job, so I can&apos;t say I agree, but I always try to be more visible.</a>&quot;<br><br>This criticism is actually a common comment used by managers if they can&apos;t give you a good review score but have nothing bad to say about you. &#xA0;In large organizations, you are measured against your peers. &#xA0;That means if you do well, you might get a bad review score because everyone did better. &#xA0;Likewise, if you are just mediocre and everyone else is terrible, you will get a good review score. &#xA0;Because of this system, I&apos;m regularly told to be more visible. &#xA0;So when I answer this question, I make sure to back up my disagreement with examples of being visible.\r\n"
}