{
    "categoryIndex": 3,
    "sectionIndex": 3,
    "title": "Tell me about your last three positions?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=305",
    "lessonIndex": 496,
    "html": "\r\n<h1>\r\nTell me about your last three positions?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I46/sentence/I46S1.mp3\">Tell me about your last three positions?</a>&quot;</b><br><br>This type of question is generally asked by lazy interviewers who want to hear you talk for a while. &#xA0;A better question would be to separate the three positions and ask them one by one. &#xA0;But some people will ask this question, so you should definitely prepare for it. &#xA0;You can use this as your advantage. &#xA0;If you don&apos;t have many good things to say about your second position, you can briefly comment on it and spend more time talking about the other two positions. &#xA0;I&apos;ll give an example in the long answer, but here are some short answers first.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I46/sentence/I46S2.mp3\">I&apos;ve only had one position. &#xA0;In my last position, I worked as a marketing analyst for South American markets. &#xA0;I worked closely with partners in Chile and Argentina.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I46/sentence/I46S3.mp3\">I&apos;ve only held two different positions. &#xA0;In my first job, I was a lab manager for ABC Software company. &#xA0;I monitored 50 computers and performed diagnostics regularly. &#xA0;In my last position, I was a network engineer fixing network problems and trouble shooting bottlenecks.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I46/sentence/I46S4.mp3\">I worked as a translator for the King County court house. &#xA0;Afterwards, I worked as a translator for hospitals. &#xA0;My last position was translating help documents for a software company.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I46/sentence/I46S5.mp3\">The first position I held was working at Radio Shack as a salesman. &#xA0;I learned a great deal about retail stores, about sales and working with customers, and became more independent. &#xA0;I thought I learned a great deal and enjoyed my work, but I wanted to experience different types of work. &#xA0;So I started working for Verizon. &#xA0;I had an office job and did a variety of different tasks such as planning, data entry, and organizing projects. &#xA0;I learned a little about the office setting, but I wanted to get back into sales. &#xA0;So I was given an opportunity to sell cell phones for Verizon at a retail store. &#xA0;I used my past sales experience and worked hard becoming one of the top sales person three years in a row. &#xA0;I&apos;ve been there ever since.</a>&quot;<br><br>I haven&apos;t worked at three different positions, so I just made one up. &#xA0;The question is pretty general, so the answer is pretty general. &#xA0;It does emphasize sales skill and coming back to the type of work that this person enjoys. &#xA0;But you should think of something that is related to the position you are interviewing for. &#xA0;Only thing you should be concerned about it clearly explaining your past three positions, what you learned there, and if you did something notable, include that as well.\r\n"
}