{
    "categoryIndex": 3,
    "sectionIndex": 3,
    "title": "What is your management philosophy?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=307",
    "lessonIndex": 498,
    "html": "\r\n<h1>\r\nWhat is your management philosophy?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I48/sentence/I48S1.mp3\">What is your management philosophy?</a>&quot;</b><br><br>This is another question only for managers and above. &#xA0;You can make this short or long, but in the least it should be an answer that stands out. &#xA0;Think of a guideline that you follow as a manager that you think is a good philosophy to follow.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I48/sentence/I48S2.mp3\">I think management should provide guidance, direction, leadership, and finally set an example to subordinates.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I48/sentence/I48S3.mp3\">My management philosophy is to provide an environment that leads to productive employees. &#xA0;I achieve this through conflict management, keeping the morale high, providing encouragement to low performers, and also rewarding the strong performers.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I48/sentence/I48S4.mp3\">I believe in setting an example. &#xA0;My favorite managers in the past were the ones that worked smart and efficiently. &#xA0;I learned a great deal and found that leading by example is a strong way to influence directs to work diligently.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I48/sentence/I48S5.mp3\">Before I was in management, I had many types of managers. &#xA0;I learned a lot from observing their management styles. &#xA0;I also learned a lot from the bad managers I had. &#xA0;I had a manger who was never there, another that didn&apos;t care, and another that had a phrase similar to, &apos;do as I say, not as I do.&apos; &#xA0;So the traits I acquired are from my good managers such as working smart instead of working long, but the philosophy I always think about is from my bad managers. &#xA0;So I believe I should lead by example, provide guidance and growth by giving important feedback, and to be accessible to everyone.</a>&quot;<br><br>If you want a shorter answer that is to the point, you can consider this one.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I48/sentence/I48S6.mp3\">I believe management should provide guidance for employees to do their job well. &#xA0;This includes several meanings. &#xA0;First, it means management should provide challenging tasks related to the job that gives employees experience. &#xA0;This also stretches their abilities and brings growth. &#xA0;Also, by guiding employees to do their job well, it benefits the company by having productive employees.</a>&quot;<br><br>Questions that are related to what you think should differ person to person. &#xA0;So think what your management philosophy is and write it down. &#xA0;Put more thought into it and then you will be able to explain exactly what you mean. &#xA0;If you have no idea, then consider what I wrote down in my two examples above.\r\n"
}