{
    "lessonIndex": 499,
    "categoryIndex": 3,
    "sectionIndex": 3,
    "title": "What was your favorite job?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=308",
    "html": "\r\n<h1>\r\nWhat was your favorite job?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I49/sentence/I49S1.mp3\">What was your favorite job?</a>&quot;</b><br><br>I have never been asked this question, but I know some people who ran into it. &#xA0;That means you should at least give it a little thought so you can think of a good answer ahead of time. &#xA0;The best way to answer this question is to select a job that is most similar to the job that you are applying for. &#xA0;For example, if a person who is applying to be a financial analyst says their favorite job was being a salesman, then the answer is basically useless and not effective at all. &#xA0;Rather, you should say that you like your last marketing job because you have passion for it and you really enjoy it. &#xA0;Many people fail interviews based on lack of enthusiasm. &#xA0;So make sure you show them that you love the job you are applying for.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I49/sentence/I49S2.mp3\">My favorite job was working as a financial analyst. &#xA0;I wanted to pursue other areas of finance so I accepted a position as a financial consultant. &#xA0;After a while, I realized how much I enjoyed my work as a financial analyst so I&apos;m looking for a financial analyst position.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I49/sentence/I49S3.mp3\">The last position I held was my favorite job. &#xA0;I really enjoy all aspects of accounting and auditing. &#xA0;However, I don&apos;t want to limit myself to just governmental accounting so I want a position where I can be doing similar type of work but in a larger setting.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I49/sentence/I49S4.mp3\">My favorite job was the last position I held in the marketing department. &#xA0;That&apos;s why I&apos;m applying for this job. &#xA0;It&apos;s similar to my last position and I really enjoyed it. &#xA0;Even though I really like my job, I want to experience the same work for a larger company. &#xA0;That&apos;s the primary reason for wanting to leave my current job.</a>&quot;<br><br>This answer is brief but effective. &#xA0;It states that this person loves marketing. &#xA0;The second part of the answer is basically answering a question before it is asked. &#xA0;If you love your job, why are you leaving? &#xA0;You can answer this in several ways, but my example is using the excuse of wanting to work for a larger company because it shows that I want to take the next step in my career. &#xA0;It shows that I want to grow and that I want to go to bigger and better opportunities. &#xA0;Basically, it is showing a little ambition without saying it directly.\r\n"
}