{
    "categoryIndex": 3,
    "sectionIndex": 3,
    "title": "Tell me about the best manager you ever had.",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=309",
    "lessonIndex": 500,
    "html": "\r\n<h1>\r\nTell me about the best manager you ever had.\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I50/sentence/I50S1.mp3\">Tell me about the best manager you ever had.</a>&quot;</b><br><br>This question is primarily used to see what you value in a manager. &#xA0;The best way to answer this question is to explain a little bit about the manager and list the things you respect. &#xA0;Also include that you learned how to become a good manager through your experience with your good manager.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I50/sentence/I50S2.mp3\">My favorite manager was a person with a lot of knowledge. &#xA0;She stood her ground firmly and knew the best process to take by analyzing all the information.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I50/sentence/I50S3.mp3\">My favorite manager was very trusting and easy to approach. &#xA0;I grew in many ways under this manager and I valued his method of dealing with directs. &#xA0;I believe in growing employees and this manager did a great job.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I50/sentence/I50S4.mp3\">I had a manager that worked efficiently. &#xA0;Instead of bossing everyone around, he set an example of hard work through his actions. &#xA0;I respected that trait and learned to be more like him by working smarter.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I50/sentence/I50S5.mp3\">The best manager I had was during my first year at Microsoft. &#xA0;Since then, I have been under many different managers, but nobody matched up to his level. &#xA0;I respected him the most because of two reasons. &#xA0;He spent a great deal of time mentoring me and teaching me many work related things. &#xA0;I became a great employee because of him. &#xA0;And second, he produced the greatest amount of quality work among all the other managers. &#xA0;I always wondered how he could spend so much time with me and still find ways to out perform other managers. &#xA0;But that is where I learned how to work smart and efficiently. &#xA0;He showed me how to be the best employee through his action and through the individual lessons he gave me. &#xA0;I was so happy to have had a great manager early in my career.</a>&quot;<br><br>This is an easy answer for me because I was truly amazed at my first manager. &#xA0;I made sure to explain why he was the best manager and what I learned from him. &#xA0;Another reason why it is important to be able to answer this question is because most great employees were taught by a great manager.\r\n"
}