{
    "lessonIndex": 507,
    "categoryIndex": 3,
    "sectionIndex": 3,
    "title": "What is the title of the person you report to?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=316",
    "html": "\r\n<h1>\r\nWhat is the title of the person you report to?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I57/sentence/I57S1.mp3\">What is the title of the person you report to? &#xA0;What responsibilities does he or she have?</a>&quot;</b><br><br>This is a trick question for people who are giving them a bigger title. &#xA0;An interviewer will know what you really did by finding out what your manager does. &#xA0;For someone who didn&apos;t prepare for this question, he or she will fall into a trap. &#xA0;Let&apos;s say a person said he or she was a manager. &#xA0;If the interviewer asks this question and the person responds by saying similar types of responsibilities, then something is wrong. &#xA0;Why do you have the same responsibilities as your manager? &#xA0;To prepare for this question, make sure you answer that your manager did higher level work than your own. &#xA0;The work that you mention you did should be showing off your skills, but your manager should have even greater responsibilities. &#xA0;Then it really shows how high you are. &#xA0;The example I&apos;m going to give represents me as a Group Program Manager.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I57/sentence/I57S2.mp3\">He was a sales manager. &#xA0;His duties included scheduling, customer support, and managing a group of 15 sales associates.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I57/sentence/I57S3.mp3\">My manager had a supervisor title. &#xA0;He was in charge of distributing work to staff auditors, reviewing final audits, scheduling business trips, and he also performed audits as well.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I57/sentence/I57S4.mp3\">My manager had the title Test Manager. &#xA0;She was in charge of delivering high quality features for each software application. &#xA0;She planned each project giving a timeline of completion, worked with management from different groups to make sure quality is assured, and provided direction to our team of 20 testers.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I57/sentence/I57S5.mp3\">The title of the person I report to is Product Unit Manager. &#xA0;The Product Unit Manager is responsible for overseeing the entire project. &#xA0;He uses the information from Test, Development, and Program managers to make sure the project is on line. &#xA0;He also is the person representing our whole group and reports progress to the vice president of our organization. &#xA0;He provides high level guidance and direction making sure we are following our mission statement. &#xA0;Other people who report to him are the Development manager and the Group Program manager.</a>&quot;<br><br>The more details you provide the better your answer. &#xA0;It ensures you are telling the truth and that you are aware of what you need to be able to do to take the next step up. &#xA0;Finally, a great way to answer this question is to know what position you are applying for and then list off the responsibilities of the person you would be reporting to if you got hired. &#xA0;That will make the interviewer think that you have very similar or exact experience for the job you are applying for.\r\n"
}