{
    "lessonIndex": 509,
    "categoryIndex": 3,
    "sectionIndex": 3,
    "title": "If you don’t leave your current job, what do you imagine you will be doing...",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=318",
    "html": "\r\n<h1>\r\nIf you don&apos;t leave your current job, what do you imagine you will be doing in several years?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I59/sentence/I59S1.mp3\">If you don&apos;t leave your current job, what do you imagine you will be doing in several years?</a>&quot;</b><br><br>There are several things the interviewer wants to learn from this question. &#xA0;The interviewer knows you are looking for another job because you are not happy with where you are at. &#xA0;Knowing this, they want to find out how you react to situations where you are not happy. &#xA0;Most people who do not prepare for this question will have a generic answer that doesn&apos;t stand out. &#xA0;You can use this opportunity to give a solid answer.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I59/sentence/I59S2.mp3\">I&apos;m confident I&apos;ll be in a management position several years from now. &#xA0;In my current position, junior employees ask me many questions and I like to mentor people. &#xA0;My work is very routine and I&apos;m very efficient. &#xA0;I want to find more challenges my work currently doesn&apos;t offer.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I59/sentence/I59S3.mp3\">To tell you the truth, I feel I&apos;ll be doing the same thing I&apos;m doing now. &#xA0;I always look for more work and different opportunities, but my current company doesn&apos;t have many opportunities for advancement.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I59/sentence/I59S4.mp3\">I&apos;m a very proactive person and I&apos;ll continue to do my job well. &#xA0;I&apos;ll always look for opportunities and even create places where I can improve my work. &#xA0;I know if I continue to perform well, I&apos;ll have more opportunities to get promoted when a position opens. &#xA0;So hopefully, in several years, I&apos;ll be managing people that are in my current position now.</a>&quot;<br><br>Despite having some negative feelings about work, this answer shows that he or she will continue to do hard work regardless of being unhappy. &#xA0;You shouldn&apos;t say you are unhappy, but looking for another job is one indication of not being happy.\r\n"
}