{
    "categoryIndex": 3,
    "sectionIndex": 4,
    "title": "If you have problems or complaints with your current job, why haven’t you...",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=320",
    "lessonIndex": 511,
    "html": "\r\n<h1>\r\nIf you have problems or complaints with your current job, why haven&apos;t you brought it to their attention?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I61/sentence/I61S1.mp3\">If you have problems or complaints with your current job, why haven&apos;t you brought it to their attention?</a>&quot;</b><br><br>If the interviewer knows you have complaints about your current job, then they might ask you this question. &#xA0;Make sure the complaints are things that do not make you look bad. &#xA0;For example, having no opportunities is a good complaint, but not getting a good raise is a bad complaint. &#xA0;After you decide on the complaint, then you can create your answer around it. &#xA0;It is better to answer that you did bring this up multiple times. &#xA0;That way, you are displayed as honest.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I61/sentence/I61S2.mp3\">I actually told my manager several times. &#xA0;I told him about my desire to learn new things and take on new challenges, but there aren&apos;t many opportunities in my current group.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I61/sentence/I61S3.mp3\">I believe in being straightforward, and I told my manager on numerous occasion that I was interested in taking on more responsibilities. &#xA0;However, my current group doesn&apos;t have opportunities I&apos;m looking for.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I61/sentence/I61S4.mp3\">After working the night shift for a couple of years, I wanted normal working hours. &#xA0;I told my manager about this, but there was no positions available for regular hour shifts.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I61/sentence/I61S5.mp3\">My biggest complaint is that there are no opportunities to grow. &#xA0;My manager tells me I&apos;m doing great work, but I feel I am stuck at this level. &#xA0;I spoke with my manager for more work so I can grow and gain more experience, but unfortunately, there isn&apos;t any work to give. &#xA0;I even had a discussion about changing roles, but because there is no open headcount in other divisions, it was hard to do that. &#xA0;So I definitely conveyed my desire for more work or for change, but it was something they couldn&apos;t provide.</a>&quot;<br><br>Having an employee that complains about a lot of things is an employee you do not want to hire. &#xA0;However, if an employee complains about not having enough work, it could be seen as a good complaint. &#xA0;Most work places have more work than resources, so giving more work isn&apos;t a problem. &#xA0;So this complaint shows that you are a person who wants to work and wants to learn. &#xA0;These are good traits and that makes this answer a good one.\r\n"
}