{
    "lessonIndex": 513,
    "categoryIndex": 3,
    "sectionIndex": 4,
    "title": "What do you feel an employer owes an employee?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=322",
    "html": "\r\n<h1>\r\nWhat do you feel an employer owes an employee?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I63/sentence/I63S1.mp3\">What do you feel an employer owes an employee?</a>&quot;</b><br><br>This purpose for this question is basically to see what you expect from the company. &#xA0;It is a simple answer, but you should also mention what you will give, in return for what you are expecting.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I63/sentence/I63S2.mp3\">I believe an employer should provide a good work environment and opportunities for growth in return for hard work.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I63/sentence/I63S3.mp3\">I believe an employer should respect their employees and treat them fairly. &#xA0;I plan on working hard and I should be recognized for my contributions.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I63/sentence/I63S4.mp3\">I believe an employer should provide an environment where everyone can succeed. &#xA0;I also believe that opportunities for growth and advancement should be provided by the employer.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I63/sentence/I63S5.mp3\">I have a lot of expectations from my employer. &#xA0;Financial compensation is a given, but there are other things I expect. &#xA0;I feel an employer should provide a good work environment, opportunities for growth, reward and recognition for excellence, and guidance in career development. &#xA0;I know I will be giving everything I can to help my employer succeed, and in return these are some of the expectations I have.</a>&quot;<br><br>If you look at the list of things I mentioned, all of them are strong indicators of a good employee. &#xA0;If a person is wanting to grow and guidance in career development, then that worker is serious about improving him or herself. &#xA0;Also, wanting reward and recognition for excellence indicates that this person is going to try to achieve excellence to get the reward. &#xA0;I would try to avoid saying things like, having a good sick day policy, or an understanding of missed days due to miscellaneous issues, or mentioning a good maternity leave plan. &#xA0;These things are all provided by large companies, but mentioning them indicates that you are a person who gets sick easily, or a person planning on having a baby, or an unlucky person that misses work due to bad luck.\r\n"
}