{
    "categoryIndex": 3,
    "sectionIndex": 4,
    "title": "What did you hear about us?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=325",
    "lessonIndex": 516,
    "html": "\r\n<h1>\r\nWhat did you hear about us?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I66/sentence/I66S1.mp3\">What did you hear about us?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I66/sentence/I66S2.mp3\">What do you know about us?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I66/sentence/I66S3.mp3\">What do you think we do at this company?</a>&quot;</b><br><br>I feel this question is not to quiz you about your knowledge about the company. &#xA0;It also doesn&apos;t test if you researched this company or not. &#xA0;I feel that this question is to find out what you know before they explain some things about there company. &#xA0;You should understand that if you are a strong candidate and you are doing well on your interview, then they will start sharing some things about the company to entice you to take the position. &#xA0;However, it could turn out to be a quiz so make sure you do your research before interviewing for a position.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I66/sentence/I66S4.mp3\">I heard that ABC Company is the leader in copy machine distribution. &#xA0;ABC Company is a global company in 18 different countries, and finally, it&apos;s one of the best companies to work for.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I66/sentence/I66S5.mp3\">I heard ABC Company has a great work environment and a place where strong contributors are rewarded. &#xA0;I want to work for a company with opportunities and I know ABC Company provides these things.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I66/sentence/I66S6.mp3\">I read on your website that ABC Company provides accounting services to small and medium size corporations. &#xA0;I also know ABC Company is the leader in tax services in this area. &#xA0;That&apos;s why I&apos;m excited to have the opportunity to join this company.</a>&quot; <br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I66/sentence/I66S7.mp3\">I heard a lot of good things about ABC Company. &#xA0;I know this company provides financial services to small and medium size corporations. &#xA0;Specifically, ABC Company focuses on creating automation for routine financial transactions. &#xA0;Besides what the company provides, I heard that the office environment is great and the employees are well taken care of.</a>&quot;<br><br>You don&apos;t have to list everything you know... just enough to let them know that you did your homework. &#xA0;Also, take a little time to give the company a compliment such as the last sentence. &#xA0;It is a psychological tool that you should use to your advantage. &#xA0;This type of compliment is directed at the company and the interviewer will be happy to hear this.\r\n"
}