{
    "lessonIndex": 517,
    "categoryIndex": 3,
    "sectionIndex": 4,
    "title": "What do you know about our product?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=326",
    "html": "\r\n<h1>\r\nWhat do you know about our product?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I67/sentence/I67S1.mp3\">What do you know about our product?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I67/sentence/I67S2.mp3\">Do you know what our team is making?</a>&quot;</b><br><br>This is another type of question they ask to find out what you know so they don&apos;t tell you something that you already know. &#xA0;If it is an existing product, then you should definitely know what it is. &#xA0;If not, and after you researched as much as you could, tell them the little that you know. &#xA0;For example, I interviewed for a group within Microsoft that was very new. &#xA0;I had no idea what the team was creating but I was interested because it was a new technology. &#xA0;I found out as much as I could and when they asked me this question, this is how I answer.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I67/sentence/I67S3.mp3\">There isn&apos;t much information about your products yet, but I heard you are creating new technology to create a more secure database. &#xA0;I worked with databases most of my career and the thought of more security really interested me.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I67/sentence/I67S4.mp3\">I heard this company is creating a camera lens for deep sea photography. &#xA0;Because my major was in engineering and my hobby is in photography, I believe this is the perfect position for me.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I67/sentence/I67S5.mp3\">I hear this group has several functions. &#xA0;It has an incubation team that grows new ideas and if the product has potential a new product is formed. &#xA0;I also hear this group creates solutions for companies to entice them to buy more Microsoft products.</a>&quot;<br><br>I didn&apos;t know much, but after researching, this is all I could find. &#xA0;This is exactly what I said and they responded by telling me more detail. &#xA0;It wasn&apos;t wrong, but at least I said enough about the group to sound like I researched a little bit. &#xA0;That&apos;s basically all you have to do for this question.\r\n"
}