{
    "categoryIndex": 3,
    "sectionIndex": 4,
    "title": "Who do you think are our two major competitors?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=329",
    "lessonIndex": 520,
    "html": "\r\n<h1>\r\nWho do you think are our two major competitors?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I70/sentence/I70S1.mp3\">Who do you think are our two major competitors?</a>&quot;</b><br><br>I never received this question, but it is very likely if it is important to know competitors. &#xA0;Make sure during your research, you also investigate the competitors of the company you are interviewing for. &#xA0;You can make your answer if you know more details such as market percentage of each company, or if it is a product company, what products they make. &#xA0;For the long answer, I&apos;ll give an example of a person interviewing for a marketing position for McDonalds. &#xA0;This is a good example, because one of the competitors is obvious. &#xA0;It is Burger King. &#xA0;But what is the second competitor. &#xA0;That is the significance of this example. &#xA0;It gives you an opportunity to explain your opinion of the second competitor. &#xA0;But the figures I&apos;m giving for all the answers are fake. &#xA0;You should make sure you research numbers so you can use them in your answers.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I70/sentence/I70S2.mp3\">The number one competitor to Verizon is Cingular. &#xA0;After they merged with AT&amp;T, they became the largest cell phone provider with a 19% market control. &#xA0;The next competitor is Nextel. &#xA0;Although they only have 10% of the market, they are increasing in strength.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I70/sentence/I70S3.mp3\">The two competitors of Nokia are Motorola and Samsung. &#xA0;Motorola has a strong presence in the United States where Samsung is more global.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I70/sentence/I70S4.mp3\">Microsoft is competing with many different companies because Microsoft provides many different software. &#xA0;MSN is growing and AOL is the number one competitor for this business, while the Microsoft OS is challenged by Linux because it&apos;s free.</a>&quot; <br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I70/sentence/I70S5.mp3\">The biggest competitor is Burger King. &#xA0;Where ever you see a McDonalds, it&apos;s common to see Burger King near by. &#xA0;They specialize in flame broiled burgers and use that as their marketing strategy. &#xA0;The Whopper is their number one selling burger selling approximately 30% more than all their other burgers. &#xA0;The second competitor is Wendy&apos;s. &#xA0;Although in some regions other hamburger stores sell more, if you take international sales into consideration, Wendy&apos;s clearly is a strong competitor. &#xA0;They advertise opening late and concentrate on their dollar menu luring people in to buy other more expensive items.</a>&quot;<br><br>This example clearly demonstrates knowledge about the industry instead of just McDonalds. &#xA0;Knowing the industry is important because and this question gives you the opportunity to show that off. &#xA0;This example also demonstrates an understanding of the international aspect of selling burgers. &#xA0;Finally, their marketing strategy is included in the answer. &#xA0;When you are interviewing for a position, make sure you know as much detail as you can to show that you are knowledgeable about the whole industry.\r\n"
}