{
    "categoryIndex": 3,
    "sectionIndex": 4,
    "title": "Why haven’t you received any offers so far?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=333",
    "lessonIndex": 524,
    "html": "\r\n<h1>\r\nWhy haven&apos;t you received any offers so far?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I74/sentence/I74S1.mp3\">Why haven&apos;t you received any offers so far?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I74/sentence/I74S2.mp3\">What offers have you received so far?</a>&quot;</b><br><br>This is another type of question that most interviewers will not ask. &#xA0;But just in case, I&apos;ll provide an example. &#xA0;For the question asking what offers have you received so far, you can simply list the ones you have received without details. &#xA0;For example, &quot;<a href=\"http://www.talkenglish.com/AudioTE1/I74/sentence/I74S3.mp3\">I received offers from Boeing and InfoSpace.</a>&quot; &#xA0;But if they ask you why haven&apos;t you received any offers, then your answer will depend on if you have an offer or not. &#xA0;If you do, then you can politely correct them by saying, &quot;<a href=\"http://www.talkenglish.com/AudioTE1/I74/sentence/I74S4.mp3\">Actually, I received an offer from Intel. &#xA0;But I didn&apos;t respond with my answer yet because this company is my first choice.</a>&quot; &#xA0;If you do not have any offers, then you can say something like this example.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I74/sentence/I74S5.mp3\">I just started interviewing this past week, so it&apos;s a little too early to tell.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I74/sentence/I74S6.mp3\">I recently started looking for a job, but I&apos;m hoping that I&apos;ll receive offers soon.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I74/sentence/I74S7.mp3\">I received one offer from a smaller company, but I want to see what else is out there. &#xA0;I like what this company has to offer so I&apos;m hoping everything turns out well today.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I74/sentence/I74S8.mp3\">I&apos;ve only interviewed with two other companies so far and I have a second interview with one of them. &#xA0;It&apos;s too early to tell if I&apos;ll be receiving any offers right now, but I&apos;m confident that I will get a couple.</a>&quot;<br><br>This answer is suggesting that you are actively interviewing. &#xA0;Mentioning a second interview with another company also shows that you passed the first interview stage. &#xA0;You are not admitting to any fault by not receiving any offers, but simply saying it is too early because you haven&apos;t been searching for a job that long.<br><br>If you have been looking for a job for a long time, then you will not be able to use an answer like I just showed. &#xA0;Instead, you might have to be honest and try to put the blame somewhere else. &#xA0;More likely you will not receive this answer, but just in case, here is one more example. &#xA0;This example admits directly to not receiving any offers but shows diligence and shows that this person doesn&apos;t give up.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I74/sentence/I74S9.mp3\">Most of the jobs I have been applying for require more experience than I have. &#xA0;Also, because the job market is rough right now the competition has been pretty tough. &#xA0;But I plan on self studying continually and I know through my diligence that I will get a job soon.</a>&quot;\r\n"
}