{
    "lessonIndex": 526,
    "categoryIndex": 3,
    "sectionIndex": 5,
    "title": "If everyone on the team is a veteran, what will you do to fit in?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=335",
    "html": "\r\n<h1>\r\nIf everyone on the team is a veteran, what will you do to fit in?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I76/sentence/I76S1.mp3\">If everyone on the team is a veteran, what will you do to fit in and be a beneficial team member instead of a person who appears to be in training?</a>&quot;</b><br><br>This is actually an easy question. &#xA0;Everyone should have a similar answer because there are only a few things that you can do. &#xA0;I&apos;m going to be giving an example of preparing and reading up on information more than usual.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I76/sentence/I76S2.mp3\">In this situation, I&apos;ll have to ramp up quickly and study notes from previous meetings before attending any. &#xA0;I&apos;ll also do a lot of studying to catch up so I can participate in discussions instead of appearing to be in training.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I76/sentence/I76S3.mp3\">In the beginning, I&apos;ll put a lot of effort into catching up on any existing projects I join. &#xA0;I believe studying a lot in the beginning to be aware of what is going on is very important.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I76/sentence/I76S4.mp3\">I&apos;ll study as much as I can to fit into a group of veterans. &#xA0;I know I&apos;ll have many questions along the way, but listening carefully and putting pieces together will allow me to catch up quickly. &#xA0;I know I&apos;ll be able to be an effective team player in a short time by following this method.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I76/sentence/I76S5.mp3\">Even if everyone is a veteran, I feel confident I can fit right in. &#xA0;I would prepare as much as I can by reading existing material to catch up on the project. &#xA0;I would plan for meetings by making a list of questions I have and finding the answers to these questions before the meeting. &#xA0;I would also create a list of ideas through the documents I have read. &#xA0;A fresh mind could help with creative solutions. &#xA0;I know that I would be required to study a lot in the beginning, but I would be able to do so at home or by working late in the office.</a>&quot;<br><br>This answer shows steps of becoming a team member that doesn&apos;t appear to be in training. &#xA0;It is describing ways to limit training times in meetings, and includes that a new worker could benefit an existing team by making a list of ideas.\r\n"
}