{
    "lessonIndex": 527,
    "categoryIndex": 3,
    "sectionIndex": 5,
    "title": "How do you intend to learn what you need to know to perform well for...",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=336",
    "html": "\r\n<h1>\r\nHow do you intend to learn what you need to know to perform well for this job?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I77/sentence/I77S1.mp3\">How do you intend to learn what you need to know to perform well for this job?</a>&quot;</b><br><br>We have a similar question here, but we can use this opportunity to see another example.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I77/sentence/I77S2.mp3\">I have experience in learning new concepts without training. &#xA0;I usually look through books or manuals to find answers. &#xA0;Because I&apos;m good at learning, I&apos;ll study relevant material to help me do my duties well.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I77/sentence/I77S3.mp3\">I have experience in this area so I won&apos;t need much training. &#xA0;However, I know different companies have different ways of doing things, so I&apos;ll learn company policies and methods quickly to apply my existing knowledge to do a good job.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I77/sentence/I77S4.mp3\">The first couple weeks are important. &#xA0;I think it&apos;s important to study the correct material, ask the right questions, and put in extra effort to learn what I need to know. &#xA0;This is what I usually do to make sure I&apos;ll be performing well.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I77/sentence/I77S5.mp3\">If the company provides training, I&apos;ll utilize the training to learn. &#xA0;If not, then I&apos;ll learn by being attentive to what other people do, read up on the documentation, and be willing to ask questions when necessary. &#xA0;I know the first couple of weeks are important and I&apos;m willing to put in extra effort to start off on the right track.</a>&quot;<br><br>This example is shorter and more to the point. &#xA0;It is not an answer that will astonish the interviewer, but it is an answer that will show couple good traits about yourself.\r\n"
}