{
    "categoryIndex": 3,
    "sectionIndex": 5,
    "title": "If your supervisor tells you to do something that you believe can be done...",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=337",
    "lessonIndex": 528,
    "html": "\r\n<h1>\r\nIf your supervisor tells you to do something that you believe can be done in a different way, what would you do?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I78/sentence/I78S1.mp3\">If your supervisor tells you to do something that you believe can be done in a different way, what would you do?</a>&quot;</b><br><br>This question is designed to see how you would react to your manager when you disagree. &#xA0;It is important to trust your manager, but at the same time, not follow blindly. &#xA0;That means I should ask questions to clarify, make suggestions, and after a discussion, follow the instructions of your manager. &#xA0;This is the steps I would take to answer this question.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I78/sentence/I78S2.mp3\">I will tell my supervisor of an alternate way and explain the benefits. &#xA0;If my supervisor is not convinced, then I&apos;ll follow his instructions.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I78/sentence/I78S3.mp3\">I&apos;ll suggest a different way of doing the assignment along with the benefits. &#xA0;If my supervisor disagrees and insists I do it a certain way, I&apos;ll follow the instructions.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I78/sentence/I78S4.mp3\">I&apos;ll suggest a different method and ask my supervisor if I can do this work the new way. &#xA0;If the result will be the same but would potentially save more time, then I believe my manager will allow it. &#xA0;However, if my manager wants it done a certain way for other reasons, I&apos;ll follow his or her instructions.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I78/sentence/I78S5.mp3\">I would question my supervisor why he or she wants it done this particular way. &#xA0;If I still don&apos;t agree with the method, I would suggest alternate ways of tackling the assignment and explain how my suggestion would be better. &#xA0;After having a good conversation, if we still can&apos;t see eye to eye, then I would have to trust my superior and follow his or her instructions.</a>&quot;<br><br>This is a solid answer because it is showing independence by having my own suggestion and thought, it shows I can think for myself, and finally, shows that I would be an employee that trusts the supervisor. &#xA0;Ultimately, this answer shows that I&apos;m a smart person willing to make adjustments. &#xA0;I&apos;ll take a moment here to clarify something. &#xA0;How does this answer show that I&apos;m smart and a person willing to make adjustments? &#xA0;Well, many times, the interviewer will not see exactly what you want them to see. &#xA0;However, even if they don&apos;t see all your good intentions, they will at least get a good feeling about you through your solid answers.\r\n"
}