{
    "lessonIndex": 532,
    "categoryIndex": 3,
    "sectionIndex": 5,
    "title": "What aspects of this job interest you the most?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=341",
    "html": "\r\n<h1>\r\nWhat aspects of this job interest you the most?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I82/sentence/I82S1.mp3\">What aspects of this job interest you the most?</a>&quot;</b><br><br>This is a question to see how interested you are in the position. &#xA0;For this question, how you talk will be more important than what you say. &#xA0;Many people fail interviews due to the lack of enthusiasm, so make sure you sound excited when you answer this question.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I82/sentence/I82S2.mp3\">I&apos;m very excited about this job because of the variety of different work. &#xA0;I&apos;m well rounded and it&apos;s always exciting when I can use many of my skills for a job.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I82/sentence/I82S3.mp3\">The most interesting aspect of this job is the product you&apos;re working on. &#xA0;I think it&apos;s so exciting working on a product that twelve million people use. &#xA0;I want to be on a team where my work will make many people enjoy our product more.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I82/sentence/I82S4.mp3\">I like the fact that this position requires someone who is detail oriented. &#xA0;Because we&apos;re working with sensitive data, it&apos;s important that all the information is perfect. &#xA0;This type of challenge always interested me.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I82/sentence/I82S5.mp3\">Ever since I was studying mechanical engineering in college, I had a strong interest in automobile engines. &#xA0;This position is to help the engine design team to create better fuel efficient cars. &#xA0;When I read that, it really jumped out to me. &#xA0;I knew I really wanted this position because it combined my interest and my experience into one. &#xA0;So being on a team where I can work on something I love is what appeals to me the most.</a>&quot;<br><br>&#xA0;Listen to how this example is said more than the words. &#xA0;You really have to convey the message that you are interested in the job.\r\n"
}