{
    "lessonIndex": 535,
    "categoryIndex": 3,
    "sectionIndex": 5,
    "title": "How do you explain the fact that you frequently change jobs?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=344",
    "html": "\r\n<h1>\r\nHow do you explain the fact that you frequently change jobs?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I85/sentence/I85S1.mp3\">How do you explain the fact that you frequently change jobs? &#xA0;I see that you haven&apos;t stayed with a company for more than 2 years.</a>&quot;</b><br><br>To pass this question, you have to convince them that you are going to stick around. &#xA0;This isn&apos;t a question to see what you know or what your philosophy is, it is a concern they have that you have to address. &#xA0;Your persuasion skill will be required for this answer. &#xA0;But if you can&apos;t be persuasive, convince them through step by step facts that leads to the fact that you are going to stay with this company if they hire you.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I85/sentence/I85S2.mp3\">I have been gaining experience and knowledge to have the minimum requirements to work for this company. &#xA0;My goal is to work for this company, and I&apos;ll be working here a long time because this is where I want to be.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I85/sentence/I85S3.mp3\">I planned on staying with my current job for a longer time period, but when this position opened up, I really wanted to apply because this company has everything I need. &#xA0;So even though I change jobs frequently, I&apos;m certain that I love this industry and that this is a great company to work for. &#xA0;I plan on staying a long time.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I85/sentence/I85S4.mp3\">I want to work for a large company that has many opportunities. &#xA0;I didn&apos;t receive this in my other companies because they were smaller, but I learned this company has a lot of great work to do and a lot of different opportunities.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I85/sentence/I85S5.mp3\">To tell you the truth, early in my career, I didn&apos;t know what I wanted to do. &#xA0;I&apos;ve been in a couple different industries, and it wasn&apos;t until my last position that I found exactly what I wanted to be doing. &#xA0;I stayed with my previous company for more than a year but there weren&apos;t enough opportunities. &#xA0;I finally found what I love to do and now I want to find a company where I can be a part of the company instead of a worker that has no interest in the overall company. &#xA0;I&apos;m being careful to choose my next job because I want to establish my career in my next job, and after researching, I found that ABC Company can provide everything I&apos;m looking for. &#xA0;So I&apos;ll definitely be here for the long term.</a>&quot;<br><br>This answer is a little long, but if you don&apos;t convince them that you are going to stay long, then you have a very little chance of being hired. &#xA0;So take whatever time you need to convince them. &#xA0;If you think of your own answer, write it down and be able to say it smoothly so they can fully understand that you are serious about staying.\r\n"
}