{
    "lessonIndex": 536,
    "categoryIndex": 3,
    "sectionIndex": 5,
    "title": "Tell me about a time you had a big disagreement with your boss.",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=345",
    "html": "\r\n<h1>\r\nTell me about a time you had a big disagreement with your boss.\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I86/sentence/I86S1.mp3\">Tell me about a time you had a big disagreement with your boss. &#xA0;What did you do and what was the outcome?</a>&quot;</b><br><br>Here is another &apos;tell me about&apos; question. &#xA0;You will have to think of an example of your own. &#xA0;The items you need to include in your answer should consist of you showing proper communication, taking appropriate action, and ending with a good outcome. &#xA0;It&apos;s perfectly natural to disagree with your boss. &#xA0;It is important how you react when you have a disagreement. &#xA0;Show the interviewer that you are professional about disagreements.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I86/sentence/I86S2.mp3\">I never really had a big disagreement with my manager. &#xA0;The only thing I can think of was when I recently got back from a business trip, my manager told me I had to go on another one the next day. &#xA0;In my previous company, it wasn&apos;t common to send someone on a business trip immediately, but another employee got sick so I had to fill in.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I86/sentence/I86S3.mp3\">I had a disagreement with my boss on how to do an assignment. &#xA0;It was easy to resolve by having a discussion on the pro&apos;s and con&apos;s of both methods. &#xA0;We didn&apos;t come to any conclusion which way was better, and I ended up performing the work the way my manager wanted. &#xA0;This was because in case I couldn&apos;t finish the assignment, he could easily pick up where I left off.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I86/sentence/I86S4.mp3\">I don&apos;t think I&apos;ve had a large disagreement with my boss before, but I do remember a small disagreement. &#xA0;I received an email from my boss telling me that he wants me to stop the work I was doing on my project and give it to a co-worker. &#xA0;He wanted me to start on a new project immediately. &#xA0;I spent two and a half weeks on this project and I only had three days left. &#xA0;I really wanted to finish this and it didn&apos;t make sense for me to hand this project off to someone else. &#xA0;So I put some thought into it, went over to my boss&apos;s office, and asked him why this project couldn&apos;t wait three days. &#xA0;He made his argument and I still didn&apos;t agree. &#xA0;We discussed this for a while and we compromised by having someone help me finish the project I was working on so I can have some time to kick start the next project. &#xA0;That&apos;s the only experience I had with a disagreement, but I learned that it only takes simple dialog and a little compromise to overcome a disagreement.</a>&quot;<br><br>I know this answer is long, but all types of &apos;tell me about&apos; questions are long. &#xA0;You have to tell a story in the shortest way for them to understand while explaining the disagreement along with the outcome. &#xA0;It&apos;s a huge question and it will take a long time to master &apos;tell me about&apos; questions. &#xA0;That is why you should diligent on these types of questions.\r\n"
}