{
    "lessonIndex": 540,
    "categoryIndex": 3,
    "sectionIndex": 5,
    "title": "How do you balance both your family and your job?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=349",
    "html": "\r\n<h1>\r\nHow do you balance both your family and your job?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I90/sentence/I90S1.mp3\">How do you manage having so many things to do such as work, family, and school?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I90/sentence/I90S2.mp3\">How do you balance both your family and your job?</a>&quot;</b><br><br>This is another easy answer where you can show your willingness to work hard. &#xA0;But it is unlikely you will get this question. &#xA0;Most of the time, the interviewer will ask this during small talk. &#xA0;When interviewing in America, I noticed there are many times where small talk is important. &#xA0;For example, walking together to the office could take two minutes. Are you going to say nothing during those two minutes? &#xA0;What if the interviewer asks how your day is going? &#xA0;He or she is basically initiating small talk. &#xA0;So it is definitely possible you will engage in small talk, and you should definitely practice small talk.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I90/sentence/I90S3.mp3\">With my kids in school, it&apos;s really easy to manage my time. &#xA0;I have the full day to myself and I want to be productive by helping a company grow.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I90/sentence/I90S4.mp3\">I&apos;m very organized and I plan everything I do. &#xA0;This helps me to easily find a balance between family and work.</a>&quot; <br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I90/sentence/I90S5.mp3\">Well, during the day while my kids are in school, I like to work. &#xA0;And in the evenings we spend time together doing homework. &#xA0;I really enjoy being busy and managing multiple things in my life.</a>&quot;<br><br>This is a short answer that shows the ability of multi-tasking. &#xA0;Also, a person who enjoys being busy is a good sign. &#xA0;So even if you receive questions during small talk, make sure to give answers that show good traits.\r\n"
}