{
    "lessonIndex": 541,
    "categoryIndex": 3,
    "sectionIndex": 5,
    "title": "You’ve been with one company your entire career. Don’t you think you will...",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=350",
    "html": "\r\n<h1>\r\nYou&apos;ve been with one company your entire career. &#xA0;Don&apos;t you think you will have a tough time adjusting to a new environment?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I91/sentence/I91S1.mp3\">You&apos;ve been with one company your entire career. &#xA0;Don&apos;t you think you will have a tough time adjusting to a new environment?</a>&quot;</b><br><br>If this is the case and you have been with only one company your entire career, then the best way to answer this question is to say how many changes you experienced in your previous position. &#xA0;Then it will sound like you are good with change and can adapt to new situations easily.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I91/sentence/I91S2.mp3\">In my company, my projects changed very frequently and I was required to ramp up on new technologies. &#xA0;I&apos;m also very friendly and like to meet new people. &#xA0;So I think I&apos;ll have an easy time adjusting to a new environment.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I91/sentence/I91S3.mp3\">I actually like being in new environments. &#xA0;I like to travel a lot and even when I&apos;m in a different country, I have always blended in smoothly.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I91/sentence/I91S4.mp3\">I don&apos;t think it will be very difficult. &#xA0;I learned that this company is very diverse and has a great office environment. &#xA0;I feel I&apos;ll blend right in and make solid contributions to this company.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I91/sentence/I91S5.mp3\">Although I&apos;ve been with one company, I have experienced many changes and new roles in my career. &#xA0;For example, during the middle of a long project, the vice president sent out a group wide mail completely changing our direction. &#xA0;We had to basically start from scratch with half the time left. &#xA0;It felt like I was a new employee again having to ramp up on new technology, reading up on instructional documentation, and learn new applications. &#xA0;So through my experience dealing with change and adjusting to new projects, I am confident I will not have a tough time adjusting to this new environment.</a>&quot;<br><br>Saying this confidently is the key. &#xA0;It&apos;s not an important question, but more like a question verifying that you are willing and capable of new things. &#xA0;But the more you convince them of your abilities to change, then the better you will appear.\r\n"
}