{
    "lessonIndex": 543,
    "categoryIndex": 3,
    "sectionIndex": 5,
    "title": "Do you want to work for a small or large company and why?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=352",
    "html": "\r\n<h1>\r\nDo you want to work for a small or large company and why?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I93/sentence/I93S1.mp3\">Do you want to work for a small or large company and why?</a>&quot;</b><br><br>This all depends on what size company you are interviewing for. &#xA0;Usually, large companies will not ask this question. &#xA0;But if they do, make sure you mention you want to work for a large company because of the resources, the training, and other things you can think of. &#xA0;More likely, a smaller company will ask you this wondering why you would choose a small company. &#xA0;The best way to answer this question is to first think about what a small company can provide over a big company. &#xA0;The most significant advantage of working for a small company is having the opportunity to work on a variety of tasks.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I93/sentence/I93S2.mp3\">I want to work for a large company because there are different opportunities within the company. &#xA0;I also feel a larger company provides better training. &#xA0;Finally, a larger company already has key processes in place to provide employees tools to work efficiently.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I93/sentence/I93S3.mp3\">I worked for a small company for a year and missed out on a lot of benefits a larger company provides such as training, structured work environment, and a wider variety of work. &#xA0;So I want to work for a large company.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I93/sentence/I93S4.mp3\">I want to work for a small company because I feel I&apos;ll have more opportunities to gain valuable experience. &#xA0;I know some friends in large companies and they have specific roles that limit what they&apos;re capable of doing. &#xA0;I&apos;m hoping that a small company will have more variety and challenges for each employee.</a>&quot;<br><br>This is pretty short but to the point. &#xA0;It displays wanting to learn and an eagerness to try a variety of things.\r\n"
}