{
    "lessonIndex": 544,
    "categoryIndex": 3,
    "sectionIndex": 6,
    "title": "What do you do when you’re having difficulty solving a problem?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=353",
    "html": "\r\n<h1>\r\nWhat do you do when you&apos;re having difficulty solving a problem?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I94/sentence/I94S1.mp3\">What do you do when you&apos;re having difficulty solving a problem?</a>&quot;</b><br><br>There are many different ways to approach this answer. &#xA0;So there are many right answers. &#xA0;Just remember to explain yourself step by step.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I94/sentence/I94S2.mp3\">I usually take a short break. &#xA0;I found that this helps me think clearer and often times I end up solving the problem.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I94/sentence/I94S3.mp3\">I break down the problem piece by piece and try and solve difficult problems step by step. &#xA0;This approach helps me not to get overwhelmed by difficult problems.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I94/sentence/I94S4.mp3\">I always do my best solving difficult problems. &#xA0;If I have trouble, I&apos;ll use resources around me such as looking through the Internet, asking co-workers, asking my manager, or looking through some books.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I94/sentence/I94S5.mp3\">There are couple things I do when I&apos;m having a problem. &#xA0;Sometimes I try to focus so hard that I miss a point that would help me solve the problem. &#xA0;So I take a 2 minute break to help me approach the problem in a different way. &#xA0;I could either go get a drink of water, or stand up and move around. &#xA0;I find that this helps me at times. &#xA0;But if I still continue to have problems, I don&apos;t mind asking a co-worker for some assistance. &#xA0;I believe in using all the resources around me and I think co-workers should use me as a resource as well.</a>&quot;<br><br>This answer first tries to solve the problem without bothering another person. &#xA0;But if everything fails, it is ok to ask questions to someone else.\r\n"
}