{
    "lessonIndex": 546,
    "categoryIndex": 3,
    "sectionIndex": 6,
    "title": "What do you do when you have a problem with your boss?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=355",
    "html": "\r\n<h1>\r\nWhat do you do when you have a problem with your boss?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I96/sentence/I96S1.mp3\">What do you do when you have a problem with your boss?</a>&quot;</b><br><br>This question is a little easier for me because I haven&apos;t had many directs I didn&apos;t like. &#xA0;It is easier to tell a manager your problems because they are in a position where they should accept listening to your problems. &#xA0;So in this case, I would answer it by showing some honesty trait.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I96/sentence/I96S2.mp3\">I&apos;m very open with my manager. &#xA0;I feel it&apos;s important that my manager knows about how I feel. &#xA0;I always start a conversation and try and solve our differences through professional conversation.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I96/sentence/I96S3.mp3\">When I have a problem with my boss, I don&apos;t like to keep it bottled up. &#xA0;I want to resolve problems so I can work efficiently without distractions. &#xA0;So I always talk to my manager about the problems that I have openly.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I96/sentence/I96S4.mp3\">I deal with different types of people very well, but if I have a problem that affects my work, I will openly tell my manager and the reason why it&apos;s bothering me.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I96/sentence/I96S5.mp3\">I&apos;m a very honest and open person. &#xA0;So anytime I have a problem with my boss, I always let him or her know. &#xA0;I make a list of things that bother me. &#xA0;I ask my boss for time to chat and I reveal these problems and the reasons for them. &#xA0;I want to make sure I&apos;m not being offensive or sound like I&apos;m accusing my boss of anything.</a>&quot;\r\n"
}