{
    "categoryIndex": 3,
    "sectionIndex": 6,
    "title": "What do you do when you have a problem with a co-worker?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=357",
    "lessonIndex": 548,
    "html": "\r\n<h1>\r\nWhat do you do when you have a problem with a co-worker?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I98/sentence/I98S1.mp3\">What do you do when you have a problem with a co-worker?</a>&quot;</b><br><br>Usually when two co-workers have a problem, then they will just hate each other and try to be better than the other. &#xA0;You can&apos;t say this because it is the wrong way to handle it. &#xA0;I would probably not deal with the problem and hate the other person, but that is not what I would say in an interview. &#xA0;You can mention that you believe having to deal with a problem with a co-worker is difficult because competitiveness comes into factor. &#xA0;Along with this statement, follow up with how you would try to look beyond that to make your relationship better.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I98/sentence/I98S2.mp3\">If I have a problem with a co-worker, I believe it&apos;s so important to talk to them. &#xA0;Even if I&apos;m the one with the problem, I want to know so I can be a better team mate.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I98/sentence/I98S3.mp3\">If I have a problem, I try to approach my co-worker and let them know as professionally as possible. &#xA0;If I&apos;m the one with the problem, I&apos;ll politely ask what I can do to improve the relationship. &#xA0;I found that proper communication solves many problems.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I98/sentence/I98S4.mp3\">I&apos;ve always been told that I&apos;m a great person to work with, but if I were in a situation where I was having a problem, I believe I would work on our relationship by being more understanding.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I98/sentence/I98S5.mp3\">Well it all depends on if it&apos;s a personality conflict or an issue that is causing the problem. &#xA0;An issue is easy to deal with. &#xA0;I think I&apos;d go and talk with the co-worker saying something like, &apos;If you have some time, I think it will be good for us if we talk about this issue.&apos; &#xA0;Starting a conversation to deal with the problem with a co-worker is the hardest step, and if it&apos;s done properly, then the issue can easily be resolved. &#xA0;If it is a personality issue, then I would try to be more understanding and at worst deal with the problem by anticipating conflicts ahead of time to put myself in a position to either avoid it or to make it less of a problem.</a>&quot;<br><br>This is showing answers by using scenarios. &#xA0;It is a solid answer but if you disagree, feel free to think of a good scenario that will fit you better.\r\n"
}