{
    "categoryIndex": 3,
    "sectionIndex": 6,
    "title": "How do you handle conflict?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=358",
    "lessonIndex": 549,
    "html": "\r\n<h1>\r\nHow do you handle conflict?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I99/sentence/I99S1.mp3\">How do you handle conflict?</a>&quot;</b><br><br>This is a general question. &#xA0;It doesn&apos;t ask if you are the one with the conflict, if it is a conflict with another person, if it is a conflict of schedule, or if it is a conflict with changes at work. &#xA0;If you want, you can ask a question to clarify. &#xA0;But if you want to answer in a general way, try to think of an answer that will work for all types of conflict.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I99/sentence/I99S2.mp3\">I treat most conflicts the same. &#xA0;I analyze the conflict and create a list of steps I can take to resolve it. &#xA0;By thinking about these steps and taking action, I found that most conflicts are easy to handle.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I99/sentence/I99S3.mp3\">I handle conflicts by analyzing them. &#xA0;I&apos;m a very analytical person and I feel all problems have a solution. &#xA0;I usually think about the conflict and find ways to deal with it.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I99/sentence/I99S4.mp3\">Whenever I&apos;m confronted with a conflict, I always follow a simple process. &#xA0;I think about what the current conflict is, think of several ways I can deal with this conflict, and then take the best action after my analysis.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I99/sentence/I99S5.mp3\">Whenever I have a conflict I have to deal with, I like to follow a simple process. &#xA0;I first identify the problem causing the conflict, think about solutions or ideas that will solve the problem, and then try to implement a solution. &#xA0;Although it&apos;s very simple, it makes sure that I&apos;m not panicking, losing my temper or losing control of the situation. &#xA0;And it prevents me from rushing into a decision that might make the problem worse.</a>&quot;<br><br>This is an answer that could be applied to all types of conflicts. &#xA0;It doesn&apos;t state the exact situations of each conflict, but it does state why following a process is good. &#xA0;The interviewer will not think this is an original idea. &#xA0;However, the answer provides reasons why it helps. &#xA0;These reasons are the key to the answer and it shows that you are organized and in control. &#xA0;This answer, without the last sentence is just mediocre. &#xA0;But the last sentence makes is very strong.\r\n"
}