{
    "lessonIndex": 550,
    "categoryIndex": 3,
    "sectionIndex": 6,
    "title": "Have you fired anyone?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=359",
    "html": "\r\n<h1>\r\nHave you fired anyone?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I100/sentence/I100S1.mp3\">Have you fired anyone? &#xA0;And if so, why?</a>&quot;</b><br><br>If you fired someone before, then that means you are a manager or hire. &#xA0;If your answer is no, then this is an easy question. &#xA0;But if you answer yes, then you have to give a reason why. &#xA0;If you say I fired one of our employees because he or she couldn&apos;t do the work properly, then this is a regular answer that will not help you. &#xA0;Large corporations have a procedure they follow to fire someone. &#xA0;If you can incorporate using the process of firing into your own experience, then the answer will be stronger. &#xA0;Here is an example.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I100/sentence/I100S2.mp3\">I&apos;ve never had to fire anyone yet, but if I&apos;m in this situation, I would follow company policy and do it professionally.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I100/sentence/I100S3.mp3\">I had to fire one employee who continually failed to complete projects. &#xA0;Before firing this employee, I tried to work with him by motivating, encouraging, and even providing different work. &#xA0;In the end, nothing worked and I had no choice but to let him go.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I100/sentence/I100S4.mp3\">The only time I had to fire someone was when an employee was continually late. &#xA0;We have a company policy of giving a verbal warning for the first three offenses, and then a written warning after the 3rd offense. &#xA0;I had many discussions about this problem with this employee, but it didn&apos;t help. &#xA0;In the end, we had to let him go.</a>&quot;<br><br><b>Long Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I100/sentence/I100S5.mp3\">When I was a managing a group of 4 people in my last position, I unfortunately had to fire one of them. &#xA0;The person was unable to perform at an acceptable level for a long period of time. &#xA0;Our company has a process in place of trying to grow our employees, empower them, and help them find their strengths, but nothing helped. &#xA0;I put the person on probation and explained that he will have to try harder. &#xA0;But after seeing bad performance due to a lack of effort for a long time, I had to fire him.</a>&quot;<br><br>Another approach to this question is to take a strong stance on performance. &#xA0;As I said before, if the answer is different and creative, the interviewer will remember it more and that means they will remember you more. &#xA0;Then your chances of getting the job increase more than others. &#xA0;Here is an example of an answer that the interviewer will remember.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I100/sentence/I100S6.mp3\">Oh yeah, I fired a lot of people. &#xA0;All of the reasons were the same. &#xA0;They were not performing their jobs. &#xA0;I believe in good management. &#xA0;I believe I should mentor and help grow our employees. &#xA0;This is a business and we need to do whatever we can to help our company grow. &#xA0;One of the biggest factors on the success of a company is having great employees. &#xA0;So I won&apos;t hesitate to fire someone that isn&apos;t performing their job. &#xA0;It leaves more room to bring in someone who will benefit the company.</a>&quot;<br><br>This is an answer I would be willing to use. &#xA0;But before using this answer, you must first look at the type of person asking this question and determine if he or she will like it. &#xA0;If the person is a strong person that shows no emotion, then it might be good. &#xA0;But if a person is very friendly, then that person might not like it. &#xA0;Even though it is a good answer, a friendly person might not like it because it could indicate that you are a cold person. &#xA0;Basically friendly people don&apos;t like cold people and if you have to work together, they might not want to work with you. &#xA0;So be careful on using this type of answer.\r\n"
}