{
    "categoryIndex": 3,
    "sectionIndex": 6,
    "title": "What do you do when a worker is giving the team more problems then...",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=360",
    "lessonIndex": 551,
    "html": "\r\n<h1>\r\nWhat do you do when a worker is giving the team more problems than helping?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I101/sentence/I101S1.mp3\">What do you do when a worker is giving the team more problems than helping?</a>&quot;</b><br><br>If you have a lot of team work experience, you know that there are a lot of people like this. &#xA0;It is a fact that some people actually slow down the work than help the work. &#xA0;That is why this is a good question to ask. &#xA0;A good employee will know how to handle this situation. &#xA0;A bad employee will do all the work themselves. &#xA0;Although doing the work is good, it doesn&apos;t show that you can deal with different types of people.<br><br><b>Short Answers</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I101/sentence/I101S2.mp3\">I follow a process of helping my coworker out in any way I can. &#xA0;This can include assistance in their portion of the work or by encouragement. &#xA0;If that doesn&apos;t work, then we redistribute the work to make sure everything is covered. &#xA0;I believe it&apos;s important to let my manager know of the problem as well.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I101/sentence/I101S3.mp3\">If the problem is related to a difficult task that a coworker cannot solve, then I&apos;ll get all the team members to help out. &#xA0;But if the problem is due to laziness or unwillingness to work, then I&apos;ll inform my manager of the problem.</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I101/sentence/I101S4.mp3\">It&apos;s hard to deal with a worker that puts in great effort but slows down the team. &#xA0;I noticed it is best to tackle the problem early. &#xA0;One way I found that was helpful was to be more firm. &#xA0;This way, the project continues to move forward without so many interruptions due to small arguments.</a>&quot;<br><br><b>Long Answer</b><br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I101/sentence/I101S5.mp3\">I&apos;ve been in this situation a couple of times. &#xA0;One time, we organized and distributed easier work to the worker with problems. &#xA0;But this is only a short term solution. &#xA0;Most of the time, I end up spending a lot of time helping the person out. &#xA0;It might have been quicker if the rest of the team members did all the work, but I figure helping this person now will benefit us in our next project. &#xA0;Although this method doesn&apos;t work all the time, I really get excited when it does work. &#xA0;Then I know I really helped another person succeed and this in turn helps the company.</a>&quot; <br><br>This answer will also work if you leave out the last two sentences. &#xA0;But I included the last two sentences to emphasize that helping other people succeed is really the truth instead of just words. &#xA0;If you choose the right way to say something, it sounds much more believable.\r\n"
}