{
    "categoryIndex": 3,
    "sectionIndex": 7,
    "title": "What kind of salary are you looking for?",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=381",
    "lessonIndex": 572,
    "html": "\r\n<h1>\r\nWhat kind of salary are you looking for?\r\n</h1>\r\n<b>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I122/sentence/I122S1.mp3\">What kind of salary are you looking for?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I122/sentence/I122S2.mp3\">What pay range are you looking for?</a>&quot;</b><br><br>There are a couple of ways to answer this. &#xA0;If you state a figure, you risk stating something that is too high, or something that is too low. &#xA0;Either case, you will not benefit from this question. &#xA0;A lot of people suggest saying something like, &quot;<a href=\"http://www.talkenglish.com/AudioTE1/I122/sentence/I122S3.mp3\">I&apos;m sure whatever I&apos;m offered will be a fair price.</a>&quot; &#xA0;But I don&apos;t agree. &#xA0;It is a safe answer, but if I was the interviewer, I would appreciate numbers instead of a safe answer. &#xA0;So I recommend answering this question with a range. &#xA0;I&apos;ll explain this more in the negotiation portion, but just in case you skip that section, here are some examples.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I122/sentence/I122S4.mp3\">I&apos;m expecting somewhere between $50,000 - $60,000.</a>&quot;<br><br>If you know the pay for the position you are applying for. &#xA0;Then giving a figure is not that bad. &#xA0;Just state something a little higher with a small range included<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I122/sentence/I122S5.mp3\">I know that the average pay for this position is roughly around $45,000, but because I have a couple years more experience, I would want something around $48,000 to $50,000.</a>&quot;<br><br>If the salary range is already included in the job description, then you can answer that you are willing to consider any offers stated in the job description.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/I122/sentence/I122S6.mp3\">The job description says that the salary will be around $45,000 to $53,000. &#xA0;I think it&apos;s a fair range.</a>&quot;\r\n"
}