{
    "categoryIndex": 4,
    "sectionIndex": 1,
    "title": "Making a Reservation",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=399",
    "lessonIndex": 587,
    "html": "\r\n<h1>\r\nMaking a Reservation\r\n</h1>\r\nYou will be calling the company you are renting from. &#xA0;When you call, you should verify if the rental car company has a location at the airport you are flying into.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/T9/sentence/T9S1.mp3\">I need one at Los Angeles Airport.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/T9/sentence/T9S2.mp3\">I am flying into Los Angeles Airport.</a>&quot;<br><br>If they have one, they will say they do and start asking you similar questions we already covered. &#xA0;We will not repeat them here, but I will have a practice session giving an example dialog on making a reservation below.<br><br>They might ask you for a credit card number on the phone. &#xA0;If you don&apos;t call and cancel, you might be charged. &#xA0;So if you need to cancel, remember to call and cancel at least 24 hours before the date. &#xA0;I am not sure if it is 24 hours. &#xA0;You should ask and verify.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/T9/sentence/T9S3.mp3\">If I need to cancel, when should I do that by?</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/T9/sentence/T9S4.mp3\">As soon as possible, but in order to avoid a charge you should call 24 hours before the date.</a>&quot;<br><br>When you arrive at the counter, you will tell the person that you have a reservation.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/T9/sentence/T9S5.mp3\">Hi, I have a reservation under last name Lee.</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/T9/sentence/T9S6.mp3\">Hi, I have a reservation for a midsize car.</a>&quot;<br><br>After that, they will confirm your information. &#xA0;They might ask you some duplicate questions, but we should have covered most of it already.\r\n"
}