{
    "lessonIndex": 588,
    "categoryIndex": 4,
    "sectionIndex": 1,
    "title": "Car Rental - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=401",
    "html": "<h1>Car Rental - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/T9/practice/T9P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/T9/practice/T9P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/T9/practice/T9P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hello, ABC Car Rental. How can I help you?&quot;<br>B: &quot;Hi, I wanted to make a reservation.&quot;<br>A: &quot;What location would you like to rent from?&quot;<br>B: &quot;I am flying into Los Angeles Airport. Do you have a booth there?&quot;<br>A: &quot;Yes we do. What date are you flying in?&quot;<br>B: &quot;I am arriving on June 22nd.&quot;<br>A: &quot;What time is your arrival time?&quot;<br>B: &quot;I am scheduled to arrive at 2 pm.&quot;<br>A: &quot;How long would you like to rent the vehicle?&quot;<br>B: &quot;I will need it for 10 days.&quot;<br>A: &quot;What size car would you like?&quot;<br>B: &quot;A midsize car please.&quot;<br>A: &quot;Can I get your name?&quot;<br>B: &quot;Yes. My name is Sang Min Lee.&quot;<br>A: &quot;Can you spell that?&quot;<br>B: &quot;Last name is L E E. First name is S A N G. Middle initial is M.&quot;<br>A: &quot;Great. Thank you. I have reserved a midsize car for you for June 22nd until July 1st. Is there anything else I can help you with?&quot;<br>B: &quot;That will be all.&quot;<br>A: &quot;Thank you for calling.&quot;<br>B: &quot;Thank you. Bye.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/T9/practice/T9P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/T9/practice/T9P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/T9/practice/T9P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;How can I help you today?&quot;<br>B: &quot;I would like to rent a car.&quot;<br>A: &quot;Do you have a reservation?&quot;<br>B: &quot;No.&quot;<br>A: &quot;That&apos;s alright. Let&apos;s see what we can find. We have several cars to choose from. What size are you looking for?&quot;<br>B: &quot;What are my options?&quot;<br>A: &quot;A compact car, midsize car, and a minivan.&quot;<br>B: &quot;How much are they?&quot;<br>A: &quot;Compact is $2.1.95 a day, midsize is $27.95 a day, and a minivan is 35.95 a day.&quot;<br>B: &quot;I&apos;ll take a midsize car.&quot;<br>A: &quot;How long will you be renting the car?&quot;<br>B: &quot;One week.&quot;<br>A: &quot;How many people will be driving the car?&quot;<br>B: &quot;Just myself.&quot;<br>A: &quot;Would you like insurance?&quot;<br>B: &quot;How much is it?&quot;<br>A: &quot;It is $14.95 a day and it covers everything regardless of fault.&quot;<br>B: &quot;Yes please.&quot;<br>A: &quot;Can I have your name?&quot;<br>B: &quot;Last name is Lee. L E E. First name is Sang. S A N G.&quot;<br>A: &quot;You address please?&quot;<br>B: &quot;I am from Korea. Would you like my address in Korea?&quot;<br>A: &quot;Just the city name.&quot;<br>B: &quot;Seoul, Korea.&quot;<br>A: &quot;Can I see your driver&apos;s license and a credit card?&quot;<br>B: &quot;Sure. Here it is.&quot;<br>A: &quot;Great. That will be $324.92. Would you like me to charge it on this card?&quot;<br>B: &quot;Yes. That will be fine.&quot;<br>A: &quot;Please sign here. You can pick up your car downstairs. Your expected time to return the car is June 29th. That is exactly one week. Show the attendant this invoice. When you return the car, bring this invoice with you. Also, the gas tank is full, you should fill up the gas tank before you return. If you don&apos;t want to, we can do it for $3 a gallon. Is there anything else I can do for you?&quot;<br>B: &quot;That will be all. Thank you.&quot;<br>A: &quot;Thank you. Good bye.&quot;<br></td></tr></table>"
}