{
    "categoryIndex": 4,
    "sectionIndex": 2,
    "title": "General Things",
    "link": "http://www.talkenglish.com/lessondetails.aspx?ALID=406",
    "lessonIndex": 593,
    "html": "\r\n<h1>\r\nGeneral Things\r\n</h1>\r\nIf you need a wake up call, you can call the front desk.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/T14/sentence/T14S1.mp3\">Can I have a wake up call?</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/T14/sentence/T14S2.mp3\">What time would you like your wake up call?</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/T14/sentence/T14S3.mp3\">At 7:30 am please.</a>&quot;<br><br>Room service is available but they have hours of operation. &#xA0;The menu in the room should indicate what times they serve hot food, and the menu will show a list of items that are available 24 hours a day. &#xA0;If you can&apos;t find the times, you can ask the front desk.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/T14/sentence/T14S4.mp3\">What are the hours for room service?</a>&quot;<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/T14/sentence/T14S5.mp3\">They serve hot food from 5:30am to 11:00pm. &#xA0;They also have a list of items you can select from during off hours.</a>&quot;<br><br>If you need help with your luggage, the person that does this is called a bellman, a bellhop, or a bellboy. &#xA0;The most common term is a bellman so I will use that terminology here.<br><br>The person that gives advice on city activities, recreation, places to dine, and general questions is called a concierge.<br><br>If a person parks the car for you, they are called a valet.<br><br>Regular motels and inns might not have these additional services. &#xA0;Even some hotels do not have them. &#xA0;But if you are staying at a nice hotel, you can ask for them.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/T14/sentence/T14S6.mp3\">Do you have a bellman here?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/T14/sentence/T14S7.mp3\">Do you have a concierge?</a>&quot;<br><br>Only some hotels have valet service. &#xA0;If someone parked the car for you and you can&apos;t find someone, you can ask someone else the following questions.<br><br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/T14/sentence/T14S8.mp3\">Where is the valet attendant?</a>&quot;<br>&quot;<a href=\"http://www.talkenglish.com/AudioTE1/T14/sentence/T14S9.mp3\">Can you get someone to get my car?</a>&quot;<br><br>Remember that if you use these premium services, you should tip. &#xA0;Also remember that you might not know they are helping you. &#xA0;For example, when you check in, a person might ask if you need help with your bags. &#xA0;If you say yes, then you are using the bellman services. &#xA0;So remember to tip if you do. &#xA0;If you don&apos;t want to tip, you don&apos;t have to, but it is a little rude. &#xA0;Finally, if you don&apos;t want any help, just tell them, &quot;<a href=\"http://www.talkenglish.com/AudioTE1/T14/sentence/T14S10.mp3\">No thank you.</a>&quot;\r\n"
}