{
    "categoryIndex": 4,
    "sectionIndex": 2,
    "title": "Hotel - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=407",
    "lessonIndex": 594,
    "html": "<h1>Hotel Checking In - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/T14/practice/T14P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/T14/practice/T14P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/T14/practice/T14P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Thank you for calling Great Hotel. How may I help you?&quot;<br>B: &quot;I would like to rent a room, but how much do you charge a night?&quot;<br>A: &quot;Our prices start at $79 a night for a standard room.&quot;<br>B: &quot;Great. Can you reserve a room for me?&quot;<br>A: &quot;Sure. What day are you coming in?&quot;<br>B: &quot;I will be checking in on August 3rd.&quot;<br>A: &quot;How many days do you need the room for?&quot;<br>B: &quot;I&apos;ll need it for three nights.&quot;<br>A: &quot;Ok. I have you coming in on the 3rd of August and checking out on the 6th. Is that correct?&quot;<br>B: &quot;Yes.&quot;<br>A: &quot;How many total adults?&quot;<br>B: &quot;Two adults and two kids.&quot;<br>A: &quot;How old are the children?&quot;<br>B: &quot;10 and 12.&quot;<br>A: &quot;Would you like one room or two rooms?&quot;<br>B: &quot;Just one is fine.&quot;<br>A: &quot;Would you like a smoking room or a non smoking room?&quot;<br>B: &quot;Non smoking room please.&quot;<br>A: &quot;Can I have your last name?&quot;<br>B: &quot;Park.&quot;<br>A: &quot;Your first name&quot;<br>B: &quot;Young. That&apos;s Y O U N G.&quot;<br>A: &quot;Let me confirm your information Mr. Park. I have one non smoking double room with 2 adults and 2 children from August 3rd to August 6th. Is this correct?&quot;<br>B: &quot;Yes.&quot;<br>A: &quot;The total comes to $256.78. Can I get your credit card number?&quot;<br>B: &quot;Sure. It is 444444444444.&quot;<br>A: &quot;What is the name on the credit card?&quot;<br>B: &quot;Young Park.&quot;<br>A: &quot;I have the room reserved for you. If you need to cancel, please call us 24 hours before your check in date. Failure to cancel will result in a one day charge on your credit card. Is there anything else I can do for you?&quot;<br>B: &quot;Yes, one more question. What time can we check in.&quot;<br>A: &quot;We can check you in by 2:00pm.&quot;<br>B: &quot;Great. Thank you.&quot;<br>A: &quot;Thank you and have a great day.&quot;<br>B: &quot;Thanks. Bye&quot;<br>A: &quot;Good bye.&quot;<br></td></tr></table>"
}