{
    "lessonIndex": 614,
    "categoryIndex": 4,
    "sectionIndex": 6,
    "title": "Talking to Strangers - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=432",
    "html": "<h1>Talking to Strangers - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/T31/practice/T31P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/T31/practice/T31P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/T31/practice/T31P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;It&apos;s a nice day.&quot;<br>B: &quot;Yes. It is a beautiful day.&quot;<br>A: &quot;Do you live around here or are you visiting?&quot;<br>B: &quot;I am on vacation from Korea.&quot;<br>A: &quot;That&apos;s cool. Are you having a good time?&quot;<br>B: &quot;Yes. There are many things to see and I&apos;m taking a lot of pictures. Do live in this city?&quot;<br>A: &quot;Yeah. I&apos;m just here with my kids. They wanted to come to the park today.&quot;<br>B: &quot;What&apos;s a good place to visit in this city?&quot;<br>A: &quot;Where have you been so far?&quot;<br>B: &quot;This was my first stop. I was going to look at my maps.&quot;<br>A: &quot;I recommend going to the water front in downtown. They have a ferry you can ride, some good restaurants, and a good beach for a walk.&quot;<br>B: &quot;How do I get there from here?&quot;<br>A: &quot;You see Jackson street over there? Go straight for 10 blocks. When you see 5th Avenue, turn left. Follow the street for about 3 miles and you should see it.&quot;<br>B: &quot;Thanks. I&apos;ll go check it out. It was nice talking to you.&quot;<br>A: &quot;It was nice meeting you. Have a good time.&quot;<br><br></td></tr><tr><td>2 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/T31/practice/T31P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/T31/practice/T31P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/T31/practice/T31P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Are there so many people here all the time?&quot;<br>B: &quot;I&apos;m not sure. This is my first time here.&quot;<br>A: &quot;Me too. I think this is a great place.&quot;<br>B: &quot;Yeah. I think so too.&quot;<br>A: &quot;Where are you from?&quot;<br>B: &quot;I&apos;m visiting from Cleveland, Ohio. How about you?&quot;<br>A: &quot;I&apos;m from Seoul, Korea.&quot;<br>B: &quot;How long are you visiting for?&quot;<br>A: &quot;For 2 weeks. I went to San Francisco and Los Angeles. I want to see the Grand Canyon before I go. I&apos;ll probably visit Grand Canyon on Monday.&quot;<br>B: &quot;Ah, looks like you are having a great time.&quot;<br>A: &quot;Yes I am. How long are you visiting for?&quot;<br>B: &quot;I am only here for the three days. My kids have been wanting to come to Disneyland for a long time.&quot;<br>A: &quot;That&apos;s great.&quot;<br>B: &quot;Oh. My family is waiting for me. I hope you enjoy your stay in America.&quot;<br>A: &quot;Thank you. It was nice meeting you.&quot;<br><br></td></tr><tr><td>3 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/T31/practice/T31P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/T31/practice/T31P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/T31/practice/T31P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;That&apos;s such a cute dog. What kind is it?&quot;<br>B: &quot;He&apos;s a cocker spaniel.&quot;<br>A: &quot;I have a terrier at home. What&apos;s his name?&quot;<br>B: &quot;His name is Buffy.&quot;<br>A: &quot;Hi Buffy. You&apos;re so cute. Do you come here for a walk often?&quot;<br>B: &quot;About 3 times a week. It&apos;s a good walk and Buffy likes it too.&quot;<br>A: &quot;It&apos;s a great place for a walk. I wish I had a trail like this at home.&quot;<br>B: &quot;Where are you from?&quot;<br>A: &quot;I&apos;m visiting from Korea. I live in the city so there aren&apos;t many places like this.&quot;<br>B: &quot;I guess that&apos;s one thing good about suburban life.&quot;<br>A: &quot;I wouldn&apos;t mind the slower pace of life. I am always in a hurry. That&apos;s why I wanted to come and relax.&quot;<br>B: &quot;That&apos;s good. How long are you staying for?&quot;<br>A: &quot;I&apos;m here for about three weeks. Oh, it looks like Buffy wants to go.&quot;<br>B: &quot;Yeah. Well, it was nice meeting you. I hope you have a good time here.&quot;<br>A: &quot;Thanks. It was nice talking to you.&quot;<br></td></tr></table>"
}