{
    "lessonIndex": 846,
    "categoryIndex": 6,
    "sectionIndex": 3,
    "title": "Advanced Listening Lesson #14",
    "link": "http://www.talkenglish.com/listening/lessonlisten.aspx?ALID=313",
    "html": "<h1>Advanced Listening Lesson #14</h1><b><u>Step 1:</u>&#xA0; <a href=\"http://www.talkenglish.com/AudioTE1/L104/practice/L104P2.mp3\">Listen to Dialog</a></b><br><br>Do not view the questions until after you have listened to the audio file. Reading the questions first will not help you improve your English listening skills.<br><br><b><u>Step 2:</u>&#xA0; <a href=\"javascript:showHide(&apos;div1&apos;)\">Quiz - View Questions</a></b><br><div id=\"div1\" style=\"DISPLAY: none\"><br>1. &#xA0;Why is Billy on a diet?<br><input name=\"Question1\" type=\"radio\" value=\"a\"> Wants to be mentally and physically healthy prior to proposing<br><input name=\"Question1\" type=\"radio\" value=\"b\"> Wants to look sexy for her girlfriend<br><input name=\"Question1\" type=\"radio\" value=\"c\"> Feels sick all the time and wants to improve his health<br><input name=\"Question1\" type=\"radio\" value=\"d\"> Because he has diabetes and the doctor told him to lose weight<br><br>2. &#xA0;What is a six pack in this conversation?<br><input name=\"Question2\" type=\"radio\" value=\"a\"> 6 cans of cold beer<br><input name=\"Question2\" type=\"radio\" value=\"b\"> 6 bottles of coke<br><input name=\"Question2\" type=\"radio\" value=\"c\"> 6 packs of cigarettes<br><input name=\"Question2\" type=\"radio\" value=\"d\"> 6 muscles in the stomach showing up<br><br>3. &#xA0;What type of special is available at the gym?<br><input name=\"Question3\" type=\"radio\" value=\"a\"> No specials right now, but will have one in the winter<br><input name=\"Question3\" type=\"radio\" value=\"b\"> Free for the first three months<br><input name=\"Question3\" type=\"radio\" value=\"c\"> Free enrollment and first month free<br><input name=\"Question3\" type=\"radio\" value=\"d\"> Free enrollment and half price on the first month<br><br>4. &#xA0;What time are they going to meet?<br><input name=\"Question4\" type=\"radio\" value=\"a\"> In the morning<br><input name=\"Question4\" type=\"radio\" value=\"b\"> In the afternoon<br><input name=\"Question4\" type=\"radio\" value=\"c\"> At 3pm<br><input name=\"Question4\" type=\"radio\" value=\"d\"> Undecided. &#xA0;He will call in the morning<br><input name=\"CorrectAnswers\" type=\"hidden\" value=\"adcd\"> <br><input type=\"button\" value=\"Check Answer\" onclick=\"CheckScore()\"> <br><span id=\"ScoreText\"></span><br><b><a href=\"javascript:showHide(&apos;div2&apos;)\"><u>View Answers</u></a></b><br><div id=\"div2\" style=\"DISPLAY: none\"><br>1. Wants to be mentally and physically healthy prior to proposing<br>2. 6 muscles in the stomach showing up<br>3. Free enrollment and first month free<br>4. Undecided. &#xA0;He will call in the morning</div></div><br>If you are uncertain about the answers to the questions, listen to the audio file again after having read the questions. After you have made all your selections, you may view the answers to see how you did.<br><br><b><u>Step 3:</u>&#xA0; <a href=\"javascript:showHide(&apos;div3&apos;)\">Show Conversation Dialog</a></b><div id=\"div3\" style=\"DISPLAY: none\"><br>A: &quot;Wow Billy. Looks like you lost a lot of weight. I could hardly recognize you.&quot;<br>B: &quot;Thanks. I&apos;ve been on a diet for about 6 months. I&apos;m going to ask Rachel to marry me soon and I want to be mentally and physically healthy.&quot;<br>A: &quot;What does being overweight have anything to do with marriage? If you love each other, that&apos;s enough right?&quot;<br>B: &quot;Yeah, but I want to show her how much she means to me, and this is one way of proving it. I am changing for the better.&quot;<br>A: &quot;Good for you. Hey, when do you plan on proposing to her?&quot;<br>B: &quot;I think I am going to propose to her on our 2 year anniversary.&quot;<br>A: &quot;Is she expecting it, or will it be a surprise?&quot;<br>B: &quot;I think she expects me to ask her one of these days, but not anytime soon.&quot;<br>A: &quot;You sure you want to settle down already? You&apos;re only 25 years old?&quot;<br>B: &quot;Yeah, I didn&apos;t think I would get married until I was 30, but when you know she is the one, why wait.&quot;<br>A: &quot;That&apos;s true. Hey, I hope everything works out. You&apos;re going to invite me to your wedding right?&quot;<br>B: &quot;Of course man.&quot;<br>A: &quot;Gosh, I&apos;m still shocked how much weight you lost. You&apos;re getting real skinny now.&quot;<br>B: &quot;I am working on a six pack now. I have two lines starting to show up. I&apos;ve been spending a lot of time at the gym. It is hard work, but I feel so good after working out.&quot;<br>A: &quot;Where do you work out?&quot;<br>B: &quot;I have a membership at Bally&apos;s. It&apos;s not too expensive and I like all the equipment they have.&quot;<br>A: &quot;I&apos;ve been thinking about joining a gym. Are they having any specials right now?&quot;<br>B: &quot;Yeah, they do. They have free enrollment and first month free. You should come by. I&apos;ll show you around. I can take in a guest so you can try it out before signing up.&quot;<br>A: &quot;That sounds good. Let&apos;s go this Saturday.&quot;<br>B: &quot;Cool. I&apos;ll call you in the morning.&quot;<br></div><br><br>You should read the Conversation Dialog to help you study after going through the listening lesson. Do not view the Conversation Dialog prior to listening to the audio, or prior to answering all the questions.<br><br><b>Download all the conversations</b> for your mp3 player. Hundreds of dialogs and printable lessons are available for download in the TalkEnglish Offline Package. &#xA0;Go to the <a href=\"/english-download.aspx\">English Download</a> page and download today!<br><br><br>"
}