{
    "categoryIndex": 6,
    "sectionIndex": 3,
    "title": "Advanced Listening Lesson #27",
    "link": "http://www.talkenglish.com/listening/lessonlisten.aspx?ALID=326",
    "lessonIndex": 859,
    "html": "<h1>Advanced Listening Lesson #27</h1><b><u>Step 1:</u>&#xA0; <a href=\"http://www.talkenglish.com/AudioTE1/L144/practice/L144P4.mp3\">Listen to Dialog</a></b><br><br>Do not view the questions until after you have listened to the audio file. Reading the questions first will not help you improve your English listening skills.<br><br><b><u>Step 2:</u>&#xA0; <a href=\"javascript:showHide(&apos;div1&apos;)\">Quiz - View Questions</a></b><br><div id=\"div1\" style=\"DISPLAY: none\"><br>1. &#xA0;What was the obvious clue Mike gave to Pam regarding a possible proposal?<br><input name=\"Question1\" type=\"radio\" value=\"a\"> Gave her a watch<br><input name=\"Question1\" type=\"radio\" value=\"b\"> Asked her what type of ring she likes<br><input name=\"Question1\" type=\"radio\" value=\"c\"> Showed her a wedding catalog<br><input name=\"Question1\" type=\"radio\" value=\"d\"> Acted silly and cute around her<br><br>2. &#xA0;How does the other girl feel after breaking up with Brad?<br><input name=\"Question2\" type=\"radio\" value=\"a\"> She is a little depressed<br><input name=\"Question2\" type=\"radio\" value=\"b\"> She is actually feeling good<br><input name=\"Question2\" type=\"radio\" value=\"c\"> She doesn&apos;t have any feelings right now<br><input name=\"Question2\" type=\"radio\" value=\"d\"> She hated Brad, so she is happy<br><br>3. &#xA0;What was her biggest complaint about Brad?<br><input name=\"Question3\" type=\"radio\" value=\"a\"> He was boring and didn&apos;t like to go out<br><input name=\"Question3\" type=\"radio\" value=\"b\"> He was too wild and wanted to party all the time<br><input name=\"Question3\" type=\"radio\" value=\"c\"> He was a romantic that wasn&apos;t very realistic<br><input name=\"Question3\" type=\"radio\" value=\"d\"> He was too weird wanting to go on walks down the beach all the time<br><br>4. &#xA0;Where are the ladies going to find a guy?<br><input name=\"Question4\" type=\"radio\" value=\"a\"> Going to a bar this Friday night<br><input name=\"Question4\" type=\"radio\" value=\"b\"> Going to a club this Saturday night<br><input name=\"Question4\" type=\"radio\" value=\"c\"> Going to the library tomorrow night<br><input name=\"Question4\" type=\"radio\" value=\"d\"> Going to the mall after school<br><input name=\"CorrectAnswers\" type=\"hidden\" value=\"bbab\"> <br><input type=\"button\" value=\"Check Answer\" onclick=\"CheckScore()\"> <br><span id=\"ScoreText\"></span><br><b><a href=\"javascript:showHide(&apos;div2&apos;)\"><u>View Answers</u></a></b><br><div id=\"div2\" style=\"DISPLAY: none\"><br>1. Asked her what type of ring she likes<br>2. She is actually feeling good<br>3. He was boring and didn&apos;t like to go out<br>4. Going to the club this Saturday night</div></div><br>If you are uncertain about the answers to the questions, listen to the audio file again after having read the questions. After you have made all your selections, you may view the answers to see how you did.<br><br><b><u>Step 3:</u>&#xA0; <a href=\"javascript:showHide(&apos;div3&apos;)\">Show Conversation Dialog</a></b><div id=\"div3\" style=\"DISPLAY: none\"><br>A: &quot;What did Mike get you for your birthday Pam?&quot;<br>B: &quot;He got me a watch. See.&quot;<br>A: &quot;That&apos;s beautiful. He must have spent a fortune on it.&quot;<br>B: &quot;He&apos;s so great. I think he might propose pretty soon.&quot;<br>A: &quot;How do you know? Did he give you any clues?&quot;<br>B: &quot;He took me to a jewelry store and asked me what type of rings I like. It was a little obvious, but at least I got to pick the one I wanted.&quot;<br>A: &quot;That&apos;s not so romantic?&quot;<br>B: &quot;He was never romantic. Silly and cute, but not romantic. I like all his quirkiness. He always makes me laugh.&quot;<br>A: &quot;I guess you can&apos;t ask for much more than that.&quot;<br>B: &quot;How is it going with you and Brad?&quot;<br>A: &quot;We broke up a week ago.&quot;<br>B: &quot;I&apos;m sorry to hear that. What happened?&quot;<br>A: &quot;I think we both just started to grow apart. I wasn&apos;t surprised.&quot;<br>B: &quot;Are you doing ok?&quot;<br>A: &quot;Actually, I&apos;m feeling great. I guess I needed some freedom.&quot;<br>B: &quot;Have you started seeing other guys yet?&quot;<br>A: &quot;Not yet, but I when I meet a decent guy, I wouldn&apos;t mind dating again.&quot;<br>B: &quot;What kind of guy are you looking for?&quot;<br>A: &quot;Although my relationship with Brad wasn&apos;t that bad, I want a guy who likes to go out more. Brad always spent all his time studying and researching for school. It was quite boring.&quot;<br>B: &quot;You definitely need a guy who likes to have fun.&quot;<br>A: &quot;I wouldn&apos;t mind dating a romantic guy. Maybe I&apos;m dreaming, but a nice walk down the beach, or dancing in the moonlight would be something I would love to do.&quot;<br>B: &quot;Hey. There are guys like that. All you have to do is find the right one.&quot;<br>A: &quot;But that&apos;s the hard part. I always fall for the guy who is smart. And then after a couple of months, I get bored.&quot;<br>B: &quot;Doesn&apos;t a tall, good looking guy turn you on?&quot;<br>A: &quot;Not really. What should I do?&quot;<br>B: &quot;We should go to a club this Saturday and find a smart romantic guy. How does that sound?&quot;<br>A: &quot;That sounds like a plan. Let&apos;s do it.&quot;<br>B: &quot;Great. I&apos;ll see you at nine then.&quot;<br>A: &quot;Ok. See you later.&quot;<br></div><br><br>You should read the Conversation Dialog to help you study after going through the listening lesson. Do not view the Conversation Dialog prior to listening to the audio, or prior to answering all the questions.<br><br><b>Download all the conversations</b> for your mp3 player. Hundreds of dialogs and printable lessons are available for download in the TalkEnglish Offline Package. &#xA0;Go to the <a href=\"/english-download.aspx\">English Download</a> page and download today!<br><br><br>"
}