{
    "lessonIndex": 866,
    "categoryIndex": 6,
    "sectionIndex": 3,
    "title": "Advanced Listening Lesson #34",
    "link": "http://www.talkenglish.com/listening/lessonlisten.aspx?ALID=333",
    "html": "<h1>Advanced Listening Lesson #34</h1><b><u>Step 1:</u>&#xA0; <a href=\"http://www.talkenglish.com/AudioTE1/L181/practice/L181P4.mp3\">Listen to Dialog</a></b><br><br>Do not view the questions until after you have listened to the audio file. Reading the questions first will not help you improve your English listening skills.<br><br><b><u>Step 2:</u>&#xA0; <a href=\"javascript:showHide(&apos;div1&apos;)\">Quiz - View Questions</a></b><br><div id=\"div1\" style=\"DISPLAY: none\"><br>1. &#xA0;How did Mark get such a big belly?<br><input name=\"Question1\" type=\"radio\" value=\"a\"> From watching too much TV<br><input name=\"Question1\" type=\"radio\" value=\"b\"> From eating too much food<br><input name=\"Question1\" type=\"radio\" value=\"c\"> From drinking too much beer<br><input name=\"Question1\" type=\"radio\" value=\"d\"> From eating too much potato chips<br><br>2. &#xA0;What motivation is the guy with the belly using to start working out?<br><input name=\"Question2\" type=\"radio\" value=\"a\"> To get some girls<br><input name=\"Question2\" type=\"radio\" value=\"b\"> To get rid of the belly<br><input name=\"Question2\" type=\"radio\" value=\"c\"> To get healthier<br><input name=\"Question2\" type=\"radio\" value=\"d\"> To get in shape<br><br>3. &#xA0;Why is one guy asking if the other guy will join the health club if he already said he would?<br><input name=\"Question3\" type=\"radio\" value=\"a\"> He didn&apos;t hear it the first time<br><input name=\"Question3\" type=\"radio\" value=\"b\"> He thought it was a joke so he didn&apos;t take him seriously<br><input name=\"Question3\" type=\"radio\" value=\"c\"> He doesn&apos;t want him to join the health club<br><input name=\"Question3\" type=\"radio\" value=\"d\"> He doesn&apos;t want to share the girls<br><br>4. &#xA0;What are they going to do after this conversation?<br><input name=\"Question4\" type=\"radio\" value=\"a\"> They are going to eat dinner<br><input name=\"Question4\" type=\"radio\" value=\"b\"> They are going to drink beer<br><input name=\"Question4\" type=\"radio\" value=\"c\"> They are going to hunt for some girls<br><input name=\"Question4\" type=\"radio\" value=\"d\"> They are going to work out at the health club<br><input name=\"CorrectAnswers\" type=\"hidden\" value=\"cabb\"> <br><input type=\"button\" value=\"Check Answer\" onclick=\"CheckScore()\"> <br><span id=\"ScoreText\"></span><br><b><a href=\"javascript:showHide(&apos;div2&apos;)\"><u>View Answers</u></a></b><br><div id=\"div2\" style=\"DISPLAY: none\"><br>1. From drinking too much beer<br>2. To get some girls<br>3. He thought it was a joke so he didn&apos;t take him seriously<br>4. They are going to drink beer</div></div><br>If you are uncertain about the answers to the questions, listen to the audio file again after having read the questions. After you have made all your selections, you may view the answers to see how you did.<br><br><b><u>Step 3:</u>&#xA0; <a href=\"javascript:showHide(&apos;div3&apos;)\">Show Conversation Dialog</a></b><div id=\"div3\" style=\"DISPLAY: none\"><br>A: &quot;Damn Mark. I never noticed that belly of yours.&quot;<br>B: &quot;It&apos;s all the beer. I need to start working out again.&quot;<br>A: &quot;That reminds me. I should&apos;ve hit the gym today.&quot;<br>B: &quot;Where do you work out?&quot;<br>A: &quot;At Bally&apos;s. It&apos;s pretty close to home so it is convenient.&quot;<br>B: &quot;How much are you paying?&quot;<br>A: &quot;I only pay 20 bucks a month.&quot;<br>B: &quot;That&apos;s pretty good. I think I should join.&quot;<br>A: &quot;If you join, we could work out together. It&apos;s so much better working out with another person. It&apos;s hard to motivate yourself when you are alone.&quot;<br>B: &quot;What do you usually do in the gym?&quot;<br>A: &quot;I usually spend about 20 minutes on the step master, and then lift weights for about an hour.&quot;<br>B: &quot;Do you go everyday?&quot;<br>A: &quot;No. I try to go 4 times a week, but lately, I&apos;ve been only going about 2 times a week. That&apos;s why I need you there. You should join.&quot;<br>B: &quot;Will it help me to get some girls?&quot;<br>A: &quot;If you get rid of that belly of yours, I promise you&apos;ll have a better chance with girls. Anyways, there are so many fine chicks working out at the club.&quot;<br>B: &quot;Really? I&apos;m signing up tomorrow.&quot;<br>A: &quot;There are some girls with tight outfits. You can see the shape of their body and some of them are really fine.&quot;<br>B: &quot;As long as there are some ladies with nice legs, I don&apos;t mind.&quot;<br>A: &quot;So you&apos;re really going to join?&quot;<br>B: &quot;Yeah. Let&apos;s go in tomorrow and I&apos;ll sign up. We can work out together.&quot;<br>A: &quot;Cool. Let&apos;s go hit some bars to celebrate.&quot;<br>B: &quot;I&apos;m down with that.&quot;<br></div><br><br>You should read the Conversation Dialog to help you study after going through the listening lesson. Do not view the Conversation Dialog prior to listening to the audio, or prior to answering all the questions.<br><br><b>Download all the conversations</b> for your mp3 player. Hundreds of dialogs and printable lessons are available for download in the TalkEnglish Offline Package. &#xA0;Go to the <a href=\"/english-download.aspx\">English Download</a> page and download today!<br><br><br>"
}