{
    "lessonIndex": 887,
    "categoryIndex": 7,
    "sectionIndex": 1,
    "title": "Count Nouns vs. Non-Count Nouns\r\n",
    "link": "http://www.talkenglish.com/Grammar/count-nouns.aspx",
    "html": "<h1>Count Nouns vs. Non-Count Nouns\r\n</h1><h2>Count nouns</h2> Can be counted as one or more.<br><br><ul><li>pen, computer, bottle, spoon, desk, cup, television, chair, shoe, finger, flower, camera, stick, balloon, book, table, comb, etc.</li></ul>Take an s to form the plural.<br><br><ul><li>pens, computers, bottles, spoons, desks, cups, televisions, chairs, shoes, fingers, flowers, cameras, sticks, balloons, books, tables, combs, etc.</li></ul>Work with expressions such as (a few, few, many, some, every, each, these, and the number of).<br><br><ul><li>a few pens, a few computers, many bottles, some spoons, every desk, each cup, these televisions, the number of chairs, a few shoes, a few fingers, many flowers, some cameras, every stick, each balloon, these books, the number of tables, many combs, etc.</li></ul>Work with appropriate articles (a, an, or the).<br><br><ul><li>a pen, the computer, a bottle, the spoon, a desk, the cup, a television, the chair, a shoe, the finger, a flower, the camera, a stick, the balloon, a book, the table, a comb, etc.</li></ul>Do NOT work with <i>much</i> (for example, you would never say <i>much pens</i> or <i>much computers</i>).<h2>Non-count nouns</h2>Cannot be counted. They usually express a group or a type.<br><br><ul><li>water, wood, ice, air, oxygen, English, Spanish, traffic, furniture, milk, wine, sugar, rice, meat, flour, soccer, sunshine, etc.</li></ul>Generally cannot be pluralized.<br><br>Work both with and without an article (<i>a, an, or the</i>), depending on the context of the sentence.<br><br><ul><li>Sugar is sweet.</li><li>The sunshine is beautiful.</li><li>I drink milk.</li><li>He eats rice.</li><li>We watch soccer together.</li><li>The wood is burning.</li></ul>Work with expressions such as (some, any, enough, this, that, and much).<br><br><ul><li>We ate some rice and milk.</li><li>I hope to see some sunshine today.</li><li>This meat is good.</li><li>She does not speak much Spanish.</li><li>Do you see any traffic on the road?</li><li>That wine is very old.</li></ul>Do NOT work with expressions such as (these, those, every, each, either, or neither).<br><br><b><font size=\"3\">[Quiz 2.1]</font></b><br><br>Choose all of the non-count nouns in the following list:<br><br>wine, student, pen, water, wind, milk, computer, furniture, cup, rice, box, watch, potato, wood<br><br><a href=\"javascript:showHide(&apos;div1&apos;)\"><font size=\"3\"><b>View Answers</b></font></a><div id=\"div1\" style=\"DISPLAY: none\">[2.1]<br>wine, water, wind, milk, furniture, rice, wood<br></div>"
}