{
    "lessonIndex": 896,
    "categoryIndex": 7,
    "sectionIndex": 1,
    "title": "Progressive and Perfect Tense\r\n",
    "link": "http://www.talkenglish.com/Grammar/progressive-and-perfect-tense.aspx",
    "html": "<h1>Progressive and Perfect Tense\r\n</h1><h2>Progressive Tense</h2>The progressive tense involves action that is, was, or will be in progress at a certain time. In the progressive tense, verbs are formed with a &quot;be&quot; verb + ing.<br><br><b>run</b><br><br><ul><li>I am running a marathon right now. (present progressive)</li><li>I was running a marathon at this time last year. (past progressive)</li><li>I will be running a marathon next Sunday. (future progressive)</li></ul><b>eat</b><br><br><ul><li>I am eating lunch now.</li><li>I was eating lunch when you saw me.</li><li>I will be eating lunch in the meeting.</li></ul><b>learn</b><br><br><ul><li>I am learning English at my desk.</li><li>I was learning English the last two years.</li><li>I will be learning English then.</li></ul><b>cook</b><br><br><ul><li>I am cooking my supper now.</li><li>I was cooking our dinner when you called me.</li><li>I will be cooking breakfast by the time you come home.</li></ul><h2>Perfect Tense</h2>The present perfect tense describes an action that started in the past and continues to the present time. Use <i>has/have</i> + the past participle form of the verb.<br><br>The past perfect tense describes an action that started and ended in the past. Use <i>had</i> + the past participle form of the verb.<br><br>The future perfect tense describes future actions that will occur before some other action. Use <i>will have</i> + the past participle form of the verb.<br><br><b>run</b><br><br><ul><li>I have run several marathons this year. (present perfect)</li><li>I had run many marathons in the past. (past perfect)</li><li>I will have run a marathon by the time I turn 30. (future perfect)</li></ul><b>learn</b><br><br><ul><li>I have learned a lot about English grammar this semester.</li><li>I had learned the basics of English grammar in elementary school.</li><li>I will have learned a lot about English grammar when I finish college.</li></ul><b>know</b><br><br><ul><li>I have known her since I was young.</li><li>I had known her until she passed away.</li><li>I will have known her for 20 years next month.</li></ul><b>cook</b><br><br><ul><li>I have cooked supper every night this week.</li><li>I had cooked supper every night until the stove broke.</li><li>I will have cooked supper every night by the time this diet ends.</li></ul><br><b><font size=\"3\">[Quiz 11.1]</font></b><br><br>Using the following sentence and create three more sentences using the present, past, and future progressive tenses.<br><br>I sing a song on the big stage.<br><br><br><b><font size=\"3\">[Quiz 11.2]</font></b><br><br>Fill in the blanks with the correct form of the verb given.<br><br>1)He <u>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;</u> (exercise) hard since last year.<br>2)I <u>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;</u> (study) math as my major since high school.<br><br><a href=\"javascript:showHide(&apos;div1&apos;)\"><font size=\"3\"><b>View Answers</b></font></a><div id=\"div1\" style=\"DISPLAY: none\">[11.1]<br>I am singing a song on the big stage.<br>I was singing a song on the big stage.<br>I will be singing a song on the big stage.<br><br>[11.2]<br>1) has exercised<br>2) have studied<br></div>"
}