{
    "categoryIndex": 1,
    "sectionIndex": 0,
    "title": "Bored - Interactive Practice",
    "link": "http://www.talkenglish.com/lessonpractice.aspx?ALID=822",
    "lessonIndex": 96,
    "html": "<h1>Bored - Interactive Practice</h1>Click on Listen All and follow along. After becoming comfortable with the entire conversation, become Person A by clicking on the Person A button. You will hear only Person B through the audio file. There will be a silence for you to repeat the sentences of Person A. Do the same for Person B. The speed of the conversation is native speed. Use the pause button if the pause between each sentence is too fast for you. After practicing several times, you will be able to speak as fast as a native.<table border=\"0\"><tr><td>1 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L6/practice/L6P1.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L6/practice/L6P1b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L6/practice/L6P1a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hey there. What have you been up to?&quot;<br>B: &quot;Nothing really.&quot;<br>A: &quot;How about your work?&quot;<br>B: &quot;It&apos;s so boring there. I really wish I had a different job.&quot;<br>A: &quot;Is it really that bad?&quot;<br>B: &quot;Yeah. Most of the time, I have nothing to do. But whenever I have something to do, it&apos;s boring work because it is the same old thing.&quot;<br>A: &quot;Why don&apos;t you find a different job then?&quot;<br>B: &quot;Maybe I should.&quot;<br><br></td></tr><tr><td>2 &#xA0;&#xA0;&#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L6/practice/L6P2.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L6/practice/L6P2b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L6/practice/L6P2a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hi Steve, what&apos;s your plan for tonight?&quot;<br>B: &quot;I don&apos;t have any plans. Are you doing anything special?&quot;<br>A: &quot;Well, if you&apos;re bored, let&apos;s plan on meeting up tonight.&quot;<br>B: &quot;That sounds like a good idea. Should we invite Bob?&quot;<br>A: &quot;He&apos;s a little boring.&quot;<br>B: &quot;What do you mean?&quot;<br>A: &quot;Well, he doesn&apos;t drink, play video games, pool, or really anything. The only thing he talks about is history.&quot;<br>B: &quot;You do have a point. We&apos;ll leave him out tonight.&quot;<br>A: &quot;Aright. Let&apos;s meet at 8:30 in front of the university bookstore.&quot;<br>B: &quot;Perfect. I&apos;ll see you later tonight.&quot;<br><br></td></tr><tr><td>3 &#xA0;</td></tr><tr><td><a href=\"http://www.talkenglish.com/AudioTE1/L6/practice/L6P3.mp3\">Listen All</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L6/practice/L6P3b.mp3\">Person A</a>&#xA0;&#xA0;|&#xA0;&#xA0;<a href=\"http://www.talkenglish.com/AudioTE1/L6/practice/L6P3a.mp3\">Person B</a></td></tr><tr><td>A: &quot;Hello&quot;<br>B: &quot;Hi Jane&quot;<br>A: &quot;Oh, hi Jill.&quot;<br>B: &quot;What are you doing?&quot;<br>A: &quot;I&apos;m doing the laundry.&quot;<br>B: &quot;I&apos;m so bored. I have nothing to do.&quot;<br>A: &quot;Why don&apos;t you come over and help me with the laundry?&quot;<br>B: &quot;I&apos;d rather do my own house chores. Hey, you wanna take a break from your house work and have coffee at Starbucks with me?&quot;<br>A: &quot;Sure, that sounds great. I&apos;ll meet you there in thirty minutes.&quot;<br></td></tr></table>"
}